// Все шаблонные сообщения для конструктора
window.templateData = {
  'Junior': {
    'ScratchJr': {
      '1 урок': `Поздравляю всех с завершением 1-го урока курса и посвящением в программисты!

Сегодня у нас прошёл урок №1 модуля ScratchJr.
На нём мы с вами:
- изучили понятия "исполнитель", "команда" и "программа";
- познакомились с интерфейсом программы ScratchJr;
- узнали, что такое спрайты и скрипты;
- написали свои первые программы для спрайтов;
- сделали анимацию "Африканские гонки"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с координатами;
- узнаем, что такое "циклы" и какие они бывают;
- научимся создавать и переключать страницы;
- сделаем игру "Приключения лягушонка"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля ScratchJr.
На нём мы с вами:
- познакомились с координатами;
- узнали, что такое "циклы" и какие они бывают;
- научились создавать и переключать страницы;
- сделали игру "Приключения лягушонка"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся отправлять и получать сообщения;
- научимся создавать заставку для игры;
- сделаем игру "Волшебник"!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля ScratchJr.
На нём мы с вами:
- научились отправлять и получать сообщения;
- научились создавать заставку для игры;
- сделали игру "Волшебник"!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior ScratchJr!
На уроке мы:
- научимся создавать кнопки;
- узнаем, что такое "таймер";
- сделаем игру "Космос";
- подведём итоги модуля!`,
      '4 урок': `Сегодня у нас прошёл последний урок (№4) модуля Junior CodeJr.
На нём мы с вами:
- научились создавать кнопки;
- узнали, что такое "таймер";
- сделали игру "Космос";
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - Scratch!
Scratch - это среда программирования, созданная специально для детей. В этом модуле мы научимся парковаться, зарядим робота, создадим рисовалку и другие проекты. А в конце модуля вы сами придумаете и создадите свою игру!
На следующем уроке мы:
- познакомимся с программой Scratch;
- узнаем, что такое "спрайт" и "скрипт";
- научимся собирать собственные скрипты;
- создадим анимацию "Царапка - охотник за привидениями"!

К следующему занятию, пожалуйста, установите Scratch на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Scratch:
https://docs.google.com/document/d/1Z1F6yGDBAJ0-SuhkSsSkgiWHbama_2FneYlxd8S5ogQ/edit?usp=sharing`
    },
    'Scratch': {
      '1 урок': `Заготовка 
https://drive.google.com/file/d/1qFFj4jFB2IQZSyhedK9KjVnqUqtOvkMS/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LtTDY1hroCDSgb_wKzpF54bD0xfdDr0U/view?usp=sharing

Сегодня у нас прошёл урок №1 модуля Scratch.
На нём мы с вами:
- познакомились с программой Scratch;
- узнали, что такое "спрайт" и "скрипт";
- научились собирать собственные скрипты;
- создали анимацию "Царапка - охотник за привидениями"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся поближе со спрайтами;
- узнаем, как добавлять и менять фоны в игре;
- узнаем, как добавлять спрайтам спецэффекты;
- сделаем проект "Физкультминутка"!`,
      '2 урок': `Заготовка
https://drive.google.com/file/d/1qFFj4jFB2IQZSyhedK9KjVnqUqtOvkMS/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LtTDY1hroCDSgb_wKzpF54bD0xfdDr0U/view?usp=sharing

Сегодня у нас прошёл урок №2 модуля Scratch.
На нём мы с вами:
- познакомились поближе со спрайтами;
- узнали, как добавлять и менять фоны в игре;
- узнали, как добавлять спрайтам спецэффекты;
- сделали проект "Физкультминутка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим блоки движения для спрайтов;
- познакомимся с новым циклом;
- сделаем игру "Парковка"!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1ExAnzZPNbsz9ba9e33OqLKel490io9q9/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1GkT5kyhYVi9xDE-tSsPphrIXtDcTiIOC/view?usp=sharing

Сегодня у нас прошёл урок №3 модуля Scratch.
На нём мы с вами:
- изучили блоки движения для спрайтов;
- познакомились с новым циклом;
- сделали игру "Парковка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое условие и познакомимся с блоком "если, то";
- познакомимся с сенсорами;
- научимся дублировать объекты и скрипты;
- создадим игру "Обезьянка"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1BaoqlCkLQSryu5Z66EcxVXIhHJ2gi6nT/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1QqOMF3fnpDOaeVdtULn5VIZDG0_-k7_4/view?usp=sharing

Сегодня у нас прошёл урок №4 модуля Scratch.
На нём мы с вами:
- узнали, что такое условие и познакомились с блоком "если, то";
- познакомились с сенсорами;
- научились дублировать объекты и скрипты;
- создали игру "Обезьянка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с координатами;
- узнаем, что такое случайное число;
- начнём делать игру "Заряди робота"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1wR4INW6b-JgkmVkbH4M2I1Iuj2r2jM-a/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Lll7_Oi3geW1vf653rjs5oZlOncj6Wpz/view?usp=sharing

Сегодня у нас прошёл урок №5 модуля Scratch.
На нём мы с вами:
- познакомились с координатами;
- узнали, что такое случайное число;
- начали делать игру "Заряди робота"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке через 2 недели мы:
- узнаем, что такое переменная;
- познакомимся с операторами сравнения;
- доделаем игру "Заряди робота!"

Вторым сообщением:
Здравствуйте, дорогие родители!
Хотим заранее предупредить: на следующей неделе урок пройдёт в ИНДИВИДУАЛЬНОМ ФОРМАТЕ вместе с преподавателем английского языка.

В ближайших блоках по программированию ребёнку всё чаще будет встречаться английский: команды, интерфейсы, инструкции.
Поэтому данное занятие необходимо, чтобы понять, насколько ребёнку будет комфортно в темах, где используется английский.

На самом занятии ребёнок пообщается с преподавателем, выполнит задания, и мы сможем оценить его реальный уровень в работе с английским и дать рекомендации👍

В ближайшие дни с нами свяжется наш менеджер для назначения времени занятия по телефону либо в мессенджере.
Обратите, пожалуйста, внимание - участие родителя обязательно, поэтому выбирайте время урока, когда будете дома.`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1SRIuSmJSjMEYAB0HJJvSonY-QYlNgOxo/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1jC_LOI0PQcWFNSebt_B-7R8iuBHM6Pp4/view?usp=sharing

Сегодня у нас прошёл урок №6 модуля Scratch.
На нём мы с вами:
- узнали, что такое переменная;
- познакомились с операторами сравнения;
- доделали игру "Заряди робота"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с новым условным блоком "Если-то-иначе";
- познакомимся новым расширением "Перо";
- создадим проект-рисовалку!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/1ecAgqdDD4_DCmIZGnAIFz_tky1kAdPYZ/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/14pLtNGlFXI8iuvBtf5OsRbtFBRJEoJGX/view?usp=sharing

Сегодня у нас прошёл урок №7 модуля Scratch.
На нём мы с вами:
- познакомились с новым условным блоком "Если-то-иначе";
- познакомились новым расширением "Перо";
- создали проект-рисовалку!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять спрайты и фоны из файла;
- познакомимся с клонами и командами для работы с ними;
- начнём создавать игру "Майнкрафт"!`,
      '8 урок': `Заготовка
https://scratch.mit.edu/projects/1147284201

Заготовка на диске: https://drive.google.com/file/d/1VVFCZYeIIaYqdGG4xfVWntSk3b3E3xd3/view?usp=drive_link 

Готовый проект
https://drive.google.com/file/d/1y8MNelBeSd_H3fK-7y1jIhmBDJAlHOHk/view?usp=sharing

Сегодня у нас прошёл урок №8 модуля Scratch.
На нём мы с вами:
- научились добавлять спрайты и фоны из файла;
- познакомились с клонами и командами для работы с ними;
- начали создавать игру "Майнкрафт"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся использовать команды "Спросить и ждать" и "ответ";
- создадим второй уровень игры "Майнкрафт"!`,
      '9 урок': `Заготовка
https://scratch.mit.edu/projects/1147161828

Заготовка на диске: 
https://drive.google.com/file/d/1ZM6emuGeCR0HJQCgkT6QuiI07jmv3CYy/view?usp=sharing 


Готовый проект
https://drive.google.com/file/d/1zCooFTV5dS2jRpVeLCM8a4G5En_x5EWz/view?usp=sharing

Сегодня у нас прошёл урок №9 модуля Scratch.
На нём мы с вами:
- научились использовать команды "Спросить и ждать" и "ответ";
- создали второй уровень игры "Майнкрафт"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое логические операторы;
- создадим меню игры с кнопкой!`,
      '10 урок': `Заготовка
https://scratch.mit.edu/projects/1148213248

Заготовка на диске: 
https://drive.google.com/file/d/129TSdEPJvWhYTmZVIAlrwFT4i7FlqYbN/view?usp=sharing 

Готовый проект
https://drive.google.com/file/d/1o4zGSHDuxVk7Rz-3Q8svYPGlB0USFEEI/view?usp=sharing

Сегодня у нас прошёл урок №10 модуля Scratch.
На нём мы с вами:
- узнали, что такое логические операторы;
- создали меню игры с кнопкой!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем переходы между уровнями;
- создадим третий уровень в игре "Ферма"!`,
      '11 урок': `Заготовка
https://scratch.mit.edu/projects/1148324472

Заготовка на диске: 
https://drive.google.com/file/d/1dDXTa4JARSnog3O2lnJb3ai_-BP7Ci1_/view?usp=sharing 

Готовый проект
https://drive.google.com/file/d/1VbX1his918fkAZD0KpbG3vTIxiuiq2Os/view?usp=sharing

Сегодня у нас прошёл урок №11 модуля Scratch.
На нём мы с вами:
- запрограммировали переходы между уровнями;
- создали третий уровень в игре "Ферма"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем монеты: возможность покупки овощей, возможность сбора овощей и накопления монет;
- добавим условие победы!`,
      '12 урок': `Заготовка
https://scratch.mit.edu/projects/1148370133

Заготовка на диске: 
https://drive.google.com/file/d/1Bw0BWdnRJc4mnkYRdFhvxujYkJyLwjTF/view?usp=sharing 

Готовый проект
https://drive.google.com/file/d/15_58Swoc6W44IBgqfW1GgJlNLeGwQWu6/view?usp=sharing

Сегодня у нас прошёл урок №12 модуля Scratch.
На нём мы с вами:
- запрограммировали монеты: возможность покупки овощей, возможность сбора овощей и накопления монет;
- добавили условие победы!
Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- придумаем и опишем свой проект;
- начнём работать над придуманным проектом!`,
      '13 урок': `Сегодня у нас прошёл урок №13 модуля Scratch.
На нём мы с вами:
- придумали и описали свой проект;
- начали работать над придуманным проектом!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Scratch!
На уроке мы:
- доработаем свои проекты;
- подготовимся к защите и презентуем проекты;
- подведём итоги модуля!`,
      '14 урок': `Сегодня у нас прошёл последний урок (№14) модуля Junior Scratch.
На нём мы с вами:
- доработали свои проекты;
- подготовились к защите и презентовали проекты;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Minecraft!
На этом модуле мы научимся с вами строить различные трехмерные конструкции в Майнкрафт, будем конструировать различные мосты, копать туннели, узнаем, кто такой исполнитель и что такое алгоритм и программа, поймем, каким образом можно составить программу!
На следующем уроке мы:
- научимся ориентироваться в Minecraft и управлять персонажем;
- узнаем, кто такой «исполнитель», что такое «команда» и «программа»;
- познакомимся с нашим исполнителем - роботом-черепашкой;
- научимся программировать черепашку с помощью команд и составили для неё первую программу;
- научимся писать команду для смены дня и ночи.

К следующему занятию, пожалуйста, установите Minecraft и моды на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Minecraft: https://docs.google.com/document/d/1eH-c8lNG_nSK_icEupl8DeNr5f6mG6wu/edit?usp=sharing&ouid=101384562489296174291&rtpof=true&sd=true`
    },
    'Minecraft': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1dHKpC3eNP_5RJJZNF0aWeppNKql1eGUf?usp=sharing

Сегодня мы с вами:
- научились ориентироваться в Minecraft и управлять персонажем;
- узнали, кто такой «исполнитель», что такое «команда» и «программа»;
- познакомились с нашим исполнителем - роботом-черепашкой;
- научились программировать черепашку с помощью команд и составили для неё первую программу;
- научились писать команду для смены дня и ночи.

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим понятия "линейная программа" и "программирование";
- изучим новые команды для черепашки;
- запрограммируем черепашку на постройку бассейна!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1zgzBrTc8FOgklC-bT_RXZXQbFm8dcnsr?usp=sharing

Сегодня у нас прошёл урок №2 модуля Minecraft.
На нём мы с вами:
- изучили понятия "линейная программа" и "программирование";
- изучили новую команду "копать" для черепашки;
- запрограммировали черепашку на постройку бассейна!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим, что такое "алгоритм", "блок-схема" и научимся применять эти знания на практике;
- узнаем, как читать блок-схемы и писать программы по ним;
- научим черепашку ставить блоки и поможем ей достроить домик!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1YyDgk34tcFHwn1mRfKlyEUnZo16AFD7V?usp=sharing

Сегодня у нас прошёл урок №3 модуля Minecraft.
На нём мы с вами:
- изучили, что такое "алгоритм", "блок-схема" и применили эти знания на практике;
- узнали, как читать блок-схемы и писать программы по ним;
- изучили новую команду для черепашки "поставить блок" и помогли ей достроить домик!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "цикл" и используем его в программе для черепашки;
- построим с помощью цикла красивый фонтан!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/13Yt-YADjsb9cRFxyQSyiGwiglRPVBt7r/view?usp=sharing

Сегодня у нас прошёл урок №4 модуля Minecraft.
На нём мы с вами:
- узнали, что такое "цикл";
- научились писать программы для черепашки с использованием циклов;
- запрограммировали черепашку на постройку фонтана.

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с циклом while ("пока");
- изучим команду по поиску блока;
- научимся составлять программы с циклом while;
- починим водонапорную башню!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1jZgyxhRR3WzVuhypJ-qeyz1hylyiG26W?usp=sharing


Сегодня у нас прошёл урок №5 модуля Minecraft.
На нём мы с вами:
- познакомились с циклом while ("пока");
- изучили команду по поиску блока;
- научились составлять программы с циклом while;
- починили водонапорную башню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим алгоритм с ветвлением if-else;
- научимся писать программы для черепашки с использованием алгоритма ветвления;
- запрограммируем черепашку посадить деревья и построить лестницу.`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1uNQML5bgqpf31VkGwqcc5RvvO-PfKDec?usp=sharing

Сегодня у нас прошёл урок №6 модуля Minecraft.
На нём мы с вами:
- изучили алгоритм с ветвлением if-else;
- научились писать программы для черепашки с использованием алгоритма ветвления;
- запрограммировали черепашку посадить деревья и построить лестницу.

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Minecraft!
На уроке мы:
- построим свои собственные постройки;
- напишем свои собственные программы;
- подведём итоги модуля!`,
      '7 урок': `Сегодня у нас прошёл последний урок (№7) модуля Junior Minecraft.
На нём мы с вами:
- построили свои собственные постройки;
- написали свои собственные программы;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Tinkercad!
Tinkercad - это бесплатная среда для 3D-моделирования. В ней мы сделаем множество различных 3D-моделей, поработаем в разных режимах этой среды, а также научимся загружать созданные модели в игру Minecraft!
На следующем уроке мы:
- узнаем, что такое "трёхмерная графика", "3D-модель" и "3D-моделирование";
- познакомимся с программой Tinkercad;
- изучим основные горячие клавиши и инструменты;
- создадим свои первые 3D-модели: блок земли и Слайм из игры Minacraft!

К следующему занятию, пожалуйста, зайдите в свой личный кабинет Tinkercad! 
Напоминаю, что за самостоятельную подготовку ПО я награждаю 10 КодКойнами! 
Инструкция "Как ученику зайти в Tinkercad":
https://docs.google.com/document/d/13RKtm10l-5liAg2mNV0cyIBG9CuoQKZ4s_aho2AYiZc/edit?usp=sharing 
Ссылка на класс: 
Псевдоним:`
    },
    'Tinkercad': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Tinkercad.
На нём мы с вами:
- узнали, что такое "трёхмерная графика", "3D-модель" и "3D-моделирование";
- познакомились с программой Tinkercad;
- изучили основные горячие клавиши и инструменты;
- создали свои первые 3D-модели: блок земли и Слайм из игры Minacraft!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с новыми возможностями Tinkercad;
- научимся делать углубления в формах;
- создадим модель кирки из игры Minecraft;
- создадим проект "Логотип Minecraft"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Tinkercad.
На нём мы с вами:
- познакомились с новыми возможностями Tinkercad;
- научились делать углубления в формах;
- создали модель кирки из игры Minecraft;
- создали проект "Логотип Minecraft"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим 3D-модель собственного монстрика;
- познакомимся с новым режимом "Блоки" в Tinkercad;
- научимся сохранять свои 3D-модели на компьютере;
- научимся загружать 3D-модели в игру Minecraft!

К следующему занятию, пожалуйста, установите мод WorldEdit, чтобы можно было загружать свои модели в Minecraft!
Инструкция: https://docs.google.com/document/d/1_PXQbnU_YowRrBaIAzn0EfuAh7GKfUR0DCSjLZuQ3BA/edit?tab=t.0`,
      '3 урок': `Заготовка
https://disk.yandex.ru/d/Pv7bbdQxV3RM1g

Сегодня у нас прошёл урок №3 модуля Tinkercad.
На нём мы с вами:
- создали 3D-модель собственного монстрика;
- познакомились с новым режимом "Блоки" в Tinkercad;
- научились сохранять свои 3D-модели на компьютере;
- научились загружать 3D-модели в игру Minecraft!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как изменить размер рабочей плоскости;
- научимся запрещать редактирование формы;
- создадим проект "Локация из Майнкрафта"!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Tinkercad.
На нём мы с вами:
- узнали, как изменить размер рабочей плоскости;
- научились запрещать редактирование формы;
- создали проект "Локация из Майнкрафта"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с режимом "SimLab" в Tinkercad;
- познакомимся с новыми формами;
- познакомимся со свойствами материалов;
- научимся создавать видео в Tinkercad;
- создадим два 3D-проекта: "Сбей пирамидку" и "Разрушь дом"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Tinkercad.
На нём мы с вами:
- познакомились с режимом "SimLab" в Tinkercad;
- познакомились с новыми формами;
- познакомились со свойствами материалов;
- научились создавать видео в Tinkercad;
- создали два 3D-проекта: "Сбей пирамидку" и "Разрушь дом"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- продолжим работать в режиме "SimLab";
- создадим проект "Баскетбол"!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Tinkercad.
На нём мы с вами:
- продолжили работать в режиме "SimLab";
- создали проект "Баскетбол"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с типом проекта "Блоки кода" в Tinkercad;
- узнаем, что такое "координаты" и "цикл со счётчиком";
- научимся программировать в Tinkercad и запрограммируем создание снежинки;
- научимся создавать gif-файлы в Tinkercad!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Tinkercad.
На нём мы с вами:
- познакомились с типом проекта "Блоки кода" в Tinkercad;
- узнали, что такое "координаты" и "цикл со счётчиком";
- научились программировать в Tinkercad и запрограммировали создание снежинки;
- научились создавать gif-файлы в Tinkercad!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём создавать большой проект "Моя комната"!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Tinkercad.
На нём мы с вами:
- начали создавать большой проект "Моя комната"!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Tinkercad!
На уроке мы:
- доработаем комнату и загрузим её в игру Minecraft;
- подвёдем итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Junior Tinkercad.
На нём мы с вами:
- доработали комнату и загрузили её в игру Minecraft;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Kodu!
Kodu Game Lab - это визуальная среда программирование, в ней мы будем создавать 3D-игры. Мы сделаем такие игры, как морской бой и гонки, и будем в них устраивать соревнования!
На следующем уроке мы:
- познакомимся с интерфейсом среды Kodu;
- научимся работать с персонажами и объектами;
- научимся составлять первые программы в среде;
- создадим игру "Догонялки"!

К следующему занятию, пожалуйста, установите Kodu Game Lab на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Kodu Game Lab:
https://docs.google.com/document/d/1DGYJPK8s9JVA7ozBoYKedQWpzgDbL1JvSRHslNnz8Gg/edit?usp=drive_link`
    },
    'Kodu Game Lab': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Kodu Game Lab.
На нём мы с вами:
- познакомились с интерфейсом среды Kodu;
- научились работать с персонажами и объектами;
- научились составлять первые программы в среде;
- создали игру "Догонялки"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое локация;
- изучим блок "Всегда" и научились писать программы с ним;
- создадим игру "Морской бой"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Kodu Game Lab.
На нём мы с вами:
- узнали, что такое локация;
- изучили блок "Всегда" и научились писать программы с ним;
- создали игру "Морской бой"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как программировать перемещение персонажей по путям;
- изучим, что такое "алгоритм" и "блок-схема" и научились использовать их на практике;
- создадим свою гоночную игру!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Kodu Game Lab.
На нём мы с вами:
- узнали, как программировать перемещение персонажей по путям;
- изучили, что такое "алгоритм" и "блок-схема" и научились использовать их на практике;
- создали свою гоночную игру!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как программировать взаимодействие персонажей в играх;
- узнаем, что такое переменная;
- создадим игру "Футбол"!`,
      '4 урок': `Заготовка
https://drive.google.com/open?id=1DS-6Jf4CZB_Izpuc5Q1YbJVipC1HEf6Q

Сегодня у нас прошёл урок №4 модуля Kodu Game Lab.
На нём мы с вами:
- узнали, как программировать взаимодействие персонажей в играх;
- узнали, что такое переменная;
- создали игру "Футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим, какие бывают настройки мира в программе;
- узнаем, кто такие "родители" и порождаемые объекты;
- создадим квест - игру!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Kodu Game Lab.
На нём мы с вами:
- изучили, какие бывают настройки мира в программе;
- узнали, кто такие "родители" и порождаемые объекты;
- создали квест - игру!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как работать с камерой;
- изучим, как программировать переходы между уровнями
- создадим многоуровневую гоночную игру!`,
      '6 урок': `Заготовка
https://drive.google.com/open?id=13KmX1-8VxWvzJUzdObF9Ogr-6v96BbIi

Сегодня у нас прошёл урок №6 модуля Kodu Game Lab.
На нём мы с вами:
- узнали, как работать с камерой;
- изучили, как программировать переходы между уровнями
- создали многоуровневую гоночную игру!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим игру со сбором монеток;
- начнём работать над собственным проектом!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Kodu Game Lab.
На нём мы с вами:
- создали игру со сбором монеток;
- начали работать над собственным проектом!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Kodu Game Lab!
На уроке мы:
- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '8 урок': `Сегодня у нас прошёл последний урок (№8) модуля Junior Kodu Game Lab.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Stencyl!
Stencyl - это уже профессиональный движок для разработки игр. На модуле мы с Вами сделаем несколько интересных игр. Сначала мы создадим свой полноценный платформер, с главным героем черепашкой, у нас будут враги, порталы, а также мы будем собирать монетки! 
На следующем уроке мы:
- познакомимся с программой Stencyl;
- научимся добавлять плитки и актёров на сцену;
- научимся писать программы в Stencyl;
- сделаем первый уровень в игре!

К следующему занятию, пожалуйста, установите Stencyl на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Stencyl:
https://docs.google.com/document/d/172oKcMRGu_PFjh9FoHHONhqhowStbfqQlxrWLovPGAw/edit?usp=sharing`
    },
    'Stencyl': {
      '1 урок': `Готовый проект 
https://drive.google.com/file/d/1JSKq_KDqCaOuqMX4UisrTrI79EPgnyT6/view?usp=sharing

Сегодня у нас прошёл урок №1 модуля Stencyl.
На нём мы с вами:
- познакомились с программой Stencyl;
- научились добавлять плитки и актёров на сцену;
- научились писать программы в Stencyl;
- сделали первый уровень в игре!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с поведениями и научимся добавлять их актёрам;
- научимся писать программы с условиями в Stencyl;
- доработаем первый уровень в игре!`,
      '2 урок': `Заготовка
https://drive.google.com/file/d/1klaU_mja_GNqIum6zzTs7ROsQrNOmvq4/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1_-lcloLcnwGAoNBCBDSVt-AOeWvnez55/view?usp=sharing

Сегодня у нас прошёл урок №2 модуля Stencyl.
На нём мы с вами:
- познакомились с поведениями и научились добавлять их актёрам;
- научились писать программы с условиями в Stencyl;
- доработали первый уровень в игре!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с физикой актёров в Stencyl и научимся её настраивать;
- научимся применять блоки с координатами в программе и запрограммируем с помощью них телепорт!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1sO_8g1yOg3GMJHQrlzz_xKzZa-XXV79W/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/18Tnh5EfpcH5ZpmRsYvRCbZtJXZN88GPy/view?usp=sharing

Сегодня у нас прошёл урок №3 модуля Stencyl.
На нём мы с вами:
- познакомились с физикой актёров в Stencyl и научились её настраивать;
- научились применять блоки с координатами в программе и запрограммировали с помощью них телепорт!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с районами в Stencyl и запрограммировать смену сцены;
- научимся создавать атрибуты (переменные);
- запрограммируем подсчет монет и жизней и вывод этих переменных на экран!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1hH2dBrpPp9AM28ZywFCzYgSKA_dSMygc/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1VyNo3WroV0reQoox2V40E8lJ0f_-WW9G/view?usp=sharing

Сегодня у нас прошёл урок №4 модуля Stencyl.
На нём мы с вами:
- познакомились с районами в Stencyl и запрограммировали смену сцены;
- научились создавать атрибуты (переменные);
- запрограммировали подсчет монет и жизней и вывод этих переменных на экран!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся применять операторы сравнения и логические операторы в программировании;
- создадим сцены победы и поражения;
- запрограммируем условия победы и поражения!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1vXYJaHHtX0K03ohMmDLd_qnTeNwA1sWf/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1fSxpnyfT5EIlKZ6ahrUQ0Q4T-pbnDYZ2/view?usp=sharing

Сегодня у нас прошёл урок №5 модуля Stencyl.
На нём мы с вами:
- научились применять операторы сравнения и логические операторы в программировании;
- создали сцены победы и поражения;
- запрограммировали условия победы и поражения!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять звуки в игру;
- научимся создавать актёров самостоятельно;
- создадим и запрограммируем меню для игры!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/17P6ZDX5pGEITf-yU0LwMutR_0xVdHaXS?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Z8VQq2xIkc3MUDbdCQTa6UP7mJTd2Dg9/view?usp=sharing

Сегодня у нас прошёл урок №6 модуля Stencyl.
На нём мы с вами:
- научились добавлять звуки в игру;
- научились создавать актёров самостоятельно;
- создали и запрограммировали меню для игры!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем второго персонажа;
- начнём работать над собственным проектом!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/1k9KPUCXE-0ecWjarAbpLny2LcagS3W-P/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1vIt8F7sIm_PDpuuivZobGMK3I8FG04M1/view?usp=sharing

Сегодня у нас прошёл урок №7 модуля Stencyl.
На нём мы с вами:
- запрограммировали второго персонажа;
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- доделаем собственный проект;
- подготовимся к защите и проведем презентацию проектов!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Stencyl.
На нём мы с вами:
- доделали собственный проект;
- подготовились к защите и проведем презентацию проектов!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

Но на этом модуль Stencyl еще не закончился. На следующем уроке мы:
- познакомимся с арифметическими операторами и оператором сложения текста;
- познакомимся с атрибутами игры и простыми атрибутами;
- создадим игру "Лабиринт"!`,
      '9 урок': `Заготовка
https://drive.google.com/file/d/1OHs7HUF8Q1K396LntB9jASlDDW6ZDlLW/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1piKFraFzLUskqDPtH5nRgl3FUSek76qM/view?usp=sharing

Сегодня у нас прошёл урок №9 модуля Stencyl.
На нём мы с вами:
- познакомились с арифметическими операторами и оператором сложения текста;
- познакомились с атрибутами игры и простыми атрибутами;
- создали игру "Лабиринт"!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Stencyl!
На уроке мы:
- создадим игру "Инопланетное нашествие";
- подведём итоги модуля!`,
      '10 урок': `Заготовка
https://drive.google.com/file/d/1eaLAw8LS5etrHPgrBIUln8HQ2YXAwCSk/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1viqivwT4XE1_gNeqOq6xeSlKrQd3qr1A/view?usp=sharing

Сегодня у нас прошёл последний урок (№10) модуля Junior Stencyl.
На нём мы с вами:
- создали игру "Инопланетное нашествие";
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - App Inventor. В этой среде мы будем создавать приложения и игры для смартфонов и планшетов. В течение модуля мы сделаем несколько приложений и игр, которые можно будет тестировать прямо на вашем телефоне!
На следующем уроке мы:
- познакомимся с интерфейсом и основами работы в App Inventor;
- научимся создавать дизайн для приложения;
- научимся составлять скрипты для компонентов;
- создадим приложение "Drum Machine"!

К следующему занятию, пожалуйста, установите приложение для тестирования на свой телефон или эмулятор на компьютер! Напоминаю, что за самостоятельную подготовку ПО я награждаю 10 КодКойнами! 
Инструкция по установке программ для тестирования приложений из App Inventor:
https://docs.google.com/document/d/1Pdy40qSRQizRGB8G_L1zjLunNWSJsZpyLtSn8B7mIZY/edit?usp=sharing`
    },
    'Thunkable': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Thunkable.
На нём мы с вами:
- познакомились с интерфейсом и основами работы с блоками в Thunkable;
- научились разрабатывать дизайн для приложения;
- научились создавать скрипты для кнопок;
- создали приложение «Ударная установка»!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с координатами в Thunkable;
- познакомимся с новым компонентом Canvas (холст);
- научимся работать со спрайтами;
- напишем первые скрипты для спрайтов;
- сделаем игру "В погоне за жёлудем"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Thunkable.
На нём мы с вами:
- познакомились с координатами в Thunkable;
- познакомились с новым компонентом Canvas (холст);
- научились работать со спрайтами;
- написали первые скрипты для спрайтов;
- сделали игру "В погоне за жёлудем"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое случайное число;
- научимся переключаться между экранами;
- узнаем, что такое "условие";
- сделаем игру "Путешествие ракеты"!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Thunkable.
На нём мы с вами:
- узнали, что такое случайное число;
- научились переключаться между экранами;
- узнали, что такое "условие";
- сделали игру "Путешествие ракеты"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем перемещение спрайта в случайные координаты;
- познакомимся с таймером;
- познакомимся с операторами;
- сделаем игру "Поймай крота"!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Thunkable.
На нём мы с вами:
- запрограммировали перемещение спрайта в случайные координаты;
- познакомились с таймером;
- познакомились с операторами;
- сделали игру "Поймай крота"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать переменные в Thunkable;
- познакомимся с блоком If-Else;
- начнём делать игру "Скоростная сортировка"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Thunkable.
На нём мы с вами:
- узнали, как создавать переменные в Thunkable;
- познакомились с блоком If-Else;
- начали делать игру "Скоростная сортировка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем экран победы на вывод времени;
- добавим и запрограммировали кнопки перезапуска;
- познакомимся с функциями;
- закончим игру "Скоростная сортировка"!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Thunkable.
На нём мы с вами:
- запрограммировали экран победы на вывод времени;
- добавили и запрограммировали кнопки перезапуска;
- познакомились с функциями;
- закончили игру "Скоростная сортировка"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом Text Input;
- узнаем что такое "база данных", научились их создавать и использовать;
- научимся использовать возможности перевода и озвучки текста в Thunkable;
- сделаем приложение — переводчик!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Thunkable.
На нём мы с вами:
- познакомились с компонентом Text Input;
- узнали, что такое "база данных", научились их создавать и использовать;
- научились использовать возможности перевода и озвучки текста в Thunkable;
- сделали приложение — переводчик!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- будем работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Thunkable.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле Junior Thunkable!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Junior Thunkable.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Roblox!
Мы будем работать в Roblox Studio - это движок, который позволяет создавать свои собственные игры и миры для игровой платформы Roblox. На модуле мы научимся писать программы на языке программирования Lua, создадим несколько игр: мини-игру футбол, игру на выживание и игру со сбором ресурсов!
На следующем уроке мы:
- познакомимся со средой Roblox Studio;
- изучим инструменты в этой среде;
- создадим две постройки в игре: гараж и башню с лестницей! 

К следующему занятию, пожалуйста, установите Roblox Studio на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Roblox Studio:
https://docs.google.com/document/d/1xVsuDnJHm5TyvGohi61ezIDFxZ6ggPOMAjejPl7d438/edit?usp=drive_link`
    },
    'App Inventor': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1MNDzgVFgAwvGzzrcVt_o044sZyrsQHSu?usp=sharing

Готовый проект
https://drive.google.com/file/d/1x96cfq24ljUh7TxQanUVkFMUDkFFlOfG/view?usp=sharing

Сегодня у нас прошёл урок №1 модуля App Inventor.
На нём мы с вами:
- познакомились с интерфейсом и основами работы в App Inventor;
- научились создавать дизайн для приложения;
- научились составлять скрипты для компонентов;
- создали приложение "Drum Machine"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом "Холст" и научимся на нем рисовать разными цветами;
- узнаем, что такое "локальная переменная";
- узнаем, что такое "координаты";
- начнем создавать приложение "Рисовалка"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1zAfjdtPVaqOSqND05ygJmACSAOyBpWaU?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LgsnKoAiGMxD-onFcNpEveW1zPGn_MsF/view?usp=sharing

Сегодня у нас прошёл урок №2 модуля App Inventor.
На нём мы с вами:
- познакомились с компонентом "Холст" и научились на нем рисовать разными цветами;
- узнали, что такое "локальная переменная";
- узнали, что такое "координаты";
- начали создавать приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с группой блоков "Математика", со случайным числом;
- повторим, что такое циклы и условные блоки;
- познакомимся с циклом "для";
- закончим приложение "Рисовалка"!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1zHHfXCdIxYEG_W05VD78idrcNvmMZSqD?usp=sharing

Готовый проект
https://drive.google.com/file/d/1zNZ6SE7EVelDyASeqogZtHMomrdOYexb/view?usp=sharing

Сегодня у нас прошёл урок №3 модуля App Inventor.
На нём мы с вами:
- познакомились с группой блоков "Математика", со случайным числом;
- повторили, что такое циклы и условные блоки;
- познакомились с циклом "для";
- закончили приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "процедура";
- познакомимся с компонентами "Шар" и "Изображение спрайта";
- научимся анимировать спрайты;
- познакомимся с блоками "истина" и "ложь";
- создадим игру "Мини-гольф"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1rqhfcL2KBtgHnQ3B05BystfkO3yMQ3qD/view?usp=sharing


Готовый проект
https://drive.google.com/file/d/1-Ge_DRGqKYm7Zufe2u2envq3T9e4aJEs/view?usp=sharing

Сегодня у нас прошёл урок №4 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "процедура";
- познакомились с компонентами "Шар" и "Изображение спрайта";
- научились анимировать спрайты;
- познакомились с блоками "истина" и "ложь";
- создали игру "Мини-гольф"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "глобальная переменная";
- познакомимся с логическими операторами;
- повторим "координаты" и "процедуры";
- создадим игру "Тачки"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1OSB2T2kKRj2bhXn-nNEphbNnkTEQBm-R/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Ku4VaZMkak5h7Rm5DTIz5ABMSAD95scy/view?usp=sharing

Сегодня у нас прошёл урок №5 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "глобальная переменная";
- познакомились с логическими операторами;
- повторили "координаты" и "процедуры";
- создали игру "Тачки"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "списки";
- познакомимся с новыми компонентами: "распознаватель речи" и "текст в речь";
- создадим приложение "Speak It!"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1Tvws5zGsZJctbb8JK3G5_kqA2_kbKzcZ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1UmZePz08om7F32P76bzi9oegZGIjaycJ/view?usp=sharing

Сегодня у нас прошёл урок №6 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "списки";
- познакомились с новыми компонентами: "распознаватель речи" и "текст в речь";
- создали приложение "Speak It!"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять несколько экранов в приложение;
- узнаем, как программировать переходы между экранами;
- создадим игру "Охота на зомби"!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/14oyjwfvH-xts-hBAggUqMy8KqC-bzzkh/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/17-ANZxi_Pk0ydXAmgNKdoDfsHmwBN_28/view?usp=sharing

Сегодня у нас прошёл урок №7 модуля App Inventor.
На нём мы с вами:
- научились добавлять несколько экранов в приложение;
- узнали, как программировать переходы между экранами;
- создали игру "Охота на зомби"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля App Inventor.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле Junior App Inventor!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Junior App Inventor.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Roblox!
Мы будем работать в Roblox Studio - это движок, который позволяет создавать свои собственные игры и миры для игровой платформы Roblox. На модуле мы научимся писать программы на языке программирования Lua, создадим несколько игр: мини-игру футбол, игру на выживание и игру со сбором ресурсов!
На следующем уроке мы:
- познакомимся со средой Roblox Studio;
- изучим инструменты в этой среде;
- создадим две постройки в игре: гараж и башню с лестницей! 

К следующему занятию, пожалуйста, установите Roblox Studio на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Roblox Studio:
https://docs.google.com/document/d/1xVsuDnJHm5TyvGohi61ezIDFxZ6ggPOMAjejPl7d438/edit?usp=drive_link`
    },
    'Roblox Studio (старая версия)': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Roblox Studio.
На нём мы с вами:
- познакомились со средой Roblox Studio;
- изучили инструменты в этой среде;
- создали две постройки в игре: гараж и башню с лестницей! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое материалы и текстуры;
- напишем первую программу на языке программирования Lua;
- создадим ёлку с игрушками!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое материалы и текстуры;
- написали первую программу на языке программирования Lua;
- создали ёлку с игрушками!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как соединять детали друг с другом;
- научимся писать программы с использованием функции;
- создадим кнопку для открытия двери!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Roblox Studio.
На нём мы с вами:
- узнали, как соединять детали друг с другом;
- научились писать программы с использованием функции;
- создали кнопку для открытия двери!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать и настраивать эффекты;
- научимся создавать и использовать переменные;
- запрограммируем радугу!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Roblox Studio.
На нём мы с вами:
- узнали, как создавать и настраивать эффекты;
- научились создавать и использовать переменные;
- запрограммировали радугу! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научимся писать программы с условием;
- создадим игру "Мини-футбол"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научились писать программы с условием;
- создали игру "Мини-футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять в игру врагов и инструменты;
- научимся использовать цикл while;
- создадим игру на выживание!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Roblox Studio.
На нём мы с вами:
- узнали, как добавлять в игру врагов и инструменты;
- научились использовать цикл while;
- создали игру на выживание!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и изменять ландшафт в игре;
- научимся делать объекты прозрачными;
- создадим свою мини-игру со сбором ресурсов!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Roblox Studio.
На нём мы с вами:
- научились создавать и изменять ландшафт в игре;
- научились делать объекты прозрачными;
- создали свою мини-игру со сбором ресурсов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим телепорт;
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Roblox Studio.
На нём мы с вами:
- создали телепорт;
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- доработаем проекты;
- проведём защиту!`,
      '9 урок': `Сегодня у нас прошёл урок (№9) модуля Roblox Studio.
На нём мы с вами:
- доработали проекты;
- провели защиту!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)
Но на этом модуль Roblox Studio еще не закончился. На следующем уроке мы:
- сделаем мини-платформер!`,
      '10 урок': `Сегодня у нас прошёл урок №10 модуля Roblox Studio.
На нём мы с вами:
- сделали мини-платформер!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём создавать локацию для нашей будущей игры Brawl Stars!`,
      '11 урок': `Сегодня у нас прошёл урок №11 модуля Roblox Studio.
На нём мы с вами:
- создали локацию для нашей будущей игры Brawl Stars!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся быстро писать код;
- повторим основы работы с языком LUA!`,
      '12 урок': `Сегодня у нас прошёл урок №12 модуля Roblox Studio.
На нём мы с вами:
- научились быстро писать код;
- повторили основы работы с языком LUA!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Циклы";
- запрограммируем несколько строительных блоков!`,
      '13 урок': `Сегодня у нас прошёл урок №13 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Циклы";
- запрограммировали несколько строительных блоков!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим, как создавать условные конструкции в Lua;
- повторим, как добавлять эффекты;
- запрограммируем летающую платформу работать как лифт!`,
      '14 урок': `Сегодня у нас прошёл урок №14 модуля Roblox Studio.
На нём мы с вами:
- повторили, как создавать условные конструкции в Lua;
- повторили, как добавлять эффекты;
- запрограммировали летающую платформу работать как лифт!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Функции";
- сделаем опасные зоны на уровне, отнимающие здоровье игрока!`,
      '15 урок': `Сегодня у нас прошёл урок №15 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Функции";
- сделали опасные зоны на уровне, отнимающие здоровье игрока!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим и настроим в нашей игре пользовательский интерфейс!`,
      '16 урок': `Сегодня у нас прошёл урок №16 модуля Roblox Studio.
На нём мы с вами:
- добавили и настроили в нашей игре пользовательский интерфейс!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем пользовательский интерфейс;
- добавим в игру кристаллы и запрограммируем их сбор!`,
      '17 урок': `Сегодня у нас прошёл урок №17 модуля Roblox Studio.
На нём мы с вами:
- запрограммировали пользовательский интерфейс;
- добавили в игру кристаллы и запрограммировали их сбор!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Случайное число";
- добавим игроку оружие!`,
      '18 урок': `Сегодня у нас прошёл урок №18 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Случайное число";
- добавили игроку оружие!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Roblox Studio!
На уроке мы:
- запрограммируем NPC на сбор кристаллов;
- усложним и доделаем нашу игру;
- подведём итоги модуля!`,
      '19 урок': `Сегодня у нас прошёл последний урок (№19) модуля Junior Roblox Studio.
На нём мы с вами:
- запрограммировали NPC на сбор кристаллов;
- усложнили и доделаем нашу игру;
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!`
    },
    'Roblox Studio (обновленная версия)': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Сегодня у нас прошёл урок №1 модуля Roblox Studio.
На нём мы с вами:
- познакомились со средой Roblox Studio;
- изучили инструменты в этой среде;
- создали две постройки в игре: гараж и башню с лестницей! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое материалы и текстуры;
- напишем первую программу на языке программирования Lua;
- создадим ёлку с игрушками!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1QZYrU0y4RCwsqdVRsuLIDpNyEdJYPohX/view?usp=sharing

Сегодня у нас прошёл урок №2 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое материалы и текстуры;
- написали первую программу на языке программирования Lua;
- создали ёлку с игрушками!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как соединять детали друг с другом;
- научимся писать программы с использованием функции;
- создадим кнопку для открытия двери!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1uHWZOP6BuEPx16rOygd_RYUZa3IbDurx/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/15YUimiQFGOw7PsvFV1U7NKxcya4_zWDR/view?usp=sharing

Сегодня у нас прошёл урок №3 модуля Roblox Studio.
На нём мы с вами:
- узнали, как соединять детали друг с другом;
- научились писать программы с использованием функции;
- создали кнопку для открытия двери!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать и настраивать эффекты;
- научимся создавать и использовать переменные;
- запрограммируем радугу!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/14lIAlGZD3AKHkJYF4VDLM_NyIIsc3IUG/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1FNihiO8BRhM-fFX10wDHXgG9Tufqr3XM/view?usp=sharing

Сегодня у нас прошёл урок №4 модуля Roblox Studio.
На нём мы с вами:
- узнали, как создавать и настраивать эффекты;
- научились создавать и использовать переменные;
- запрограммировали радугу! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научимся писать программы с условием;
- создадим игру "Мини-футбол"!`,
      '5 урок': `Заготовка
https://create.roblox.com/marketplace/asset/15916684025/Stadium-CodeClass%3Fkeyword=&pageNumber=&pagePosition=

Готовый проект
https://drive.google.com/file/d/1ZHHwTFjd8WQTd75O3dFsr0fEayrCWa4z/view?usp=sharing

Сегодня у нас прошёл урок №5 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научились писать программы с условием;
- создали игру "Мини-футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять в игру врагов и инструменты;
- создадим телепорт;
- научимся использовать цикл while;
- создадим игру на выживание!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1AfTdLOTbtJ2jQXcuw8kvHPZm3rzuyc4N/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1HU6uh6NW_Xinijdw7KF2Qk3uwLIDMtZO/view?usp=drive_link

Сегодня у нас прошёл урок №6 модуля Roblox Studio.
На нём мы с вами:
- узнали, как добавлять в игру врагов и инструменты;
- создали телепорт;
- научились использовать цикл while;
- создали игру на выживание!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и изменять ландшафт в игре;
- научимся делать объекты прозрачными;
- создадим свою мини-игру со сбором ресурсов!`,
      '7 урок': `Готовый проект
https://drive.google.com/file/d/1XI44bpeufZT5hzTYYXcxtLgRHHXAWKBH/view?usp=sharing

Сегодня у нас прошёл урок №7 модуля Roblox Studio.
На нём мы с вами:
- научились создавать и изменять ландшафт в игре;
- научились делать объекты прозрачными;
- создали свою мини-игру со сбором ресурсов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим локацию для нашей будущей игры Brawl Stars!`,
      '8 урок': `Готовый проект
https://drive.google.com/file/d/1dqZqqPDFVsyuZjyiSYLKGWpu_ODBxoZg/view?usp=drive_link

Сегодня у нас прошёл урок №8 модуля Roblox Studio.
На нём мы с вами:
- создали локацию для нашей будущей игры Brawl Stars!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим, как создавать условные конструкции в Lua;
- повторим, как добавлять эффекты;
- запрограммируем летающую платформу работать как лифт!`,
      '9 урок': `Сегодня у нас прошёл урок (№9) модуля Roblox Studio.
На нём мы с вами:
- повторили, как создавать условные конструкции в Lua;
- повторили, как добавлять эффекты;
- запрограммировали летающую платформу работать как лифт!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Функции";
- сделаем опасные зоны на уровне, отнимающие здоровье игрока!`,
      '10 урок': `Сегодня у нас прошёл урок №10 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Функции";
- сделали опасные зоны на уровне, отнимающие здоровье игрока!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим и настроим в нашей игре пользовательский интерфейс!`,
      '11 урок': `Сегодня у нас прошёл урок №11 модуля Roblox Studio.
На нём мы с вами:
- добавили и настроили в нашей игре пользовательский интерфейс!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с новыми объектами игры;
- создадим первый уровень игры "Башня ада";
- научимся использовать цикл Repeat;
- запрограммируем таймер!`,
      '12 урок': `Заготовка
https://drive.google.com/file/d/1zPAQZTIb46_M2GWOFl82ipr9PDeVte-D/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1HF_bYM8V7t1WhJys-UsiPwD2gRimL5xv/view?usp=sharing
Сегодня у нас прошёл урок №12 модуля Roblox Studio.
На нём мы с вами:
- познакомились с новыми объектами игры;
- создали первый уровень игры "Башня ада";
- научились использовать цикл Repeat;
- запрограммировали таймер!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим в игру доску лидеров;
- добавим в игру магазин;
- напишем скрипты для покупок в магазине!`,
      '13 урок': `Заготовка
https://drive.google.com/file/d/1zMRJFsitFl0-zEP1smA4nidwdFEiLBv_/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/13pnXPCVTkNjQ8CNKWou_MLk2T_Rb8Le1/view?usp=sharing

Сегодня у нас прошёл урок №13 модуля Roblox Studio.
На нём мы с вами:
- добавили в игру доску лидеров;
- добавили в игру магазин;
- написали скрипты для покупок в магазине!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- напишем скрипт для генерации башни;
- добавим ещё один уровень в башню;
- запрограммируем создание новой башни при перезапуске времени!`,
      '14 урок': `Заготовка
https://drive.google.com/file/d/1fqqq7HYwV2YaeGDjSCqS0siMImjX81V7/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1EaIFmOvH2u5OENv5hbb2ggAdcPbesmGc/view?usp=sharing
Сегодня у нас прошёл урок №14 модуля Roblox Studio.
На нём мы с вами:
- написали скрипт для генерации башни;
- добавили ещё один уровень в башню;
- запрограммировали создание новой башни при перезапуске времени!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять модели при помощи CommandBar;
- настроим HeightGui в игре;
- добавим в игру блок, дающий очки за прохождение башни;
- запрограммируем WinBlock!`,
      '15 урок': `Заготовка
https://drive.google.com/file/d/18F7OSobh_gSPLa8uJyNAlJLenOS7ekN4/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1DYZCTgGNTvaIw2QHJVW5JNgE8e0dDyGI/view?usp=sharing

Сегодня у нас прошёл урок №15 модуля Roblox Studio.
На нём мы с вами:
- научились добавлять модели при помощи CommandBar;
- настроили HeightGui в игре;
- добавили в игру блок, дающий очки за прохождение башни;
- запрограммировали WinBlock!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим в игру респаун игроков;
- запрограммируем респаун игроков по истечению времени;
- исправим WinBlock; 
- добавим в игру музыку!`,
      '16 урок': `Заготовка
https://drive.google.com/file/d/1EZw1lCwW0Y-_txIMBeI7xAA7WFcLQaBS/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1IOs7O15KvAHj-o38f5TFk58VRSForkmC/view?usp=sharing

Сегодня у нас прошёл урок №16 модуля Roblox Studio.
На нём мы с вами:
- добавили в игру респаун игроков;
- запрограммировали респаун игроков по истечению времени;
- исправили WinBlock; 
- добавили в игру музыку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- определим задачи и тему собственного проекта;
- составим план работы над проектом;
- начнём работу над проектом: создадим локацию!`,
      '17 урок': `Сегодня у нас прошёл урок №17 модуля Roblox Studio.
На нём мы с вами:
- определили задачи и тему собственного проекта;
- составили план работы над проектом;
- начали работу над проектом: создали локацию!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- продолжим работу над проектом: напишем скрипты!`,
      '18 урок': `Сегодня у нас прошёл урок №18 модуля Roblox Studio.
На нём мы с вами:
- продолжили работу над проектом: написали скрипты!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Roblox Studio!
На уроке мы:
- закончим и защитим проекты;
- подведём итоги модуля!`,
      '19 урок': `Сегодня у нас прошёл последний урок (№19) модуля Junior Roblox Studio.
На нём мы с вами:
- закончили и защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились с заданиями!
Отдельно хочу отметить … (приложите также скриншоты проектов)`
    },
    'Godot': {
      '1 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №1 модуля Godot. На нём мы с вами:
- познакомились с игровым движком Godot;
- изучили интерфейс программы;
- создали персонажа и добавили ему скрипт;
- научили персонажа двигаться!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- познакомимся с построением уровней в Godot;
- создадим свой первый уровень!`,
      '2 урок': `Готовый проект
Тест
Заготовка


Сегодня у нас прошёл урок №2 модуля Godot. На нём мы с вами:
- познакомились с картой тайлов и научились строить уровни с её помощью;
- узнали, что такое Z-индекс и как он влияет на отображение объектов;
- познакомились с понятием переменной в программировании;
- создали интересный уровень для нашего игрока!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим анимации нашему персонажу;
- научим игрока собирать монетки!`,
      '3 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №3 модуля Godot. На нём мы с вами:
- узнали, чем отличаются узлы Sprite2D и AnimatedSprite2D;
- познакомились с узлом Area2D и узнали, за что он отвечает;
- узнали, что такое функция и что такое сигнал;
- запрограммировали сбор монеток игроком;
- поработали с анимациями персонажа!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- запрограммируем поражение в нашей игре;
- добавим ловушки!`,
      '4 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №4 модуля Godot. На нём мы с вами:
- узнали, что такое ссылка в Godot и как её использовать;
- познакомились с командой await и разобрались, за что она отвечает;
- научились воспроизводить звуки прямо в игре;
- добавили звуки в наш проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим сцену победы в нашу игру;
- поработаем с пользовательским интерфейсом!`,
      '5 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №5 модуля Godot. На нём мы с вами:
- познакомились с пользовательским интерфейсом в Godot;
- узнали, за что отвечает узел Control;
- узнали, какой узел отвечает за отображение текста в игре;
- добавили кнопки в наш проект;
- узнали, какая команда позволяет изменить сцену в игре!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- узнаем, что такое примитивы и как они используются в 3D;
- построим свой первый 3D-уровень!`,
      '6 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №6 модуля Godot. На нём мы с вами:
- узнали, что такое примитивы и как они используются в 3D;
- познакомились с функцией Process и разобрались, что она делает;
- узнали, как работает команда Delta;
- построили свой первый 3D-уровень!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- завершим наш 3D-проект;
- добавим интерфейс и условия победы!`,
      '7 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №7 модуля Godot. На нём мы с вами:
- добавили счётчик собранных сокровищ;
- узнали, что такое функция str() и как она работает;
- разобрались, что позволяет делать команда get_parent();
- познакомились с условиями в программировании;
- завершили наш 3D-проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
Начнем разработку нового проекта - Тир!`,
      '8 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №8 модуля Godot. На нём мы с вами:
- узнали, что такое RigidBody и как работает физика в Godot;
- познакомились с узлом RayCast;
- узнали, что такое группы в Godot;
- добавили мишень в группу Targets!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- научимся создавать объекты во время игры;
- заставим мишени появляться в случайных местах!`,
      '9 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №9 модуля Godot. На нём мы с вами:
- узнали, что такое preload в Godot;
- познакомились с командой instantiate;
- изучили операцию сравнения;
- научились создавать мишени во время игры!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим в игру таймер;
- создадим счётчик сбитых мишеней;
- посоревнуемся в меткости!`,
      '10 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №10 модуля Godot. На нём мы с вами:
- узнали, что такое таймер и как с ним работать;
- познакомились с сигналом timeout;
- научились настраивать и программировать таймер;
- добавили в игру счётчик сбитых мишеней и таймер!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- увеличим количество мишеней;
- усложним нашу игру и сделаем её ещё интереснее!`,
      '11 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №11 модуля Godot. На нём мы с вами:
- познакомились с темой «Циклы»;
- изучили работу цикла for;
- познакомились с операцией деления с остатком;
- добавили новые усложнения в нашу игру!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- начнём разработку нового проекта «Арена»;
- создадим основу для будущей игры!`,
      '12 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №12 модуля Godot. На нём мы с вами:
- познакомились с сеткой навигации NavigationMesh;
- узнали, для чего нужен узел NavigationAgent3D;
- познакомились с функцией _physics_process();
- научили врагов двигаться за игроком!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим оружие игроку;
- сделаем сражения с врагами ещё интереснее!`,
      '13 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №13 модуля Godot. На нём мы с вами:
- познакомились с системой стрельбы в Godot;
- вспомнили, как работает Area3D;
- создали собственную пулю;
- познакомились с узлом MeshInstance3D;
- научили игрока стрелять!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим здоровье игроку;
- научим врагов атаковать;
- сделаем игровой процесс ещё интереснее и динамичнее!`,
      '14 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №14 модуля Godot. На нём мы с вами:

- добавили здоровье врагам;
- научили врагов атаковать игрока;
- познакомились с работой таймера;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:

- добавим возможность побеждать врагов;
- создадим счётчик побеждённых врагов на экране;`
    }
  },
  'Middle': {
    'Scratch': {
      '1 урок': `Заготовка
https://drive.google.com/file/d/1vb6zFwLMXeY8O1F0NLA27izx_8yqbCzW/view?usp=sharing 

Готовый проект
https://drive.google.com/file/d/1FuqKcivqbprfLVdY91c-0a6SzwZKikLX/view?usp=sharing 

Тест
https://docs.google.com/forms/d/e/1FAIpQLSftUgbKV0IUFLrc7Bv_e42NDBui8iJwA98dRMoPqKwGWinGVA/viewform

Поздравляю всех с завершением 1-го урока курса и посвящением в программисты!
Сегодня у нас прошёл урок №1 модуля Scratch.
На нём мы с вами:
- познакомились с интерфейсом и основами работы с блоками Scratch;
- научились создавать первые простые программы;
- научились программировать движение персонажа;
- познакомились с условиями и сенсорами;
- создали игру "Brawler's Fight"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- закрепим управление спрайтом с помощью клавиатуры;
- научимся создавать анимации;
- узнаем, как добавлять звуки в игру;
- научимся переключаться между фонами;
- создадим игру "Brawler's Maze"!`,
      '2 урок': `Заготовка
2 занятие Middle - Brawler's maze (заготовка).sb3 - Google Диск 

Готовый проект
https://drive.google.com/drive/folders/1ZqxRpEcp_LjJK4b1t51jAy3aZEi0EsPo?usp=drive_link


Тест
https://docs.google.com/forms/d/e/1FAIpQLSd3SuN55FtXcXxlJY8wmIvMLEmK_blBu98E4ht7z2uleUaOoA/viewform


Сегодня у нас прошёл урок №2 модуля Scratch.
На нём мы с вами:
- закрепили управление спрайтом с помощью клавиатуры;
- научились создавать анимации;
- узнали, как добавлять звуки в игру;
- научились переключаться между фонами;
- создали игру "Brawler's Maze"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "координаты" и "координатная плоскость";
- узнаем, что такое "операторы";
- узнаем, что такое "цикл" и "цикл с предусловием";
- сделаем игру "Among Us"!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1WvPlkiGvitThMK9BG8UHfbP7HBkE8gC0?usp=drive_link

Готовый проект
https://drive.google.com/file/d/1QJxjGQ3tbfNLiMw2TIzpd50tk5YVOAhF/view?usp=drive_link

Тест
https://docs.google.com/forms/d/1K82vSSlHlQdz_PWmb7-uxM_SATCHEufbHKgLaxYS_gc/viewform

Сегодня у нас прошёл урок №3 модуля Scratch.
На нём мы с вами:
- узнали, что такое "координаты" и "координатная плоскость";
- узнали, что такое "операторы", что они бывают математические и логические;
- узнали, что такое "цикл" и "цикл с предусловием";
- сделали игру "Among Us"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "случайное число";
- узнаем, что такое "переменная" и научимся её создавать;
- узнаем, что такое "встроенная переменная";
- научимся создавать и передавать сообщения;
- сделаем игру "Угадай число"!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1YAxktmAUI8-stTznuub-0ThCt8dW4RfJ?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1mFe8Rsl0TfbYDyie94OC0Qv4u_BNE-x0?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScVVdovD3lypCIIze8_pRbkufNyQOS8caWrQG_6xVmjvJrhgA/viewform

Сегодня у нас прошёл урок №4 модуля Scratch.
На нём мы с вами:
- узнали, что такое "случайное число";
- узнали, что такое "переменная" и научимся её создавать;
- узнали, что такое "встроенная переменная";
- научились создавать и передавать сообщения;
- сделали игру "Угадай число"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "гравитация" и как создавать гравитацию в Scratch;
- узнаем, что такое "вложенные циклы";
- создадим первый уровень игры "Платформер"!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/168mQBpHsFpxX3hLAEa_5thi8DclfXXbd?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1NfVAsz-OtLKLtZt5GNkzJPMswMTOmsAb?usp=sharing


Тест
https://docs.google.com/forms/d/e/1FAIpQLSdKwsRDqNJJwwmJ8dNF1QkvgzynjeGv4stMIS7n8p0UZCjF-Q/viewform

Сегодня у нас прошёл урок №5 модуля Scratch.
На нём мы с вами:
- узнали, что такое "гравитация" и как создавать гравитацию в Scratch;
- узнали, что такое "вложенные циклы";
- создали первый уровень игры "Платформер"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как переходить на следующий уровень в игре;
- научимся добавлять жизни спрайту;
- узнаем, что такое "траектория";
- познакомимся с новой командой "плыть 1 секунд...";
- закончим создание игры "Платформер"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1tZq_G8haZExavYLruL7Jbss0wGmQSPkU?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1hWwzIeQquu9l3t52ffL37wn9pULQyOCO?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScwU1yb7eA9DeBq1Q3HjBoegVQbDxIYpshFulpzJh35Rkz3OA/viewform

Сегодня у нас прошёл урок №6 модуля Scratch.
На нём мы с вами:
- узнали, как переходить на следующий уровень в игре;
- научились добавлять жизни спрайту;
- узнали, что такое "траектория";
- познакомились с новой командой "плыть 1 секунд...";
- закончили создание игры "Платформер"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с командами расширения "Перо";
- узнаем, как создавать таймер;
- создадим игру "Змейка"!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1YmHvg_BKa7hXjbnd9JNL_036jhx2dlGX?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1Y-hR0NiTo9GgwCcL7TyhwBqr9Ka6NVLf?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf-bbjj8IGvNZI46Fu95wekyJj-hlqSvprj_A7tKN2MMoUIBw/viewform

Сегодня у нас прошёл урок №7 модуля Scratch.
На нём мы с вами:
- познакомились с командами расширения "Перо";
- узнали, как создавать таймер;
- создали игру "Змейка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- будем работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Scratch.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле Middle Scratch!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Middle Scratch.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Minecraft!
На этом модуле мы научимся основам программирования, а также с помощью сложных программ построим свою звёздную базу!
На следующем уроке мы:
- познакомимся с интерфейсом Minecraft и управлением в среде;
- познакомимся с нашим исполнителем - роботом-черепашкой, научимся менять ей внешность;
- научимся писать для черепашки простые линейные программы;
- пройдём испытания на астероиде!

К следующему занятию, пожалуйста, установите Minecraft и моды на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Minecraft: https://docs.google.com/document/d/1jgaWpiQdHQH38lLtdP5pd6yE78hqbFC5/edit?usp=sharing&ouid=101384562489296174291&rtpof=true&sd=true   


Вторым сообщением:
Дорогие родители, внимание!
На следующей неделе урок будет проходить в ИНДИВИДУАЛЬНОМ ФОРМАТЕ! 
На уроке:
- дети познакомятся с нейросетью DeepSeek
- узнают, что такое промпт
- сделают собственное мини-приложение при помощи нейросети
Наш эксперт познакомит Вас и Вашего ребенка с миром нейросетей 🙂

В ближайшие дни с нами свяжется наш менеджер для назначения времени занятия по телефону либо в мессенджере.
Обратите, пожалуйста, внимание - участие родителя обязательно, поэтому выбирайте время урока, когда будете дома.`
    },
    'Minecraft': {
      '1 урок': `Заготовка
https://drive.google.com/file/d/14svv99hyrho2PCIUS0-t0t_hWw0_4ci5/view?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/1sJi-owSPsi_TVQNynX7RASs2cVu3xLqjyUw3sBibCG8/edit?usp=sharing

Сегодня у нас прошёл урок №1 модуля Minecraft.
Сегодня мы с вами:
- познакомились с интерфейсом Minecraft и управлением в среде;
- познакомились с нашим исполнителем - роботом-черепашкой, научились менять ей внешность;
- научились писать для черепашки простые линейные программы;
- прошли испытания на астероиде!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "цикл" и "цикл с повторением" и используем его в программе для черепашки;
- научим черепашку копать и ставить блоки;
- узнаем, можно ли выжить на лавовой планете!`,
      '2 урок': `Заготовка
https://drive.google.com/open?id=1XZI16nf3Q8NupWyR5_cPErNgaCI77oCp

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfkIEumH8fXnY1SmqINN_HsKE-maMXCii4u5TJqXlCeGHY4Mg/viewform

Сегодня у нас прошёл урок №2 модуля Minecraft.
На нём мы с вами:
- узнали, что такое "циклы" и какие они бывают;
- научились составлять программы циклов с повторителем;
- научили черепашку копать и ставить блоки;
- узнали новое о вулканах и вулканических планетах, спасли дроида с одной из них!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "алгоритмы с условием" или "ветвление";
- научим черепашку обнаруживать и узнавать блоки;
- научимся писать программы с условиями и с помощью этого типа программ разминируем поле на вражеской планете!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1umS6KCwQfubJsOcOWNHmlosDeUt3AGzC/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScJZmRO4lanw6EMoTeAxHdLIq4IKXVnjKfXfrSC7gwi_JTciQ/viewform


Сегодня у нас прошёл урок №3 модуля Minecraft.
На нём мы с вами:
- узнали, что такое "алгоритмы с условием" или "ветвление";
- научили черепашку узнавать конкретные блоки;
- научили черепашку обнаруживать любые блоки;
- научились писать программы с условиями;
- узнали новое о МКС и помогли черепашке разминировать поле!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с "циклами с предусловием" или "циклом While" и научимся писать программы с ним;
- а также с помощью этого цикла достроим мост для наших союзников!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1X7Cfg9s4ConBSpthr8t-djPLBVJy3xnU/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdVagg0UZ7IAgOa5G7gDMlfQqILGBKU-ATwZUjE1owV0QL_FQ/viewform

Сегодня у нас прошёл урок №4 модуля Minecraft.
На нём мы с вами:
- познакомились с "циклами с предусловием" или "циклом While";
- научили черепашку выбирать блоки из конкретного или случайного слота инвентаря;
- научились задавать второе условие для циклов;
- научились использовать оператор НЕ РАВНО;
- научили черепашку выполнять циклы с предусловием и с помощью этого цикла достроили мост для наших союзников!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с "циклом со счётчиком", "циклом FOR";
- с помощью нового типа программ построим свою ракету для покорения космоса!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/11zzrp0rVHUbeeKPAGQYWaxWwBSX0HVuU/view?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSfhIqPaoX-doMrVH-jbk1A8D0KSK4FtMnNoVak2cl3kmR9xWA/viewform

Сегодня у нас прошёл урок №5 модуля Minecraft.
На нём мы с вами:
- узнали, что такое "цикл со счётчиком", "цикл FOR";
- научились использовать переменные и задавать диапазон чисел;
- обустроили свой космодром;
- с помощью нового типа программ построим свою ракету для покорения космоса!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Middle Minecraft!
На уроке мы:
- научимся собирать сложные программы, состоящие из нескольких циклов;
- с помощью этих сложных программ восстановим нашу звёздную базу!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/12jI4Q694xn0uZnTLt5z8JBBN1PVbVRwF/view

Тест
docs.google.com/forms/d/e/1FAIpQLSeC9AnFagxmTJmFu7Io_RrAcxKAnBCkLRe_8QvJ2DXdQUNhIQ/viewform


Сегодня у нас прошёл последний урок (№6) модуля Minecraft.
На нём мы с вами:
- научились создавать сложные комбинированные циклы и использовать их для строительства;
- достроили и обустроили свою звёздную базу!

А уже на следующем уроке у нас начнётся новый модуль - Stencyl!
Stencyl - это профессиональный движок для разработки игр. На протяжении 6 уроков мы будем создавать 2D-платформер с большим количеством уровней. А также вы создадите собственный проект!
На следующем уроке мы:
- познакомимся с программой Stencyl;
- научимся добавлять плитки и актёров на сцену;
- научимся писать программы в Stencyl;
- создадим первый уровень игры!

К следующему занятию, пожалуйста, установите Stencyl на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Stencyl:
https://docs.google.com/document/d/172oKcMRGu_PFjh9FoHHONhqhowStbfqQlxrWLovPGAw/edit?usp=sharing`
    },
    'Stencyl': {
      '1 урок': `Готовый проект
https://drive.google.com/file/d/1JSKq_KDqCaOuqMX4UisrTrI79EPgnyT6/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfKCobFdZnbAY_yQozHobTm3nVKiZnZjDVrJyOZnBYL2k9qjA/viewform

Сегодня у нас прошёл урок №1 модуля Stencyl.
На нём мы с вами:
- познакомились с программой Stencyl;
- научились добавлять плитки и актёров на сцену;
- научились писать программы в Stencyl;
- создали первый уровень игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "Поведение" в Stencyl и познакомились с некоторыми из них;
- узнаем, что такое "Условие" и научились составлять программы с ним;
- доработаем первый уровень игры!`,
      '2 урок': `Заготовка
https://drive.google.com/file/d/1klaU_mja_GNqIum6zzTs7ROsQrNOmvq4/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1_-lcloLcnwGAoNBCBDSVt-AOeWvnez55/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScE1O18mZttbmMr-KRu3jCqPqSD1Fc1R3agcO6GwuM0J0VYsw/viewform


Сегодня у нас прошёл урок №2 модуля Stencyl.
На нём мы с вами:
- узнали, что такое "Поведение" в Stencyl и познакомились с некоторыми из них;
- узнали, что такое "Условие" и научились составлять программы с ним;
- доработали первый уровень игры!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- изучим настройки физики для актёров;
- узнаем, что такое "координаты" и научились использовать их в программах;
- добавим порталы в игру!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1sO_8g1yOg3GMJHQrlzz_xKzZa-XXV79W/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/18Tnh5EfpcH5ZpmRsYvRCbZtJXZN88GPy/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSc7pa5_ecb9J9yoOEorZ9MAaJF9v9kWiwDk14wERBr6cQ5O3w/viewform

Сегодня у нас прошёл урок №3 модуля Stencyl.
На нём мы с вами:
- изучили настройки физики для актёров;
- узнали, что такое "координаты" и научились использовать их в программах;
- добавили порталы в игру!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с районами в Stencyl и научились программировать смену сцены;
- узнаем, что такое "атрибут" в Stencyl;
- запрограммируем сбор монеток и научились выводить атрибуты на экран!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1hH2dBrpPp9AM28ZywFCzYgSKA_dSMygc/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1VyNo3WroV0reQoox2V40E8lJ0f_-WW9G/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdpR8btfUk78G_XKS53jvezO8ejFcSvrzqXuie10YFtmu3GLw/viewform
Сегодня у нас прошёл урок №4 модуля Stencyl.
На нём мы с вами:
- познакомились с районами в Stencyl и научились программировать смену сцены;
- узнали, что такое "атрибут" в Stencyl;
- запрограммировали сбор монеток и научились выводить атрибуты на экран!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с операторами сравнения и логическими операторами;
- научимся применять операторы при программировании;
- запрограммируем условия победы и поражения;
- создадим сцены победы и поражения и запрограммировали переход на них!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1vXYJaHHtX0K03ohMmDLd_qnTeNwA1sWf/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1fSxpnyfT5EIlKZ6ahrUQ0Q4T-pbnDYZ2/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd4ay9f8DrOA8Px4nSHjvTSBZiA6XiTkF62O2wgWQt8GB6FYg/viewform

Сегодня у нас прошёл урок №5 модуля Stencyl.
На нём мы с вами:
- познакомились с операторами сравнения и логическими операторами;
- научились применять операторы при программировании;
- запрограммировали условия победы и поражения;
- создали сцены победы и поражения и запрограммировали переход на них!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять звуки в игру;
- научимся создавать собственных актёров;
- создадим и запрограммировали меню игры;
- создадим анимацию наведения курсора на кнопки!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/17P6ZDX5pGEITf-yU0LwMutR_0xVdHaXS?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Z8VQq2xIkc3MUDbdCQTa6UP7mJTd2Dg9/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe-Pe5w_Cp3P6HyKBjelXoem45j3wOM-WKIfIuXg8ryivK9qg/viewform

Сегодня у нас прошёл урок №6 модуля Stencyl.
На нём мы с вами:
- научились добавлять звуки в игру;
- научились создавать собственных актёров;
- создали и запрограммировали меню игры;
- создали анимацию наведения курсора на кнопки!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим второго персонажа в игру;
- начнём работать над собственным проектом!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/1k9KPUCXE-0ecWjarAbpLny2LcagS3W-P/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1vIt8F7sIm_PDpuuivZobGMK3I8FG04M1/view?usp=sharing

Сегодня у нас прошёл урок №7 модуля Stencyl.
На нём мы с вами:
- добавили второго персонажа в игру;
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Middle Stencyl!
На уроке мы:
- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '8 урок': `Сегодня у нас прошёл последний урок (№8) модуля Stencyl.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - App Inventor. В этой среде мы будем создавать приложения и игры для смартфонов и планшетов. В течение модуля мы сделаем несколько приложений и игр, которые можно будет тестировать прямо на вашем телефоне!
На следующем уроке мы:
- познакомимся с интерфейсом и основами работы в App Inventor;
- научимся создавать дизайн для приложения;
- научимся составлять скрипты для компонентов;
- создадим приложение "Drum Machine"!

К следующему занятию, пожалуйста, установите приложение для тестирования на свой телефон или эмулятор на компьютер! Напоминаю, что за самостоятельную подготовку ПО я награждаю 10 КодКойнами! 
Инструкция по установке программ для тестирования приложений из App Inventor:
https://docs.google.com/document/d/1Pdy40qSRQizRGB8G_L1zjLunNWSJsZpyLtSn8B7mIZY/edit?usp=sharing`
    },
    'Thunkable': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Thunkable.
На нём мы с вами:
- познакомились с интерфейсом и основами работы с блоками в Thunkable;
- научились разрабатывать дизайн для приложения;
- научились создавать скрипты для кнопок;
- создали приложение «Ударная установка»!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с координатами в Thunkable;
- познакомимся с новым компонентом Canvas (холст);
- научимся работать со спрайтами;
- напишем первые скрипты для спрайтов;
- сделаем игру "В погоне за жёлудем"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Thunkable.
На нём мы с вами:
- познакомились с координатами в Thunkable;
- познакомились с новым компонентом Canvas (холст);
- научились работать со спрайтами;
- написали первые скрипты для спрайтов;
- сделали игру "В погоне за жёлудем"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое случайное число;
- научимся переключаться между экранами;
- узнаем, что такое "условие";
- сделаем игру "Путешествие ракеты"!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Thunkable.
На нём мы с вами:
- узнали, что такое случайное число;
- научились переключаться между экранами;
- узнали, что такое "условие";
- сделали игру "Путешествие ракеты"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем перемещение спрайта в случайные координаты;
- познакомимся с таймером;
- познакомимся с операторами;
- сделаем игру "Поймай крота"!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Thunkable.
На нём мы с вами:
- запрограммировали перемещение спрайта в случайные координаты;
- познакомились с таймером;
- познакомились с операторами;
- сделали игру "Поймай крота"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать переменные в Thunkable;
- познакомимся с блоком If-Else;
- начнём делать игру "Скоростная сортировка"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Thunkable.
На нём мы с вами:
- узнали, как создавать переменные в Thunkable;
- познакомились с блоком If-Else;
- начали делать игру "Скоростная сортировка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем экран победы на вывод времени;
- добавим и запрограммировали кнопки перезапуска;
- познакомимся с функциями;
- закончим игру "Скоростная сортировка"!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Thunkable.
На нём мы с вами:
- запрограммировали экран победы на вывод времени;
- добавили и запрограммировали кнопки перезапуска;
- познакомились с функциями;
- закончили игру "Скоростная сортировка"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом Text Input;
- узнаем что такое "база данных", научились их создавать и использовать;
- научимся использовать возможности перевода и озвучки текста в Thunkable;
- сделаем приложение — переводчик!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Thunkable.
На нём мы с вами:
- познакомились с компонентом Text Input;
- узнали, что такое "база данных", научились их создавать и использовать;
- научились использовать возможности перевода и озвучки текста в Thunkable;
- сделали приложение — переводчик!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- будем работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Thunkable.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле Middle Thunkable!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Middle Thunkable.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Roblox!
Мы будем работать в Roblox Studio - это движок, который позволяет создавать свои собственные игры и миры для игровой платформы Roblox. На модуле мы научимся писать программы на языке программирования Lua, создадим несколько игр: мини-игру футбол, игру на выживание и игру со сбором ресурсов!
На следующем уроке мы:
- познакомимся со средой Roblox Studio;
- изучим инструменты в этой среде;
- создадим две постройки в игре: гараж и башню с лестницей! 

К следующему занятию, пожалуйста, установите Roblox Studio на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Roblox Studio:
https://docs.google.com/document/d/1xVsuDnJHm5TyvGohi61ezIDFxZ6ggPOMAjejPl7d438/edit?usp=drive_link`
    },
    'App Inventor': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1MNDzgVFgAwvGzzrcVt_o044sZyrsQHSu?usp=sharing

Готовый проект
https://drive.google.com/file/d/1x96cfq24ljUh7TxQanUVkFMUDkFFlOfG/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf_aW2CK7jqrCWL61BiPMgDqsG6p0VPvPxFH5heCqHni9Jorg/viewform


Сегодня у нас прошёл урок №1 модуля App Inventor.
На нём мы с вами:
- познакомились с интерфейсом и основами работы в App Inventor;
- научились создавать дизайн для приложения;
- научились составлять скрипты для компонентов;
- создали приложение "Drum Machine"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом "Холст" и научимся на нем рисовать разными цветами;
- узнаем, что такое "локальная переменная";
- узнаем, что такое "координаты";
- начнем создавать приложение "Рисовалка"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1zAfjdtPVaqOSqND05ygJmACSAOyBpWaU?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LgsnKoAiGMxD-onFcNpEveW1zPGn_MsF/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeA9lRGliR1gYDO1SNLhoHTMGTjn9IueNYzg96vjZqkSEBxCg/viewform

Сегодня у нас прошёл урок №2 модуля App Inventor.
На нём мы с вами:
- познакомились с компонентом "Холст" и научились на нем рисовать разными цветами;
- узнали, что такое "локальная переменная";
- узнали, что такое "координаты";
- начали создавать приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с группой блоков "Математика", со случайным числом;
- повторим, что такое циклы и условные блоки;
- познакомимся с циклом "для";
- закончим приложение "Рисовалка"!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1zHHfXCdIxYEG_W05VD78idrcNvmMZSqD?usp=sharing

Готовый проект
https://drive.google.com/file/d/1zNZ6SE7EVelDyASeqogZtHMomrdOYexb/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSepOdOQm8JltOzIrf8XKGu51RpIsi4T7k90SF4323Bs0GyfYQ/viewform

Сегодня у нас прошёл урок №3 модуля App Inventor.
На нём мы с вами:
- познакомились с группой блоков "Математика", со случайным числом;
- повторили, что такое циклы и условные блоки;
- познакомились с циклом "для";
- закончили приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "процедура";
- познакомимся с компонентами "Шар" и "Изображение спрайта";
- научимся анимировать спрайты;
- познакомимся с блоками "истина" и "ложь";
- создадим игру "Мини-гольф"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1rqhfcL2KBtgHnQ3B05BystfkO3yMQ3qD/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1-Ge_DRGqKYm7Zufe2u2envq3T9e4aJEs/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdMpxUYD3yj3Jszs5d-THDb67JKFCnJxlVWKRbs18Yszf14Jw/viewform


Сегодня у нас прошёл урок №4 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "процедура";
- познакомились с компонентами "Шар" и "Изображение спрайта";
- научились анимировать спрайты;
- познакомились с блоками "истина" и "ложь";
- создали игру "Мини-гольф"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "глобальная переменная";
- познакомимся с логическими операторами;
- повторим "координаты" и "процедуры";
- создадим игру "Тачки"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1OSB2T2kKRj2bhXn-nNEphbNnkTEQBm-R/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Ku4VaZMkak5h7Rm5DTIz5ABMSAD95scy/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeCx1zgAqYKG6iWapS4_52CWTilMjjoxndS1L9ZsgqDmBLUgA/viewform

Сегодня у нас прошёл урок №5 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "глобальная переменная";
- познакомились с логическими операторами;
- повторили "координаты" и "процедуры";
- создали игру "Тачки"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "списки";
- познакомимся с новыми компонентами: "распознаватель речи" и "текст в речь";
- создадим приложение "Speak It!"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1Tvws5zGsZJctbb8JK3G5_kqA2_kbKzcZ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1UmZePz08om7F32P76bzi9oegZGIjaycJ/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfTyz8p2H3VWVnSJvEwTNm3BBhMp6v8dtFovmPCfnmZSQJUhw/viewform

Сегодня у нас прошёл урок №6 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "списки";
- познакомились с новыми компонентами: "распознаватель речи" и "текст в речь";
- создали приложение "Speak It!"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять несколько экранов в приложение;
- узнаем, как программировать переходы между экранами;
- создадим игру "Охота на зомби"!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/14oyjwfvH-xts-hBAggUqMy8KqC-bzzkh/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/17-ANZxi_Pk0ydXAmgNKdoDfsHmwBN_28/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSek2YhIfE1Ur-cHcnSMlnlIqt9BaGGmCKhccguBexbJWAgVAw/viewform

Сегодня у нас прошёл урок №7 модуля App Inventor.
На нём мы с вами:
- научились добавлять несколько экранов в приложение;
- узнали, как программировать переходы между экранами;
- создали игру "Охота на зомби"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля App Inventor.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле Middle App Inventor!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Middle App Inventor.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Roblox!
Мы будем работать в Roblox Studio - это движок, который позволяет создавать свои собственные игры и миры для игровой платформы Roblox. На модуле мы научимся писать программы на языке программирования Lua, создадим несколько игр: мини-игру футбол, игру на выживание и игру со сбором ресурсов!
На следующем уроке мы:
- познакомимся со средой Roblox Studio;
- изучим инструменты в этой среде;
- создадим две постройки в игре: гараж и башню с лестницей! 

К следующему занятию, пожалуйста, установите Roblox Studio на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Roblox Studio:
https://docs.google.com/document/d/1xVsuDnJHm5TyvGohi61ezIDFxZ6ggPOMAjejPl7d438/edit?usp=drive_link`
    },
    'Roblox Studio (старая версия)': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Roblox Studio.
На нём мы с вами:
- познакомились со средой Roblox Studio;
- изучили инструменты в этой среде;
- создали две постройки в игре: гараж и башню с лестницей! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое материалы и текстуры;
- напишем первую программу на языке программирования Lua;
- создадим ёлку с игрушками!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое материалы и текстуры;
- написали первую программу на языке программирования Lua;
- создали ёлку с игрушками!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как соединять детали друг с другом;
- научимся писать программы с использованием функции;
- создадим кнопку для открытия двери!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Roblox Studio.
На нём мы с вами:
- узнали, как соединять детали друг с другом;
- научились писать программы с использованием функции;
- создали кнопку для открытия двери!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать и настраивать эффекты;
- научимся создавать и использовать переменные;
- запрограммируем радугу!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Roblox Studio.
На нём мы с вами:
- узнали, как создавать и настраивать эффекты;
- научились создавать и использовать переменные;
- запрограммировали радугу! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научимся писать программы с условием;
- создадим игру "Мини-футбол"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научились писать программы с условием;
- создали игру "Мини-футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять в игру врагов и инструменты;
- научимся использовать цикл while;
- создадим игру на выживание!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Roblox Studio.
На нём мы с вами:
- узнали, как добавлять в игру врагов и инструменты;
- научились использовать цикл while;
- создали игру на выживание!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и изменять ландшафт в игре;
- научимся делать объекты прозрачными;
- создадим свою мини-игру со сбором ресурсов!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Roblox Studio.
На нём мы с вами:
- научились создавать и изменять ландшафт в игре;
- научились делать объекты прозрачными;
- создали свою мини-игру со сбором ресурсов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим телепорт;
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Roblox Studio.
На нём мы с вами:
- создали телепорт;
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Middle Roblox Studio!
На уроке мы:
- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл урок (№9) модуля Roblox Studio.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

Но на этом модуль Roblox Studio еще не закончился. На следующем уроке мы:
- сделаем мини-платформер!`,
      '10 урок': `Сегодня у нас прошёл урок №10 модуля Roblox Studio.
На нём мы с вами:
- сделали мини-платформер!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём создавать локацию для нашей будущей игры Brawl Stars!`,
      '11 урок': `Сегодня у нас прошёл урок №11 модуля Roblox Studio.
На нём мы с вами:
- создали локацию для нашей будущей игры Brawl Stars!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся быстро писать код;
- повторим основы работы с языком LUA!`,
      '12 урок': `Сегодня у нас прошёл урок №12 модуля Roblox Studio.
На нём мы с вами:
- научились быстро писать код;
- повторили основы работы с языком LUA!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Циклы";
- запрограммируем несколько строительных блоков!`,
      '13 урок': `Сегодня у нас прошёл урок №13 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Циклы";
- запрограммировали несколько строительных блоков!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим, как создавать условные конструкции в Lua;
- повторим, как добавлять эффекты;
- запрограммируем летающую платформу работать как лифт!`,
      '14 урок': `Сегодня у нас прошёл урок №14 модуля Roblox Studio.
На нём мы с вами:
- повторили, как создавать условные конструкции в Lua;
- повторили, как добавлять эффекты;
- запрограммировали летающую платформу работать как лифт!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Функции";
- сделаем опасные зоны на уровне, отнимающие здоровье игрока!`,
      '15 урок': `Сегодня у нас прошёл урок №15 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Функции";
- сделали опасные зоны на уровне, отнимающие здоровье игрока!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим и настроим в нашей игре пользовательский интерфейс!`,
      '16 урок': `Сегодня у нас прошёл урок №16 модуля Roblox Studio.
На нём мы с вами:
- добавили и настроили в нашей игре пользовательский интерфейс!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем пользовательский интерфейс;
- добавим в игру кристаллы и запрограммируем их сбор!`,
      '17 урок': `Сегодня у нас прошёл урок №17 модуля Roblox Studio.
На нём мы с вами:
- запрограммировали пользовательский интерфейс;
- добавили в игру кристаллы и запрограммировали их сбор!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Junior Roblox Studio!
- повторим тему "Случайное число";
- добавим игроку оружие;
- запрограммируем NPC на сбор кристаллов;
- усложним и доделаем нашу игру;
- подведём итоги модуля!`,
      '18 урок': `Сегодня у нас прошёл последний урок (№18) модуля Middle Roblox Studio.
На нём мы с вами:
- повторили тему "Случайное число";
- добавили игроку оружие;
- запрограммировали NPC на сбор кристаллов;
- усложнили и доделаем нашу игру;
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - JavaScript!
JavaScript - это настоящий язык программирования, который очень популярен во всём мире. На этом модуле мы сделаем игры: "Акинатор", "Викторину" и "Шар судьбы"! А также каждый из вас создаст свою веб-страничку (мини-сайт) по любимой игре и реализует на нём викторину!
На следующем уроке мы:
- узнаем, что такое Javascript;
- узнаем, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомимся с HTML и создали свою первую страничку!

К следующему занятию, пожалуйста, установите на свой компьютер Visual Studio Code! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Visual Studio Code: 
https://docs.google.com/document/d/1OcXlaH3LKw6rvbKDascR_CGONlabDgMcKVqCAxN4GmM/edit?usp=sharing`
    },
    'Roblox Studio (новая версия)': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSenw6M079Cf5txx0p5sI1Ud6xXbpb2Fu5B_BVSIfMtIGC3rcQ/viewform

Сегодня у нас прошёл урок №1 модуля Roblox Studio.
На нём мы с вами:
- познакомились со средой Roblox Studio;
- изучили инструменты в этой среде;
- создали две постройки в игре: гараж и башню с лестницей! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое материалы и текстуры;
- напишем первую программу на языке программирования Lua;
- создадим ёлку с игрушками!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1QZYrU0y4RCwsqdVRsuLIDpNyEdJYPohX/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSc_HrCt8KooaK9w9DYs54pRgHVEIz-1Yhh9U_wNkiKCHKKaBQ/viewform

Сегодня у нас прошёл урок №2 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое материалы и текстуры;
- написали первую программу на языке программирования Lua;
- создали ёлку с игрушками!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как соединять детали друг с другом;
- научимся писать программы с использованием функции;
- создадим кнопку для открытия двери!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1uHWZOP6BuEPx16rOygd_RYUZa3IbDurx/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/15YUimiQFGOw7PsvFV1U7NKxcya4_zWDR/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdP1dUFGvEEcbDZE4Ucozl3Kx2BiF9WJ-tr04rnLULaiw1dQA/viewform

Сегодня у нас прошёл урок №3 модуля Roblox Studio.
На нём мы с вами:
- узнали, как соединять детали друг с другом;
- научились писать программы с использованием функции;
- создали кнопку для открытия двери!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать и настраивать эффекты;
- научимся создавать и использовать переменные;
- запрограммируем радугу!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/14lIAlGZD3AKHkJYF4VDLM_NyIIsc3IUG/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1FNihiO8BRhM-fFX10wDHXgG9Tufqr3XM/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdjYDzwxqF3TW04okqGycwYg_820AcPoGlK4PEbkRSTlBqq_A/viewform

Сегодня у нас прошёл урок №4 модуля Roblox Studio.
На нём мы с вами:
- узнали, как создавать и настраивать эффекты;
- научились создавать и использовать переменные;
- запрограммировали радугу! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научимся писать программы с условием;
- создадим игру "Мини-футбол"!`,
      '5 урок': `Заготовка
https://create.roblox.com/marketplace/asset/15916684025/Stadium-CodeClass%3Fkeyword=&pageNumber=&pagePosition=

Готовый проект
https://drive.google.com/file/d/1ZHHwTFjd8WQTd75O3dFsr0fEayrCWa4z/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf6_EenNZFly1Ru_Mk09onfZ3Uxg1oPoLmibgjvAX7ln7i8WQ/viewform

Сегодня у нас прошёл урок №5 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научились писать программы с условием;
- создали игру "Мини-футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять в игру врагов и инструменты;
- создадим телепорт;
- научимся использовать цикл while;
- создадим игру на выживание!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1AfTdLOTbtJ2jQXcuw8kvHPZm3rzuyc4N/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1HU6uh6NW_Xinijdw7KF2Qk3uwLIDMtZO/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfQ0lj7Z66_acXf869s5om01AwIJpvvUU7yA2_Lxb3XRqjXdg/viewform

Сегодня у нас прошёл урок №6 модуля Roblox Studio.
На нём мы с вами:
- узнали, как добавлять в игру врагов и инструменты;
- создали телепорт;
- научились использовать цикл while;
- создали игру на выживание!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и изменять ландшафт в игре;
- научимся делать объекты прозрачными;
- создадим свою мини-игру со сбором ресурсов!`,
      '7 урок': `Готовый проект
https://drive.google.com/file/d/1XI44bpeufZT5hzTYYXcxtLgRHHXAWKBH/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfF4VphFC7VtmIEeuC7gZSDb2tUwyNnRa2yqn19u3XmCauLyQ/viewform

Сегодня у нас прошёл урок №7 модуля Roblox Studio.
На нём мы с вами:
- научились создавать и изменять ландшафт в игре;
- научились делать объекты прозрачными;
- создали свою мини-игру со сбором ресурсов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим локацию для нашей будущей игры Brawl Stars!`,
      '8 урок': `Готовый проект
https://drive.google.com/file/d/1dqZqqPDFVsyuZjyiSYLKGWpu_ODBxoZg/view?usp=drive_link

Сегодня у нас прошёл урок №8 модуля Roblox Studio.
На нём мы с вами:
- создали локацию для нашей будущей игры Brawl Stars!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим, как создавать условные конструкции в Lua;
- повторим, как добавлять эффекты;
- запрограммируем летающую платформу работать как лифт!`,
      '9 урок': `Заготовка
https://drive.google.com/file/d/1dqZqqPDFVsyuZjyiSYLKGWpu_ODBxoZg/view?usp=drive_link

Готовый проект
https://drive.google.com/file/d/12l0yfPSDBhVid2LXzBWrz4hzWwlS2Ec5/view?usp=drive_link 

Сегодня у нас прошёл урок (№9) модуля Roblox Studio.
На нём мы с вами:
- повторили, как создавать условные конструкции в Lua;
- повторили, как добавлять эффекты;
- запрограммировали летающую платформу работать как лифт!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим тему "Функции";
- сделаем опасные зоны на уровне, отнимающие здоровье игрока!`,
      '10 урок': `Заготовка
https://drive.google.com/file/d/12l0yfPSDBhVid2LXzBWrz4hzWwlS2Ec5/view?usp=drive_link

Готовый проект
https://drive.google.com/file/d/1VJzaiKq7ZpXGKzUpdu6ijkns0hxJ1bMr/view?usp=drive_link 

Сегодня у нас прошёл урок №10 модуля Roblox Studio.
На нём мы с вами:
- повторили тему "Функции";
- сделали опасные зоны на уровне, отнимающие здоровье игрока!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим и настроим в нашей игре пользовательский интерфейс!`,
      '11 урок': `Заготовка 
https://drive.google.com/file/d/1VJzaiKq7ZpXGKzUpdu6ijkns0hxJ1bMr/view?usp=drive_link 

Готовый проект
https://drive.google.com/file/d/1PgWmJ8M3kfp1qIWT9KxRrmhuOHeJfoVI/view?usp=sharing

Сегодня у нас прошёл урок №11 модуля Roblox Studio.
На нём мы с вами:
- добавили и настроили в нашей игре пользовательский интерфейс!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с новыми объектами игры;
- создадим первый уровень игры "Башня ада";
- научимся использовать цикл Repeat;
- запрограммируем таймер!`,
      '12 урок': `Заготовка
https://drive.google.com/file/d/1zPAQZTIb46_M2GWOFl82ipr9PDeVte-D/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1HF_bYM8V7t1WhJys-UsiPwD2gRimL5xv/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScNaEhMjyQGQsYdgEU_7wTCmqc0UKXzEoa3cx3kZRqjr5b5Pg/viewform

Сегодня у нас прошёл урок №12 модуля Roblox Studio.
На нём мы с вами:
- познакомились с новыми объектами игры;
- создали первый уровень игры "Башня ада";
- научились использовать цикл Repeat;
- запрограммировали таймер!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим в игру доску лидеров;
- добавим в игру магазин;
- напишем скрипты для покупок в магазине!`,
      '13 урок': `Заготовка
https://drive.google.com/file/d/1zMRJFsitFl0-zEP1smA4nidwdFEiLBv_/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/13pnXPCVTkNjQ8CNKWou_MLk2T_Rb8Le1/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfZF_th3Fag6ljtOFq9HGxvDublU5Q4pk6aoLa1bBMAVnpkKQ/viewform


Сегодня у нас прошёл урок №13 модуля Roblox Studio.
На нём мы с вами:
- добавили в игру доску лидеров;
- добавили в игру магазин;
- написали скрипты для покупок в магазине!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- напишем скрипт для генерации башни;
- добавим ещё один уровень в башню;
- запрограммируем создание новой башни при перезапуске времени!`,
      '14 урок': `Заготовка
https://drive.google.com/file/d/1fqqq7HYwV2YaeGDjSCqS0siMImjX81V7/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1EaIFmOvH2u5OENv5hbb2ggAdcPbesmGc/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdRTS8EmxbQlY5qL5kR2Z-8O3YuN0SI2dbYyCEaBa7TB9zwXQ/viewform

Сегодня у нас прошёл урок №14 модуля Roblox Studio.
На нём мы с вами:
- написали скрипт для генерации башни;
- добавили ещё один уровень в башню;
- запрограммировали создание новой башни при перезапуске времени!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять модели при помощи CommandBar;
- настроим HeightGui в игре;
- добавим в игру блок, дающий очки за прохождение башни;
- запрограммируем WinBlock!`,
      '15 урок': `Заготовка
https://drive.google.com/file/d/18F7OSobh_gSPLa8uJyNAlJLenOS7ekN4/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1DYZCTgGNTvaIw2QHJVW5JNgE8e0dDyGI/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeF_w9Ek3fDgbT8feaerPj5jlP-dknHm8vQWDTQwPKRS_bmIA/viewform

Сегодня у нас прошёл урок №15 модуля Roblox Studio.
На нём мы с вами:
- научились добавлять модели при помощи CommandBar;
- настроили HeightGui в игре;
- добавили в игру блок, дающий очки за прохождение башни;
- запрограммировали WinBlock!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- добавим в игру респаун игроков;
- запрограммируем респаун игроков по истечению времени;
- исправим WinBlock; 
- добавим в игру музыку!`,
      '16 урок': `Заготовка
https://drive.google.com/file/d/1EZw1lCwW0Y-_txIMBeI7xAA7WFcLQaBS/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1IOs7O15KvAHj-o38f5TFk58VRSForkmC/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdv_eflrICOPsDpy_ssS_Y-49Ajs7VMHnwTPdj9cdt-oktaVQ/viewform

Сегодня у нас прошёл урок №16 модуля Roblox Studio.
На нём мы с вами:
- добавили в игру респаун игроков;
- запрограммировали респаун игроков по истечению времени;
- исправили WinBlock; 
- добавили в игру музыку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- определим задачи и тему собственного проекта;
- составим план работы над проектом;
- начнём работу над проектом: создадим локацию!`,
      '17 урок': `Сегодня у нас прошёл урок №17 модуля Roblox Studio.
На нём мы с вами:
- определили задачи и тему собственного проекта;
- составили план работы над проектом;
- начали работу над проектом: создали локацию!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- закончим и защитим проекты;
- подведём итоги модуля!`,
      '18 урок': `Сегодня у нас прошёл последний урок (№18) модуля Middle Roblox Studio.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - JavaScript!
JavaScript - это настоящий язык программирования, который очень популярен во всём мире. На этом модуле мы сделаем игры: "Акинатор", "Викторину" и "Шар судьбы"! А также каждый из вас создаст свою веб-страничку (мини-сайт) по любимой игре и реализует на нём викторину!
На следующем уроке мы:
- узнаем, что такое Javascript;
- узнаем, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомимся с HTML и создали свою первую страничку!

К следующему занятию, пожалуйста, установите на свой компьютер Visual Studio Code! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Visual Studio Code: 
https://docs.google.com/document/d/1OcXlaH3LKw6rvbKDascR_CGONlabDgMcKVqCAxN4GmM/edit?usp=sharing`
    },
    'JavaScript': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1a0Bsr_zFPY6w3HFzAgNpsQGhbmZnOcfb?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1qyWa0QK0Iuh-8GkitpmIybwg_rhGirR5?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSet1gEhz7yuEGVWSm5ccjVjfTP0DOObtryGBJonzgjIgDzzlA/viewform?usp=sf_link

Сегодня у нас прошёл урок №1 модуля JavaScript.
На нём мы с вами:
- узнали, что такое Javascript;
- узнали, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомились с HTML и создали свою первую страничку!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с операторами сравнения и условными конструкциями;
- познакомимся с функциями ввода/вывода;
- напишем свою игру "Акинатор"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1hatFJgtEdRN-Wi_FfeRMGEhSwBtWJHBz?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/17F1yy2XPMHXVr9szGHXNidFTnvDCG7mw?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfgwab5TOMVLEzUxXGfNaCzivMtwGhBwKuE_EHQiCqxmYpyMA/viewform

Сегодня у нас прошёл урок №2 модуля JavaScript.
На нём мы с вами:
- познакомились с операторами сравнения и условными конструкциями;
- познакомились с функциями ввода/вывода;
- написали свою игру "Акинатор"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с циклами while и do … while;
- научимся создавать и программировать кнопки на веб-страницах;
- доработаем Акинатор!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/167bTFRUnK8Jk0iYNLEa3mmveVjlIz7gC?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1J0UbZwsJJnVzza72A-iUbOOknqsa2Z4q?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf_Dr7j-qTG6frxUjkh2wC7xxQ7YIeoOLTYk1X35b5SH1lQ4g/viewform?usp=sf_link

Сегодня у нас прошёл урок №3 модуля JavaScript.
На нём мы с вами:
- познакомились с циклами while и do … while;
- научились создавать и программировать кнопки на веб-страницах;
- доработали Акинатор!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с массивами;
- научимся получать случайное число;
- сделаем игру "Шар судьбы"!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1KuL0ixgaiXFMiA2DBdkJyegoXN0K65Ku?usp=sharing


Готовый проект
https://drive.google.com/drive/folders/1jiMaU1AbyCJJ47suEFVkSRSKqX98RAvY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe_z1U9FyAsVEmHp4bQw6ujtCbjlpg_pMr3dMjCsTnyLVQuZQ/viewform?usp=sf_link

Сегодня у нас прошёл урок №4 модуля JavaScript.
На нём мы с вами:
- познакомились с массивами;
- научились получать случайное число;
- сделали игру "Шар судьбы"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое объекты;
- научимся пользоваться объектами для хранения данных;
- сделаем заготовку под "Викторину"!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1x7j5GP9QsArcp-5dBCRtaZ5wFCzRPWd7?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/13Oo4T1nGUhbzS2x-t1SKUaq7S4RK4anV?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd-bBxFs6Yl0gnLsk_GwaeLw1zKNAzh8-2ON6uxaX000aupGg/viewform?usp=sf_link

Сегодня у нас прошёл урок №5 модуля JavaScript.
На нём мы с вами:
- узнали, что такое объекты;
- научились пользоваться объектами для хранения данных;
- сделали заготовку под "Викторину"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с циклом for;
- научимся пользоваться переменной счётчика;
- доделаем "Викторину"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1Ycg-aaVdqHeKKb1ynxMa-YeWPVgLH77x?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1K56LRWdh3qJ1G3qS-qLBNhSnMzJxXl32?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfxRClbeqY2h_kROmavkiydre64O4mHaAdvsvW2Zaeam0g_iw/viewform

Сегодня у нас прошёл урок №6 модуля JavaScript.
На нём мы с вами:
- познакомились с циклом for;
- научились пользоваться переменной счётчика;
- доделали "Викторину"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "контейнер";
- начнём создавать собственный сайт!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/17NDiKMy5kN5D24ejsRWbJ08dKYZOwJSx?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1zn4ptZjKULFecCCwP5ai6A9o8CXh2ZlR?usp=sharing

Сегодня у нас прошёл урок №7 модуля JavaScript.
На нём мы с вами:
- узнали, что такое "контейнер";
- начали создавать собственный сайт!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Middle JavaScript!
На уроке мы:
- доделаем собственный сайт;
- проведем презентацию проектов;
- подведём итоги модуля!`,
      '8 урок': `Готовый проект 
https://drive.google.com/drive/folders/1i_kEUCH0WlhB-DKsUyYbdXrV6jCPrlJN?usp=sharing

Сегодня у нас прошёл последний урок (№8) модуля Middle JavaScript.
На нём мы с вами:
- доделали собственный сайт;
- провели презентацию проектов;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)`
    },
    'Blender': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1dGvVllHMKNK6VBaFSuUNNL_8N8J8SKkJ?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd8oP5qwt9iniJjYdJ2WFQFU1-oxo5RqLSRM9L1kCAt-PBuTQ/viewform

Сегодня у нас прошёл урок №1 модуля Blender.
На нём мы с вами:
- познакомились с интерфейсом программы Blender;
- научились пользоваться базовыми инструментами;
- познакомились с примитивами и научимся их добавлять;
- научились объединять несколько объектов в один;
- сделали первые 2 модели для пиратской каюты: стол и стул!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся наносить материалы на объекты;
- познакомимся с режимами просмотра в Blender;
- познакомимся с режимом редактирования в Blender;
- узнаем, из чего состоит любая 3D-модель;
- познакомимся с инструментом Loop Cut;
- сделаем ещё одну модель для пиратской каюты: бочку!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1dGvVllHMKNK6VBaFSuUNNL_8N8J8SKkJ?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/15oTIoB4Cmu4xb8QYRL9GHYF-Tgh44ZZ9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScyvz157sJu8MKD8CdSKwB5m5QrzWbXKFMUCXTb_kQdZqPaPg/viewform


Сегодня у нас прошёл урок №2 модуля Blender.
На нём мы с вами:
- научились наносить материалы на объекты;
- познакомились с режимами просмотра в Blender;
- познакомились с режимом редактирования в Blender;
- узнали, из чего состоит любая 3D-модель;
- познакомились с инструментом Loop Cut;
- сделали ещё одну модель для пиратской каюты: бочку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с инструментами Inset Faces и Extrude Region и научимся ими пользоваться;
- научимся создавать глянцевые материалы;
- научимся применять материалы к полигонам;
- познакомимся с модификатором Subdivision Surface;
- сделаем ещё одну модель для пиратской каюты: серебряный кубок!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/15oTIoB4Cmu4xb8QYRL9GHYF-Tgh44ZZ9?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ooTiJbmtm0S7msUsadxs1lMRQ6keRAcx?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfJtJhd_iijoIkOXTn7o-HUKCO6xOOFNAMtLyHpTN7eZXyoEA/viewform

Сегодня у нас прошёл урок №3 модуля Blender.
На нём мы с вами:
- познакомились с инструментами Inset Faces и Extrude Region и научились ими пользоваться;
- научились создавать глянцевые материалы;
- научились применять материалы к полигонам;
- познакомились с модификатором Subdivision Surface;
- сделали ещё одну модель для пиратской каюты: серебряный кубок!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с понятием текстура и научимся их применять к моделям;
- познакомимся с вкладкой Shading;
- познакомимся с нодами и поработаем в редакторе нод;
- познакомимся с развёрткой;
- научимся работать с развёрткой объектов во вкладке UV Editing;
- нанесём текстуры на все модели пиратской каюты, добавим ковёр и пол!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/18JXWcFgzdzfS6bcD0Ht2k47rJKdl_o7g?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1SiOVzfDV_PVFdT5mnmUWzDDrqHkRhhA2?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSc9mAkN57QFH1tTB6NB6SKJ_Mymky7GoTssURcpdUf44ezd-w/viewform?usp=sf_link

Сегодня у нас прошёл урок №4 модуля Blender.
На нём мы с вами:
- познакомились с понятием текстура и научились их применять к моделям;
- познакомились с вкладкой Shading;
- познакомились с нодами и поработали в редакторе нод;
- познакомились с развёрткой;
- научились работать с развёрткой объектов во вкладке UV Editing;
- нанесли текстуры на все модели пиратской каюты, добавили ковёр и пол!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся импортировать модели в проект;
- познакомимся с физикой в Blender;
- научимся применять физику твёрдых тел к объектам;
- научимся применять физику ткани к объектам;
- познакомимся с анимацией в Blender и поработаем с временной шкалой;
- сделаем сундук, заполненный золотыми монетами и карту на столе!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1-Mn5eOTsCdUzPkxUUx7oz2B7gq5rNgzt?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1eQYhZN8-w2dEq668T-MaU-Uc9q-6hBh-?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdn96w7awmiq9ae5bP6JX64IqsKK_vP1f1Vy2o9IFrwv5Rurg/viewform

Сегодня у нас прошёл урок №5 модуля Blender.
На нём мы с вами:
- научились импортировать модели в проект;
- познакомились с физикой в Blender;
- научились применять физику твёрдых тел к объектам;
- научились применять физику ткани к объектам;
- познакомились с анимацией в Blender и поработали с временной шкалой;
- сделали сундук, заполненный золотыми монетами и карту на столе!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять референсы прямо в область просмотра;
- познакомимся с инструментом нож;
- научимся моделировать поочередно части, а потом их совмещать;
- научимся моделировать по референсу;
- сделаем пиратскую саблю!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1wqqO5pCsIGoEurOAmQHdMZzIDlRpP9Rr?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1TSkUhfr9D7C_RcCo8whz_2Ypyu-bhSd0?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSc7mFdNQ1sHsox6lK_oOkDyLz4IBYRD4WWMmrpM5WJJo475qQ/viewform?usp=sf_link

Сегодня у нас прошёл урок №6 модуля Blender.
На нём мы с вами:
- научились добавлять референсы прямо в область просмотра;
- познакомились с инструментом нож;
- научились моделировать поочередно части, а потом их совмещать;
- научились моделировать по референсу;
- сделали пиратскую саблю!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять текст и работать с ним;
- познакомимся с модификатором Boolean;
- познакомимся с инструментом Bevel;
- научимся использовать Loop Cut and Slide;
- научимся использовать контекстное меню при работе с полигонами и ребрами;
- сделаем гравировку на сабле, а также модель бутылки и книги!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/11rotAxPsMU2L3ULqaDVfiADibZSX6VRy?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1l8FEjshJ-qrzZSaj4Fbk36eWNLMRGvxE?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdsLY65PbE61XRWXHLqhWJz5FJQDMf1HEND-e_McMA3xq6vEw/viewform

Сегодня у нас прошёл урок №7 модуля Blender.
На нём мы с вами:
- научились добавлять текст и работать с ним;
- познакомились с модификатором Boolean;
- познакомились с инструментом Bevel;
- научились использовать Loop Cut and Slide;
- научились использовать контекстное меню при работе с полигонами и ребрами;
- сделали гравировку на сабле, а также модель бутылки и книги!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- доделаем каюту, поставим стены и окна;
- познакомимся со светящейся поверхностью материала;
- познакомимся с типами освещения и научимся их расставлять;
- познакомимся с графическим движком Cycles;
- научимся работать с камерой;
- сделаем финальный рендер пиратской каюты!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1dfRdeXYomguJGGZqewm026XdkT35zQYe?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1xQn3rQvJ1Vbu9JqKT3UclamV6JfaC-YZ?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSdUEc4cXRtuicwWBcnGGU-xjuxoFuzqGh4IoDg86tq6SP8oow/viewform?usp=sf_link

Сегодня у нас прошёл урок №8 модуля Blender.
На нём мы с вами:
- доделали каюту, поставим стены и окна;
- познакомились со светящейся поверхностью материала;
- познакомились с типами освещения и научимся их расставлять;
- познакомились с графическим движком Cycles;
- научились работать с камерой;
- сделали финальный рендер пиратской каюты!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- подведём итоги модуля; 
- начнём создавать собственный проект!`,
      '9 урок': `Сегодня у нас прошёл урок №9 модуля Blender.
На нём мы с вами:
- подвели итоги модуля; 
- начали создавать собственный проект!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Expert Blender!
На уроке мы:
- доработаем проекты и подготовимся к защите;
- проведём презентацию проектов!`,
      '10 урок': `Сегодня у нас прошёл последний урок (№10) модуля High Expert Blender.
На нём мы с вами:
- доработали проекты и подготовились к защите;
- провели презентацию проектов!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Unity!
Unity - это очень популярный игровой движок. Мы с нуля создадим 2х уровневую игру, создадим игру раннер, анимацию с часами, изучим все основные возможности этого игрового движка и даже добавим в игру собственно созданные модели в Blender!
На следующем уроке мы:
- изучим интерфейс программы Unity;
- научимся работать с базовыми объектами и инструментами;
- создадим первую сцену! 

К следующему занятию, пожалуйста, установите на свой компьютер Unity! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Unity: https://docs.google.com/document/d/1dQnyILlvvie9BLVEXF1ZU3X6sPO7x2uolAqz4tRNnfU/edit?usp=sharing`
    },
    'Unity': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1Aizlq3zX3SIBCycyi12ChxWHj9wzDKTI?usp=sharingAi

Готовый проект
https://drive.google.com/file/d/1OEIShV31-LTBBOCEiGixN2rKaNZyO9NO/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeM0iRh6Ltj75N2WXBVYkebeVEi7d5UWwkJE_FqOzN0acNVag/viewform

Сегодня у нас прошёл урок №1 модуля Unity.
На нём мы с вами:
- изучили интерфейс программы Unity;
- научились работать с базовыми объектами и инструментами;
- создали первую сцену! 


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять Collider на объекты;
- познакомимся с языком программирования C#, узнаем, что такое классы и функции;
- научимся создавать скрипты и напишем первую программу для вращения объектов;
- доработаем 1-ый уровень!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1lIJSS6C48XhXeseTHif-yZt42tC8ko43?usp=sharing

Готовый проект
https://drive.google.com/file/d/1cGCRMdSNE9NzCbgZ7cmJoN58jcZJgqZv/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSft8ebr4nD86WFl-5fk-22TDle5z5Arsogo7b6-iGcEiQGjVA/viewform

Сегодня у нас прошёл урок №2 модуля Unity.
На нём мы с вами:
- узнали, как добавлять Collider на объекты;
- познакомились с языком программирования C#, узнали, что такое классы и функции;
- научились создавать скрипты и написали первую программу для вращения объектов;
- доработали 1-ый уровень!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с системой частиц;
- познакомимся с триггерами;
- научимся писать программу перезагрузки уровня;
- закончим создание 1-го уровня игры!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1jz2X27VzLieRtzHepBRo3klJIEVtwEcd?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LeLY4oksVZU9MOxGGCgkkFq9coWKBAQ8/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdH0mgOkrEfeicvft92bF7Eum4dBbCtJvXh2O2txovxID6dBw/viewform

Сегодня у нас прошёл урок №3 модуля Unity.
На нём мы с вами:
- познакомились с системой частиц;
- познакомились с триггерами;
- научились писать программу перезагрузки уровня;
- закончить создание 1-го уровня игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать ландшафт;
- узнаем о переменных и типах данных;
- напишем программу перехода между уровнями;
- начнём создание 2-го уровня!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1tb24xgpV8h5g4eBjBnWfdVzT-GSjxMLj?usp=sharing

Готовый проект
https://drive.google.com/file/d/1AtCEmI3DdG9m3Lxm7BehJ3s3nm0K_dPs/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScUmMsOPJKzWyY65XgDSJxK99v40TE45430oUsdOnomlZip9g/viewform

Сегодня у нас прошёл урок №4 модуля Unity.
На нём мы с вами:
- узнали, как создавать ландшафт;
- узнали о переменных и типах данных;
- написали программу перехода между уровнями;
- начали создание 2-го уровня!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять UI в Unity;
- научимся влиять на UI с помощью кода;
- познакомимся с условными конструкциями If и тегами; 
- создадим полоску здоровья и опасную зону на уровне!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1-1gO7vpfx6ksLMfB7j1-neyZB4VYkIWM?usp=sharing

Готовый проект
https://drive.google.com/file/d/1jeGhkfu1ZdBs8S5NjTH0yYKAbqIrQSoq/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd1zY0AREu0ZQMTxQCCCf5mytYOwwe7wL3DzGUbqxA0nBoIuw/viewform

Сегодня у нас прошёл урок №5 модуля Unity.
На нём мы с вами:
- узнали, как добавлять UI в Unity;
- научились влиять на UI с помощью кода;
- познакомились с условными конструкциями If и тегами; 
- создали полоску здоровья и опасную зону на уровне! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с инструментами навигации в Unity;
- познакомимся с функциями GetComponent и SetDestination;
- познакомимся с переменной Time.deltaTime и функцией sqrMagnitude;
- добавим на уровень врагов, заставили их нас преследовать и отнимать здоровье!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/19gk1HYjlFgh_57t3QdcYtVoJ0aoG8Pp7?usp=sharing

Готовый проект
https://drive.google.com/file/d/1y_NaPM3344IpwkLKJH40jXYiOyGtIjL1/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSces-y2aopzoU8eQdUmoroEMq0o4A7TYqZi9gyoxMm5bhJquQ/viewform

Сегодня у нас прошёл урок №6 модуля Unity.
На нём мы с вами:
- познакомились с инструментами навигации в Unity;
- познакомились с функциями GetComponent и SetDestination;
- познакомились с переменной Time.deltaTime и функцией sqrMagnitude;
- добавили на уровень врагов, заставили их нас преследовать и отнимать здоровье!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с физикой твёрдого тела - RigidBody;
- познакомимся с функцией отслеживания нажатий клавиш;
- познакомимся с функциями создания и уничтожения объектов;
- добавили игроку арбалет, научили его стрелять, заставили ботов реагировать на выстрелы!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/19UE_8SLDnshvRjzV5gTr5daEf9eAu8M1?usp=sharing

Готовый проект
https://drive.google.com/file/d/12o5vGzaXygqMWSHBkC5cB4A2m6h1y1Ww/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeKs9ZJRiwI0FpLNXBrdyJ4qhCMPBZr4vNk1SmD6qLd7gWnSA/viewform

Сегодня у нас прошёл урок №7 модуля Unity.
На нём мы с вами:
- познакомились с физикой твёрдого тела - RigidBody;
- познакомились с функцией отслеживания нажатий клавиш;
- познакомились с функциями создания и уничтожения объектов;
- добавили игроку арбалет, научили его стрелять, заставили ботов реагировать на выстрелы! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся работать со звуком в Unity;
- научимся добавлять и расставлять источники освещения;
- запрограммируем смену дня и ночи;
- добавим в нашу игру звуки и свет!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1FVx1C0-7hUiZaOgCZl32KlrrDsr76ZuK?usp=sharing

Готовый проект
https://drive.google.com/file/d/1kzSJfuN_3wEQrhMRCiOo9x7ALi1Y0RNR/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeYBL2ek6lSr7X14qc7QamPEG7z31Nkpasvf-E46h_lbO-u2Q/viewform

Сегодня у нас прошёл урок №8 модуля Unity.
На нём мы с вами:
- научились работать со звуком в Unity;
- научились добавлять и расставлять источники освещения;
- запрограммировали смену дня и ночи;
- добавили в нашу игру звуки и свет!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся работать с кнопками и создали главное меню;
- научимся программировать кнопки;
- закончим нашу игру!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/1AZgLI6afZhHdC_HWJFoaXO6xp_9QMTHm?usp=sharing

Готовый проект
https://drive.google.com/file/d/1iLtovZhXbFsF2LOHOsC2DQXhICPHVyof/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdRf7xVhsASvuZ9bqVyh-4iihgabMr0P6aHDFSb269NblmUjg/viewform

Сегодня у нас прошёл урок №9 модуля Unity.
На нём мы с вами:
- научились работать с кнопками и создали главное меню;
- научились программировать кнопки;
- закончили нашу игру!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся собирать проект в полноценную игру;
- начнём создавать игру City Runner!`,
      '10 урок': `Заготовка
https://drive.google.com/file/d/1DK8I5GHlF2P3YxWXrQfvz_dWcfI1pl5l/view?usp=drive_link


Готовый проект
https://drive.google.com/file/d/1x-idagRw2TQ1CHaBKpolanGSmzaZjAQe/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebHQXxbd_HwQpA2XJbEgfBqskCXFrDx-vADRBQg3uWi3Xp3Q/viewform

Сегодня у нас прошёл урок №10 модуля Unity.
На нём мы с вами:
- научились собирать проект в полноценную игру;
- добавили ассеты в наш проект;
- познакомились с новым видом объекта - префабом;
- начали делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- заставим нашего персонажа двигаться и научимся им управлять;
- научим нашего персонажа прыгать;
- научимся программировать сложные условия;
- продолжим делать игру City Runner!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1I2lAgSqUN9ThhFtLXh6Du_4W3qZTHPiO

Готовый проект
https://drive.google.com/file/d/12_j4DmZbzP_K9gGDe_bfr2UQvSMH4d-9/view?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdvI7zgDfNsogDueMbSDmtFj4Qq1mSr84XNsHvLW8We_7U-VQ/viewform?usp=sharing

Сегодня у нас прошёл урок №11 модуля Unity.
На нём мы с вами:
- заставили нашего персонажа двигаться и научились им управлять;
- научили нашего персонажа прыгать;
- научились программировать сложные условия;
- продолжили делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научим персонажа собирать монеты, врезаться в кусты;
- запрограммируем условие проигрыша игры;
- добавим в игру UI;
- продолжим делать игру City Runner!`,
      '12 урок': `Заготовка
https://drive.google.com/drive/folders/167EptFyQZxE1aqBpZOzVvv472D5yolfY

Готовый проект
https://drive.google.com/file/d/1LgbppDJc6zF4OdT4kv8QrEYTRcvhYGnN/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLScs9g3lj8Xip4fXq-zbIVKuNwXh83moED8gjHC4V7XwlVqDvQ/viewform?usp=dialog

Сегодня у нас прошёл урок №12 модуля Unity.
На нём мы с вами:
- научили персонажа собирать монеты и врезаться в кусты;
- запрограммировали условие проигрыша игры;
- добавили в игру UI;
- продолжили делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- сделаем бесконечную генерацию уровня;
- добавим в игру звуки прыжка, сбора монеты и фоновую музыку;
- закончим игру City Runner!`,
      '13 урок': `Заготовка
https://drive.google.com/drive/folders/1twz7oo-ORjcJYMwLmK7sckeQuczrE9Jw?usp=sharing

Готовый проект
https://drive.google.com/file/d/1uuFOoabKPmbXxoYtFB28paz4Oaq62laU/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLScRPy8XFBNKynhjznMffhJi9psmCuhbtzbQdD2alZAiboI2Pw/viewform?usp=sharing


Сегодня у нас прошёл урок №13 модуля Unity.
На нём мы с вами:
- сделали бесконечную генерацию уровня;
- добавили в игру звуки прыжка, сбора монеты и фоновую музыку;
- закончили игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнем делать игру Memory!`,
      '14 урок': `Заготовка:
https://drive.google.com/drive/folders/1YpNidYDWT7REQwhAsVRWfFRSCu1teFSs?usp=sharing

Готовый проект:
https://drive.google.com/file/d/1nYuMekgaqqviZ_obqjutEAKIfKoPKXLJ/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd8EEO-xi3kECvd5IBE39rICX3-hcppB_qC1hGfD9VZfW1q-A/viewform?usp=dialog

Сегодня у нас прошёл урок №14 модуля Unity.
На нём мы с вами:
узнали, как создавать объекты в 2D-играх;
научились работать с консолью Unity;
познакомились с методами OnMouseDown() и SetActive();
начали создавать игру Memory!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
познакомимся с командой Random.Range();
узнаем особенности работы Instantiate();
запрограммируем копирование карты;
продолжим создавать игру Memory!`,
      '15 урок': `Заготовка
https://drive.google.com/file/d/1nYuMekgaqqviZ_obqjutEAKIfKoPKXLJ/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScLpI95Q9UF9swCSnkR2p6UExfIadS4tGCZIr9DMdzuAfT2fQ/viewform

Готовый проект
https://drive.google.com/file/d/1Xybi5H6hWQC4mOWQZe9CA6qu35hOwDt7/view?usp=sharing


Сегодня у нас прошёл урок №15 модуля Unity.
На нём мы с вами:
познакомились с командой Random.Range();
узнали особенности работы Instantiate();
запрограммировали копирование карты;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
сделаем так, чтобы карта копировалась 8 раз;
сделаем так, чтобы изображения у карт на сцене были парными;
продолжим создавать игру Memory!`,
      '16 урок': `Заготовка
https://drive.google.com/file/d/1Xybi5H6hWQC4mOWQZe9CA6qu35hOwDt7/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScfFEVMPolwMqOPFPHqUn9VcX6awv5dq6S8_WFI28Sl1RFOjw/viewform?usp=dialog


Готовый проект
https://drive.google.com/file/d/1nX8eq2XVxzVc5fRRhYI602g4wayFnj2i/view?usp=sharing


Сегодня у нас прошёл урок №16 модуля Unity.
На нём мы с вами:
сделали так, чтобы карта копировалась 8 раз;
сделали так, чтобы изображения у карт на сцене были парными;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
сделаем так, чтобы карты открывались парами;
сделаем так, чтобы если открытая пара не совпала, то она закрывается;
научимся создавать сопрограммы;
продолжим создавать игру Memory!`,
      '17 урок': `Заготовка
https://drive.google.com/file/d/1nX8eq2XVxzVc5fRRhYI602g4wayFnj2i/view?usp=sharing


Тест
docs.google.com/forms/d/e/1FAIpQLSdmfHxBa58vwdEZSyqVpeD7NauMoLSDmx-m5AjWGdIuWSPVwg/viewform?usp=dialog


Готовый проект
https://drive.google.com/file/d/1pIVB21OW63fZAtthvULnYZCzy7-QWd6_/view?usp=sharing

Сегодня у нас прошёл урок №17 модуля Unity.
На нём мы с вами:
сделали так, чтобы карты открывались парами;
сделали так, чтобы если открытая пара не совпала, то она закрывается;
научились создавать сопрограммы;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
добавим в игру пользовательский интерфейс;
научимся работать с системой TextMesh Pro;
запрограммируем набор очков в игре;
создадим таймер;
продолжим создавать игру Memory!`,
      '18 урок': `Заготовка
https://drive.google.com/drive/folders/1Aj6OVd0Ks9o0_QSB_0d3_DwBSDXJs2N3?usp=sharing


Тест
https://docs.google.com/forms/d/e/1FAIpQLScpoRItvCNz0PqXdk5ewYQltkp2PZEnunqV1VkvJNIcQTF4Bw/viewform?usp=dialog


Готовый проект
https://drive.google.com/file/d/1nc-SbyFKVIFbZ1MRu2tRvTcbnuRl_oas/view?usp=sharing


Сегодня у нас прошёл урок №18 модуля Unity.
На нём мы с вами:
добавили в игру пользовательский интерфейс;
научились работать с системой TextMesh Pro;
запрограммировали набор очков в игре;
создали таймер;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
запрограммируем победу и поражение;
добавим звуки в игру;
закончим и скомпилируем игру Memory!`,
      '19 урок': `Заготовка
https://drive.google.com/drive/folders/1c9Mq4KLL8dGGNMf_d0ndvdbwjfZChYza?usp=sharing


Тест
https://docs.google.com/forms/d/e/1FAIpQLSdmSCllBJiSmacln4Shnjqs0ehMpdYXiPXvPm1vMgQFrGbDzA/viewform?usp=dialog


Готовый проект
https://drive.google.com/file/d/1pw9T7vkT-_acU4kCLLftlWf-l590r_gy/view?usp=sharing


Сегодня у нас прошёл урок №19 модуля Unity.
На нём мы с вами:
запрограммировали победу и поражение;
добавили звуки в игру;
закончили и скомпилировали игру Memory;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
подведем итоги модуля; 
начнем создавать собственный проект!`,
      '20 урок': `Сегодня у нас прошёл урок №20 модуля Unity.
На нём мы с вами:
- подвели итоги модуля; 
- начали создавать собственный проект!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Unity!
На уроке мы:
- доработаем проекты и подготовимся к защите;
- проведём презентацию проектов!`,
      '21 урок': `Сегодня у нас прошёл последний урок (№21) модуля Unity.
На нём мы с вами:
- доработали проекты и подготовились к защите;
- провели презентацию проектов!

Все ребята молодцы, отлично справились с проектами!`
    },
    'HTML, CSS, JavaScript': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1FIF-MT3qzZpe72H_1ouXJnCHbrGH_GdK?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfnjmSK4DjfoAU62c2_IjLho2bjcQOERfPWn-NmGiJchp_fIA/viewform

Сегодня у нас прошёл урок №1 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с интерфейсом среды Visual Studio Code;
- познакомились со структурой HTML-документа;
- познакомились с CSS, научились создавать и применять стили;
- сделали заготовку для нашего будущего сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с заказчиком, получим техническое задание и макет, научимся работать с Figma;
- познакомимся с div-элементами и классами;
- научимся менять расположение div-элементов;
- научимся применять правила стиля к классам и познакомимся со многими новыми CSS-правилами;
- cделаем header сайта!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1nvtXb3lbq6b8nbi0iplLAWYv9bKPmZ_2?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1i9bybnKsrZKY5xH1ijsIjKGPB8uCdJZY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSekboQknGoVpy-nFkVGe09F4Z3i0bfddkaZWsKOhX2PQBTwdg/viewform

Сегодня у нас прошёл урок №2 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с заказчиком, получили техническое задание и макет, научились работать с Figma;
- познакомились с div-элементами и классами;
- научились менять расположение div-элементов;
- научились применять правила стиля к классам и познакомились со многими новыми CSS-правилами;
- cделали header сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с секциями в HTML;
- научимся добавлять на сайт изображения;
- создадим обёртку для секции;
- сверстаем первые 3 раздела нашего сайта!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1wOYkBPu5PpxcPMqOElLeaSbnZwoqIEkt?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/17C1DadQRsgzCvmDNyuSjOxpRmerH4YRf?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfCpkJ644SXGFuIPqQ6t7QEhsML4FDVjVXZFaJN-FNYJLJ-Xg/viewform

Сегодня у нас прошёл урок №3 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с секциями в HTML;
- научились добавлять на сайт изображения;
- создали обёртку для секции;
- сверстали первые 3 раздела нашего сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- вспомним, как добавлять обёртку секции и изображения;
- познакомимся с псевдоэлементами before и after;
- сделаем секцию навыков на нашем сайте.`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1hsezeFrZeKyj0ug4_FdLLl4SD1ZqhRoi?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1od7tmVzQNJu2PIwex-TUPr9betVEcco9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfP9Nohx7fmg03WQj_jnLPM6sQX2tvHBKFbDYTNhhF8MBEgSg/viewform

Сегодня у нас прошёл урок №4 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- вспомнили, как добавлять обёртку секции и изображения;
- познакомились с псевдоэлементами before и after;
- сделали секцию навыков на нашем сайте.

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять на сайт видео;
- сбросим настройки "по умолчанию";
- закрепим header сайта;
- сделаем секцию процессов и закрепили главное меню!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1hB1FopF1Sb_IqJhb2kNIfQlWP1MiAzbp?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1KhU_5dY-31ZTme6OvwmWZlWHZR9m3CPW?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScIEMhA4nVb_6TvjUVOMenSvT6N1I06kOXT-jnrY-Ej58tiag/viewform


Сегодня у нас прошёл урок №5 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- научились добавлять на сайт видео;
- сбросили настройки "по умолчанию";
- закрепили header сайта;
- сделали секцию процессов и закрепили главное меню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся со свойством flex-direction;
- научимся создавать формы, поля ввода, текстовую область и кнопки;
- сделаем секцию формы!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1asyewSjfiuHRHbYqofRsdfu6NBwrRsNz?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1yHgeH8Jq8buqykmc4sJF6MWFWWWzpxXv?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeddyqgBHKXRfn8m-gkcNvtGFABwEtB_mkqPpMQQ28t7JVn3g/viewform

Сегодня у нас прошёл урок №6 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились со свойством flex-direction;
- научились создавать формы, поля ввода, текстовую область и кнопки;
- сделали секцию формы!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с языком программирования JavaScript;
- поработаем с библиотекой функций jQuery;
- научимся пользоваться плагинами;
- сделаем секцию галереи!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/16R3HvtKBnNQc0rlVofqlcivAnhDI68KB?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1w_b5iqlCqCtGipnml_-rpCsgH8MKoPjn?usp=sharing


Тест
https://docs.google.com/forms/d/e/1FAIpQLSdjmS3m3Zc6UDMit2fTEaRvw8U6RHayoJ15713qgvZ_lryqUQ/viewform


Сегодня у нас прошёл урок №7 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с языком программирования JavaScript;
- поработали с библиотекой функций jQuery;
- научились пользоваться плагинами;
- сделали секцию галереи!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- напишем свою первую строку кода на JavaScript;
- познакомимся с переменными и научимся ими пользоваться;
- познакомимся с событиями и функциями;
- запрограммируем смену цвета заголовка при нажатии на кнопку и увеличение логотипа!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1ASZDmwP7Bq3ix-WN08JQRo-4IqgMyF15?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1md8uf_m7Oug8QwbGQlWxI-qmeQQvlwAE?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebs_RlffLzfmKWb0u3HB0pYofBVszilAgNrRyqxRrHChW0KA/viewform

Сегодня у нас прошёл урок №8 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- написали свою первую строку кода на JavaScript;
- познакомились с переменными и научились ими пользоваться;
- познакомились с событиями и функциями;
- запрограммировали смену цвета заголовка при нажатии на кнопку и увеличение логотипа!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся со спецсимволами в HTML;
- научимся создавать модальное окно на странице;
- научимся отображать блоки с помощью display;
- сделаем всплывающую форму!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/13-EpRk7zVAdeQdq7GuIWMm69SL8F3CPV?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1TvJJspoMeFPOnZpn4Ebys2aK--9whN93?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSddjihmHXnHzyIZI92V6tNofIqMi69zy6RT8DzKVRDiM7g0JA/viewform

Сегодня у нас прошёл урок №9 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились со спецсимволами в HTML;
- научились создавать модальное окно на странице;
- научились отображать блоки с помощью display;
- сделали всплывающую форму!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как устроена анимация в веб-страницах и научимся создавать её;
- познакомимся с функцией setTimeout, анимируем появление формы;
- анимируем кнопку с помощью псевдоэлемента hover и CSS-свойства border-radius;
- создадим анимацию для логотипа и научимся её вызывать!`,
      '10 урок': `Заготовка
https://drive.google.com/drive/folders/10Xu7pEmbj38F9CTE2PJemgUXA4XLNO7G?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ouxjSji5vLAb6UJXzefdyrhCrcBTo0BN?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfzZhXFv9AGle5YnM_Cc0xYI_tLtQY5752sN9EB8nEtEXPDTw/viewform

Сегодня у нас прошёл урок №10 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- узнали, как устроена анимация в веб-страницах и научились создавать её;
- познакомились с функцией setTimeout, анимировали появление формы;
- анимировали кнопку с помощью псевдоэлемента hover и CSS-свойства border-radius;
- создали анимацию для логотипа и научились её вызывать!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- сделаем footer сайта;
- познакомимся с новыми значениями свойства justify-content;
- научимся делать кликабельное меню сайта;
- сделаем анимацию для меню!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1HtMP172HL4gSeRajw6Qe1cvsIVnewNEF?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1n24v2QpbteQzN45M5aNpwP9IB5lU5Kwk?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSexNrfuw0SWTE9_HEME4GmbUMUaNasF7c3xkYVXj0o_q_ABNQ/viewform

Сегодня у нас прошёл урок №11 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- сделали footer сайта;
- познакомились с новыми значениями свойства justify-content;
- научились делать кликабельное меню сайта;
- сделали анимацию для меню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое адаптивность сайта;
- адаптируем наш сайт под мобильные устройства!`,
      '12 урок': `Сегодня у нас прошёл урок №12 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- узнали, что такое адаптивность сайта;
- адаптировали наш сайт под мобильные устройства!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле HTML, CSS, JavaScript!
На уроке мы:
- добавим отправку формы на сайте;
- доработает сайт;
- подведём итоги модуля!`,
      '13 урок': `Сегодня у нас прошёл последний урок (№13) модуля HTML, CSS, JavaScript.
На нём мы с вами:
- добавили отправку формы на сайте;
- доработали сайт;
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - Python!
Python - это универсальный язык программирования, на котором пишут программы под все самые известные платформы: Mac OS, Windows, IOS, Android. На модуле мы изучим основы языка программирования Python, создадим игры "Камень, ножницы бумага" и "Арканоид". А также сделаем голосовой помощник, который будет распознавать нашу речь и отвечать нам голосом, а также открывать файлы и ссылки и даже советовать фильмы!
На следующем уроке мы:
- познакомимся с языком программирования Python;
- узнаем об основных понятиях в программировании;
- познакомимся с встроенной функцией print();
- научимся объявлять переменные в Python и работать с ними;
- научимся работать с IDLE!

К следующему занятию, пожалуйста, установите на свой компьютер Python! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Python:
https://docs.google.com/document/d/11Po6XmHRquu7W8Cg3dySumNkM-4pu2v7V1PNMeeqT7w/edit?usp=sharing`
    },
    'Python': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1zjTJX60y7XHrlcyoqm3orKYwLn_t81R5?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdinIDQGuBxVS-fn-qWz_yIeJrH73vFQTDRns9AxkZSMdu5lA/viewform


Сегодня у нас прошёл урок №1 модуля Python.
На нём мы с вами:
- познакомились с языком программирования Python;
- узнали об основных понятиях в программировании;
- познакомились с встроенной функцией print();
- научились объявлять переменные в Python и работать с ними;
- научились работать с IDLE!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся пользоваться встроенной функцией input();
- познакомимся с операторами сравнения в Python;
- познакомимся с типом данных bool;
- научимся пользоваться условными конструкциями;
- научимся приведению типа;
- напишем свою первую программу!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1xqfuNm2uw-BQ560PBP5vw07oHOu7tI-r?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1Lp4wjclmy_voLe3K6dkQsMTWkKJLCXY3?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdtqlw74pCRg0JS-zCteoIu1XMDtNbCR7czv7z3jHG_M-_WZg/viewform


Сегодня у нас прошёл урок №2 модуля Python.
На нём мы с вами:
- научились пользоваться встроенной функцией input();
- познакомились с операторами сравнения в Python;
- познакомились с типом данных bool;
- научились пользоваться условными конструкциями;
- научились приведению типа;
- написали свою первую программу!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся пользоваться списками в Python;
- познакомимся с модулями в Python;
- научимся применять модуль random;
- научимся приводить строки к верхнему и нижнему регистру с помощью методов upper() и lower();
- познакомимся с циклом while, создадим бесконечный цикл и научимся его прерывать!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1Fmm2mg2TNixbJiTD0zN97nuNh7PYCdxO?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/10Iewbxu8vIj4LjmE46MUP1iSXQOsatWx?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebPjMA-WlYEx5QGHON3_KxttFW6sf1tGONYMuZqA-ocwiGSg/viewform

Сегодня у нас прошёл урок №3 модуля Python.
На нём мы с вами:
- научились пользоваться списками в Python;
- познакомились с модулями в Python;
- научились применять модуль random;
- научились приводить строки к верхнему и нижнему регистру с помощью методов upper() и lower();
- познакомились с циклом while, создали бесконечный цикл и научились его прерывать!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- актуализируем знания, полученные на предыдущих уроках;
- создадим игру "Камень, ножницы, бумага"!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1Lzsery_FeJ2J9jGGw67Q7HtLfIfgq7ND?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1WwoLK_7BzWFxpxdbPilATXhuU1XPqNmb?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScUus07wDKMfvOO5QkiKEc5pGPH1difm4p8_J1w3mSNFz9ydA/viewform

Сегодня у нас прошёл урок №4 модуля Python.
На нём мы с вами:
- актуализировали знания, полученные на предыдущих уроках;
- создали игру "Камень, ножницы, бумага"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с функциями в Python;
- научимся создавать функции;
- научимся пользоваться аргументами функции;
- научимся возвращать из функции значение с помощью оператора return!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/19u8XsmVPg9YXSa7ed3SXmOdRlPIdfqrq?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1mG0lpLqHwewtNSrT1SiF4nMe7PM48z3y?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScGRcBNvfnTkZVELoML9AG6k489WiD38EL-n7hMgKX3qdUsgg/viewform


Сегодня у нас прошёл урок №5 модуля Python.
На нём мы с вами:
- познакомились с функциями в Python;
- научились создавать функции;
- научились пользоваться аргументами функции;
- научились возвращать из функции значение с помощью оператора return!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с модулем tkinter и научимся им пользоваться;
- научимся создавать кнопки и программировать их;
- узнаем, что такое canvas и научимся на нём рисовать с помощью кода;
- научимся перемещать нарисованные фигуры по canvas;
- научимся делать покадровую анимацию с помощью цикла while!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1ruTqBNvG1nmhgRvJQshMhUuH7DkEwisI?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1AEm-Ac-cgH4LWJENNStPOX7W48wR8I8i?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeeXiefVN5tt97KEi3XA1OJJ_3q1qRiSecqbimp-pOFD2fQ6w/viewform

Сегодня у нас прошёл урок №6 модуля Python.
На нём мы с вами:
- познакомились с модулем tkinter и научились им пользоваться;
- научились создавать кнопки и программировать их;
- узнали, что такое canvas и научились на нём рисовать с помощью кода;
- научились перемещать нарисованные фигуры по canvas;
- научились делать покадровую анимацию с помощью цикла while!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с объектно-ориентированным программированием;
- познакомимся с классами в Python;
- научимся создавать и применять методы классов;
- научимся создавать объекты класса и применять к ним методы;
- познакомимся с наследованием классов!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1ONpWRhEVIRkZ6aS5LO0tGAOXE2gpseHI?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1l48pPa99hMicqLq3cXytZxzgs5xDKtaY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfIVpuxGkluWtRdyRKGBU4CVSXW6FF1jPKYd45-lUJD8aBKdA/viewform

Сегодня у нас прошёл урок №7 модуля Python.
На нём мы с вами:
- познакомились с объектно-ориентированным программированием;
- познакомились с классами в Python;
- научились создавать и применять методы классов;
- научились создавать объекты класса и применять к ним методы;
- познакомились с наследованием классов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с псевдокодом будущей игры "Арканоид";
- создадим холст для игры с помощью tkinter;
- создадим мяч на холсте;
- заставим мяч двигаться вверх с помощью цикла while;
- сделаем 30% игры!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1vlX9WwGdph6rQ_oBEtEeTDoaBquhPfky?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1LU-Q5GpvXP-9j3zBadIE7svljJv0CrIL?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe1aO44lbHbBiN-tHzW1DWQI5MQyI4xqW_rtPVnCc60hlYLtQ/viewform


Сегодня у нас прошёл урок №8 модуля Python.
На нём мы с вами:
- познакомились с псевдокодом будущей игры "Арканоид";
- создали холст для игры с помощью tkinter;
- создали мяч на холсте;
- заставили мяч двигаться вверх с помощью цикла while;
- сделали 30% игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- глубже познакомимся с координатами в canvas;
- запрограммируем отскоки мяча от краёв холста;
- зададим мячу случайное движение с помощью списка и модуля random;
- создадим платформу и отобразим её в нужной части холста;
- сделаем ещё 30% игры!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/1BCnSP9SHZCBIx4_0y3T5EtCJ_9Of4Sow?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ntBk2xZiW5ZePXWQVc7NbkamuTGEC_6-?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScMvyR_lQthx1G2w6wkRug_oY9gfBwKr1SBBS1CQeFXIDNHhg/viewform

Сегодня у нас прошёл урок №9 модуля Python.
На нём мы с вами:
- глубже познакомились с координатами в canvas;
- запрограммировали отскоки мяча от краёв холста;
- задали мячу случайное движение с помощью списка и модуля random;
- создали платформу и отобразили её в нужной части холста;
- сделали ещё 30% игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся привязывать методы к нажатию клавиш на клавиатуре;
- запрограммируем отскоки мяча от платформы;
- реализуем окончание игры при достижении мячом дна;
- закончим игру "Арканоид"!`,
      '10 урок': `Заготовка
https://drive.google.com/drive/folders/1_fUY0xeXmwycrCTmMICufM_ey2KTHFdb?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1LOhzbzgXRykxeaXMP3e07U3mRnMslSs9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScPXBubfytkVlHSsT7IcJ6rqTxSjNAjBDr0xiCv0UuCazNJAA/viewform

Сегодня у нас прошёл урок №10 модуля Python.
На нём мы с вами:
- научились привязывать методы к нажатию клавиш на клавиатуре;
- запрограммировали отскоки мяча от платформы;
- реализовали окончание игры при достижении мячом дна;
- закончили игру "Арканоид"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся устанавливать нестандартные модули в Python;
- познакомимся с модулем speech_recognition и научимся распознавать речь;
- познакомимся с ключевыми словами with и as и научимся их применять;
- сделаем половину голосового помощника!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1yKa3-Dk2PZVI07hJjzbkoos3f-yk1W-h?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1fTJbMGA7reJmHFaMyhuE0EEdmjx3scIZ?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdGSXi0h1fLDqi2T4bJ9I3vfa8kVvYAg63myOWONGR5QvKygA/viewform

Сегодня у нас прошёл урок №11 модуля Python.
На нём мы с вами:
- научились устанавливать нестандартные модули в Python;
- познакомились с модулем speech_recognition и научились распознавать речь;
- познакомились с ключевыми словами with и as и научились их применять;
- сделали половину голосового помощника!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся открывать файлы с помощью модуля os;
- познакомимся с ключевым словом in и научим помощника реагировать на длинные предложения по ключевому слову;
- научим помощника общаться голосом с помощью модуля pyttsx3;
- доработаем голосового помощника и закончим его!`,
      '12 урок': `Заготовка
https://drive.google.com/drive/folders/1Z_i0Bf9f-yZyGrm6altiaXhmPurjGIpr?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1FmekPlsPtlrt-bGL_Wc9yg1kuGDSZ9Jo?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScZXoyqegPv7ztiDBsSJFf3hNxL1jCJJUmrryEAEem4qcmhhw/viewform

Сегодня у нас прошёл урок №12 модуля Python.
На нём мы с вами:
- научились открывать файлы с помощью модуля os;
- познакомились с ключевым словом in и научили помощника реагировать на длинные предложения по ключевому слову;
- научили помощника общаться голосом с помощью модуля pyttsx3;
- доработали голосового помощника и закончили его!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим цикл while;
- узнаем, как работает цикл for и научимся его использовать;
- познакомимся со словарями!`,
      '13 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSd5IjM3MqJ7gU-1FGIW7YULK7jlZz2f5dfZI4Q6G8b6R_1Kng/viewform

Сегодня у нас прошёл урок №13 модуля Python.
На нём мы с вами:
- повторили цикл while;
- узнали, как работает цикл for и научились его использовать;
- познакомились со словарями!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся подключать модули;
- создадим основу для чат-бота, которая отвечает на сообщения "привет" и "пока"!`,
      '14 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSf-pMrKYk4cVX8s2vpErmzrKrP2rsF2r1SScC5TyZwh84Nf8Q/viewform

Сегодня у нас прошёл урок №14 модуля Python.
На нём мы с вами:
- научились подключать модули;
- создали основу для чат-бота, которая отвечает на сообщения "привет" и "пока"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся делать случайную паузу перед отправкой сообщения;
- научимся искать нужные слова в сообщении;
- научимся группировать условия с помощью логических операторов!`,
      '15 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSe2uN-EMw8ZeWIWIkm1_x8Y3Nr7auAvjbEFQNnT_YlM6FRKHw/viewform


Сегодня у нас прошёл урок №15 модуля Python.
На нём мы с вами:
- научились делать случайную паузу перед отправкой сообщения;
- научились искать нужные слова в сообщении;
- научились группировать условия с помощью логических операторов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научим бота отправлять стикеры, изображения и музыку!`,
      '16 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSeTvjpMP6lBWZlzgO1itjXDZMeU4l1D_yoNZroc5I1OZ-DS0g/viewform

Сегодня у нас прошёл урок №16 модуля Python.
На нём мы с вами:
- научили бота отправлять стикеры, изображения и музыку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое кортежи и научимся их использовать;
- научимся применять рандомный ответ из кортежа для разных функций бота;
- создадим функцию отправки случайного мема!`,
      '17 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSc1JOL0fqPiSPZFlPeOUaVXq-83Cdv3ekbXgdmuXV4ZiojPEw/viewform

Сегодня у нас прошёл урок №17 модуля Python.
На нём мы с вами:
- узнали, что такое кортежи и научились их использовать;
- научились применять рандомный ответ из кортежа для разных функций бота;
- создали функцию отправки случайного мема!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Python!
На уроке мы:
- создадим функцию выбора фильма для просмотра;
- доработаем функционал бота!`,
      '18 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSeTvjpMP6lBWZlzgO1itjXDZMeU4l1D_yoNZroc5I1OZ-DS0g/viewform

Сегодня у нас прошёл последний урок (№18) модуля Python.
На нём мы с вами:
- создали функцию выбора фильма для просмотра;
- доработали функционал бота!

Все ребята молодцы, отлично справились с заданиями!`
    },
    'Godot': {
      '1 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №1 модуля Godot. На нём мы с вами:
- познакомились с игровым движком Godot;
- изучили интерфейс программы;
- создали персонажа и добавили ему скрипт;
- научили персонажа двигаться!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- познакомимся с построением уровней в Godot;
- создадим свой первый уровень!`,
      '2 урок': `Готовый проект
Тест
Заготовка


Сегодня у нас прошёл урок №2 модуля Godot. На нём мы с вами:
- познакомились с картой тайлов и научились строить уровни с её помощью;
- узнали, что такое Z-индекс и как он влияет на отображение объектов;
- познакомились с понятием переменной в программировании;
- создали интересный уровень для нашего игрока!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим анимации нашему персонажу;
- научим игрока собирать монетки!`,
      '3 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №3 модуля Godot. На нём мы с вами:
- узнали, чем отличаются узлы Sprite2D и AnimatedSprite2D;
- познакомились с узлом Area2D и узнали, за что он отвечает;
- узнали, что такое функция и что такое сигнал;
- запрограммировали сбор монеток игроком;
- поработали с анимациями персонажа!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- запрограммируем поражение в нашей игре;
- добавим ловушки!`,
      '4 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №4 модуля Godot. На нём мы с вами:
- узнали, что такое ссылка в Godot и как её использовать;
- познакомились с командой await и разобрались, за что она отвечает;
- научились воспроизводить звуки прямо в игре;
- добавили звуки в наш проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим сцену победы в нашу игру;
- поработаем с пользовательским интерфейсом!`,
      '5 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №5 модуля Godot. На нём мы с вами:
- познакомились с пользовательским интерфейсом в Godot;
- узнали, за что отвечает узел Control;
- узнали, какой узел отвечает за отображение текста в игре;
- добавили кнопки в наш проект;
- узнали, какая команда позволяет изменить сцену в игре!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- узнаем, что такое примитивы и как они используются в 3D;
- построим свой первый 3D-уровень!`,
      '6 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №6 модуля Godot. На нём мы с вами:
- узнали, что такое примитивы и как они используются в 3D;
- познакомились с функцией Process и разобрались, что она делает;
- узнали, как работает команда Delta;
- построили свой первый 3D-уровень!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- завершим наш 3D-проект;
- добавим интерфейс и условия победы!`,
      '7 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №7 модуля Godot. На нём мы с вами:
- добавили счётчик собранных сокровищ;
- узнали, что такое функция str() и как она работает;
- разобрались, что позволяет делать команда get_parent();
- познакомились с условиями в программировании;
- завершили наш 3D-проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
Начнем разработку нового проекта - Тир!`,
      '8 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №8 модуля Godot. На нём мы с вами:
- узнали, что такое RigidBody и как работает физика в Godot;
- познакомились с узлом RayCast;
- узнали, что такое группы в Godot;
- добавили мишень в группу Targets!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- научимся создавать объекты во время игры;
- заставим мишени появляться в случайных местах!`,
      '9 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №9 модуля Godot. На нём мы с вами:
- узнали, что такое preload в Godot;
- познакомились с командой instantiate;
- изучили операцию сравнения;
- научились создавать мишени во время игры!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим в игру таймер;
- создадим счётчик сбитых мишеней;
- посоревнуемся в меткости!`,
      '10 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №10 модуля Godot. На нём мы с вами:
- узнали, что такое таймер и как с ним работать;
- познакомились с сигналом timeout;
- научились настраивать и программировать таймер;
- добавили в игру счётчик сбитых мишеней и таймер!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- увеличим количество мишеней;
- усложним нашу игру и сделаем её ещё интереснее!`,
      '11 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №11 модуля Godot. На нём мы с вами:
- познакомились с темой «Циклы»;
- изучили работу цикла for;
- познакомились с операцией деления с остатком;
- добавили новые усложнения в нашу игру!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- начнём разработку нового проекта «Арена»;
- создадим основу для будущей игры!`,
      '12 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №12 модуля Godot. На нём мы с вами:
- познакомились с сеткой навигации NavigationMesh;
- узнали, для чего нужен узел NavigationAgent3D;
- познакомились с функцией _physics_process();
- научили врагов двигаться за игроком!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим оружие игроку;
- сделаем сражения с врагами ещё интереснее!`,
      '13 урок': `Готовый проект
Тест
Заготовка
Сегодня у нас прошёл урок №13 модуля Godot. На нём мы с вами:
- познакомились с системой стрельбы в Godot;
- вспомнили, как работает Area3D;
- создали собственную пулю;
- познакомились с узлом MeshInstance3D;
- научили игрока стрелять!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим здоровье игроку;
- научим врагов атаковать;
- сделаем игровой процесс ещё интереснее и динамичнее!`,
      '14 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №14 модуля Godot. На нём мы с вами:

- добавили здоровье врагам;
- научили врагов атаковать игрока;
- познакомились с работой таймера;

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:

- добавим возможность побеждать врагов;
- создадим счётчик побеждённых врагов на экране;`
    }
  },
  'High': {
    'Scratch': {
      '1 урок': `Заготовка
https://drive.google.com/file/d/1LJyttuN9m6-XIw3OQ3CvR9Dvhyr7Mymu/view?usp=sharing 

Готовый проект
https://drive.google.com/file/d/1MUg6pNZol79VPPSexbFcXdz4oq8lk2cB/view?usp=sharing 

Тест
docs.google.com/forms/d/1A1j4W2FUpEhZLBuGzWaiFDzn_wFhqg1KdBKWzjDcbg4/edit?usp=sharing


Поздравляю всех с завершением 1-го урока курса и посвящением в программисты!
Сегодня мы с вами:
- познакомились  с интерфейсом среды и основами работы в Scratch;
- научились работать с разными блоками;
- научились управлять персонажем с помощью компьютерной мышки;
- узнали, что такое "переменные" и научились с ними работать;
- создали игру «Brawler's Search»!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "координаты" и "циклы";
- научимся использовать различные виды циклов в программе;
- создадим игру "В поисках Мэйбл"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1mPoH9pCItzMqkfpNYTM_WEF_zi_qHql1?usp=drive_link
Готовый проект
https://drive.google.com/file/d/1at4Mu4nsvyXVU4pvbkh7JQoS02YsTHye/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdLIkeR6L6OwMjZFys449S-0nHhSSidn4uxrYLzCtGwA5-iAA/viewform?usp=dialog


Сегодня у нас прошёл урок №2 модуля Scratch.
На нём мы с вами:
- узнали, что такое "координаты" и "циклы";
- научились использовать различные виды циклов в программе;
- создали игру "В поисках Мэйбл"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся задавать направление спрайту;
- познакомимся с командами для работы с клонами в Scratch;
- попрактикуемся в использовании условных блоков и циклов;
- создадим игру «Atari Breakout»!`,
      '3 урок': `Заготовка 
https://drive.google.com/drive/folders/1FXs37IubLz-cONtmdQX8cgli5SLDup8L?usp=drive_link
Готовый проект
https://drive.google.com/file/d/1TifLRseuKDpefcBVwl5Vd06txX16Y3NQ/view?usp=drive_link

Тест
docs.google.com/forms/d/1DQ-bxvDEvw4OL7HPmMmLVnoh-bl8ttE99cRITRs4Px8/edit?usp=sharing


Сегодня у нас прошёл урок №3 модуля Scratch.
На нём мы с вами:
- научились задавать направление спрайту;
- познакомились с командами для работы с клонами в Scratch;
- попрактиковались в использовании условных блоков и циклов;
- создали игру «Atari Breakout»!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся пользоваться командами из группы "Перо";
- познакомимся с передачей сообщений;
- сделаем проект "Гибкий человек"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1LfqnjjSDlBXzZMb5dvEonViQxGu3Hq7Y/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1NuKQwnavT3h8D_XMKr1lmjdJgesPaLa2/view?usp=sharing

Тест
docs.google.com/forms/d/1-Qu-6RmCEvTpi0nNRvnEYiujcpUJrnSU_2k5Zj7SvnU/edit?usp=sharing


Сегодня у нас прошёл урок №4 модуля Scratch.
На нём мы с вами:
- научились пользоваться командами из группы "Перо";
- познакомились с передачей сообщений;
- сделали проект "Гибкий человек"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с понятием "функция" (подпрограмма);
- научимся делать свою программу проще и короче с помощью функций;
- научимся работать с пользовательскими блоками;
- создадим игру "Flappy Bird"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1jdkZFm0kLTnuqdzFjZlQB-H1UNiX5jBc/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1TFwNk1pIgticSY0eZTqj-319H5s0E_-V/view?usp=sharing

Тест
docs.google.com/forms/d/1PL6HT9Iv9-rRRi2RG-7X3k32KoWkyOSz04E7uiGW9y4/edit?usp=sharing

Сегодня у нас прошёл урок №5 модуля Scratch.
На нём мы с вами:
- познакомились с понятием "функция" (подпрограмма);
- научились делать свою программу проще и короче с помощью функций;
- научились работать с пользовательскими блоками;
- создали игру "Flappy Bird"!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Scratch!
На уроке мы:
- познакомимся со списками;
- научимся создавать и удалять элементы списков;
- создадим игру "Летнее Кафе"!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1e5lJwOf989BzEZVcdmp0RBqZNDdXZgrc/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1VLYCPRZsLYltbF9z0otU9hGIQ4gaAbxB/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScF6WeCy7SOS4h6ISVsQ2BrIRYpBp3uhUwTKx8pWoD0kQZZHQ/viewform

Сегодня у нас прошёл последний урок (№6) модуля Scratch.
На нём мы с вами:
- познакомились со списками;
- научились создавать и удалять элементы списков;
- создали игру "Летнее Кафе"!

А уже на следующем уроке у нас начнётся новый модуль - App Inventor. В этой среде мы будем создавать приложения и игры для смартфонов и планшетов. В течение модуля мы сделаем несколько приложений и игр, которые можно будет тестировать прямо на вашем телефоне!
На следующем уроке мы:
- познакомимся с интерфейсом и основами работы в App Inventor;
- научимся создавать дизайн для приложения;
- научимся составлять скрипты для компонентов;
- создадим приложение "Drum Machine"!

К следующему занятию, пожалуйста, установите приложение для тестирования на свой телефон или эмулятор на компьютер! Напоминаю, что за самостоятельную подготовку ПО я награждаю 10 КодКойнами! 
Инструкция по установке программ для тестирования приложений из App Inventor:
https://docs.google.com/document/d/1Pdy40qSRQizRGB8G_L1zjLunNWSJsZpyLtSn8B7mIZY/edit?usp=sharing`
    },
    'Thunkable': {
      '1 урок': `Сегодня у нас прошёл урок №1 модуля Thunkable.
На нём мы с вами:
- познакомились с интерфейсом и основами работы с блоками в Thunkable;
- научились разрабатывать дизайн для приложения;
- научились создавать скрипты для кнопок;
- создали приложение «Ударная установка»!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с координатами в Thunkable;
- познакомимся с новым компонентом Canvas (холст);
- научимся работать со спрайтами;
- напишем первые скрипты для спрайтов;
- сделаем игру "В погоне за жёлудем"!`,
      '2 урок': `Сегодня у нас прошёл урок №2 модуля Thunkable.
На нём мы с вами:
- познакомились с координатами в Thunkable;
- познакомились с новым компонентом Canvas (холст);
- научились работать со спрайтами;
- написали первые скрипты для спрайтов;
- сделали игру "В погоне за жёлудем"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое случайное число;
- научимся переключаться между экранами;
- узнаем, что такое "условие";
- сделаем игру "Путешествие ракеты"!`,
      '3 урок': `Сегодня у нас прошёл урок №3 модуля Thunkable.
На нём мы с вами:
- узнали, что такое случайное число;
- научились переключаться между экранами;
- узнали, что такое "условие";
- сделали игру "Путешествие ракеты"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем перемещение спрайта в случайные координаты;
- познакомимся с таймером;
- познакомимся с операторами;
- сделаем игру "Поймай крота"!`,
      '4 урок': `Сегодня у нас прошёл урок №4 модуля Thunkable.
На нём мы с вами:
- запрограммировали перемещение спрайта в случайные координаты;
- познакомились с таймером;
- познакомились с операторами;
- сделали игру "Поймай крота"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать переменные в Thunkable;
- познакомимся с блоком If-Else;
- начнём делать игру "Скоростная сортировка"!`,
      '5 урок': `Сегодня у нас прошёл урок №5 модуля Thunkable.
На нём мы с вами:
- узнали, как создавать переменные в Thunkable;
- познакомились с блоком If-Else;
- начали делать игру "Скоростная сортировка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем экран победы на вывод времени;
- добавим и запрограммировали кнопки перезапуска;
- познакомимся с функциями;
- закончим игру "Скоростная сортировка"!`,
      '6 урок': `Сегодня у нас прошёл урок №6 модуля Thunkable.
На нём мы с вами:
- запрограммировали экран победы на вывод времени;
- добавили и запрограммировали кнопки перезапуска;
- познакомились с функциями;
- закончили игру "Скоростная сортировка"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом Text Input;
- узнаем что такое "база данных", научились их создавать и использовать;
- научимся использовать возможности перевода и озвучки текста в Thunkable;
- сделаем приложение — переводчик!`,
      '7 урок': `Сегодня у нас прошёл урок №7 модуля Thunkable.
На нём мы с вами:
- познакомились с компонентом Text Input;
- узнали, что такое "база данных", научились их создавать и использовать;
- научились использовать возможности перевода и озвучки текста в Thunkable;
- сделали приложение — переводчик!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- будем работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Thunkable.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле High Thunkable!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Thunkable.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Stencyl!
Stencyl - это профессиональный движок для разработки игр. На модуле мы сделаем несколько 2D-игр: "Лабиринт", "Инопланетное нашествие", платформер с несколькими уровнями. А также вы создадите собственный проект!
На следующем уроке мы:
- познакомились с программой Stencyl;
- узнали, что такое "атрибуты" и "поведения" в Stencyl;
- научились писать программы в Stencyl;
- сделали игру "Джунгли"!

К следующему занятию, пожалуйста, установите Stencyl на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Stencyl:
https://docs.google.com/document/d/172oKcMRGu_PFjh9FoHHONhqhowStbfqQlxrWLovPGAw/edit?usp=sharing`
    },
    'App Inventor': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1MNDzgVFgAwvGzzrcVt_o044sZyrsQHSu?usp=sharing

Готовый проект
https://drive.google.com/file/d/1x96cfq24ljUh7TxQanUVkFMUDkFFlOfG/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf_aW2CK7jqrCWL61BiPMgDqsG6p0VPvPxFH5heCqHni9Jorg/viewform

Сегодня у нас прошёл урок №1 модуля App Inventor.
На нём мы с вами:
- познакомились с интерфейсом и основами работы в App Inventor;
- научились создавать дизайн для приложения;
- научились составлять скрипты для компонентов;
- создали приложение "Drum Machine"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом "Холст" и научимся на нем рисовать разными цветами;
- узнаем, что такое "локальная переменная";
- узнаем, что такое "координаты";
- начнем создавать приложение "Рисовалка"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1zAfjdtPVaqOSqND05ygJmACSAOyBpWaU?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LgsnKoAiGMxD-onFcNpEveW1zPGn_MsF/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeA9lRGliR1gYDO1SNLhoHTMGTjn9IueNYzg96vjZqkSEBxCg/viewform

Сегодня у нас прошёл урок №2 модуля App Inventor.
На нём мы с вами:
- познакомились с компонентом "Холст" и научились на нем рисовать разными цветами;
- узнали, что такое "локальная переменная";
- узнали, что такое "координаты";
- начали создавать приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с группой блоков "Математика", со случайным числом;
- повторим, что такое циклы и условные блоки;
- познакомимся с циклом "для";
- закончим приложение "Рисовалка"!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1zHHfXCdIxYEG_W05VD78idrcNvmMZSqD?usp=sharing

Готовый проект
https://drive.google.com/file/d/1zNZ6SE7EVelDyASeqogZtHMomrdOYexb/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSepOdOQm8JltOzIrf8XKGu51RpIsi4T7k90SF4323Bs0GyfYQ/viewform

Сегодня у нас прошёл урок №3 модуля App Inventor.
На нём мы с вами:
- познакомились с группой блоков "Математика", со случайным числом;
- повторили, что такое циклы и условные блоки;
- познакомились с циклом "для";
- закончили приложение "Рисовалка"!

Все ребята молодцы, отлично справились с заданиями!

Дорогие родители, внимание!
На следующей неделе урок будет проходить в ИНДИВИДУАЛЬНОМ ФОРМАТЕ! 
На уроке:
- дети познакомятся с нейросетью DeepSeek
- узнают, что такое промпт
- сделают собственное мини-приложение при помощи нейросети
Наш эксперт познакомит Вас и Вашего ребенка с миром нейросетей 🙂

В ближайшие дни с нами свяжется наш менеджер для назначения времени занятия по телефону либо в мессенджере.
Обратите, пожалуйста, внимание - участие родителя обязательно, поэтому выбирайте время урока, когда будете дома.

На следующем уроке мы:
- узнаем, что такое "процедура";
- познакомимся с компонентами "Шар" и "Изображение спрайта";
- научимся анимировать спрайты;
- познакомимся с блоками "истина" и "ложь";
- создадим игру "Мини-гольф"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1rqhfcL2KBtgHnQ3B05BystfkO3yMQ3qD/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1-Ge_DRGqKYm7Zufe2u2envq3T9e4aJEs/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdMpxUYD3yj3Jszs5d-THDb67JKFCnJxlVWKRbs18Yszf14Jw/viewform

Сегодня у нас прошёл урок №4 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "процедура";
- познакомились с компонентами "Шар" и "Изображение спрайта";
- научились анимировать спрайты;
- познакомились с блоками "истина" и "ложь";
- создали игру "Мини-гольф"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "глобальная переменная";
- познакомимся с логическими операторами;
- повторим "координаты" и "процедуры";
- создадим игру "Тачки"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1OSB2T2kKRj2bhXn-nNEphbNnkTEQBm-R/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Ku4VaZMkak5h7Rm5DTIz5ABMSAD95scy/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeCx1zgAqYKG6iWapS4_52CWTilMjjoxndS1L9ZsgqDmBLUgA/viewform
Сегодня у нас прошёл урок №5 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "глобальная переменная";
- познакомились с логическими операторами;
- повторили "координаты" и "процедуры";
- создали игру "Тачки"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое "списки";
- познакомимся с новыми компонентами: "распознаватель речи" и "текст в речь";
- создадим приложение "Speak It!"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1Tvws5zGsZJctbb8JK3G5_kqA2_kbKzcZ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1UmZePz08om7F32P76bzi9oegZGIjaycJ/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfTyz8p2H3VWVnSJvEwTNm3BBhMp6v8dtFovmPCfnmZSQJUhw/viewform

Сегодня у нас прошёл урок №6 модуля App Inventor.
На нём мы с вами:
- узнали, что такое "списки";
- познакомились с новыми компонентами: "распознаватель речи" и "текст в речь";
- создали приложение "Speak It!"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять несколько экранов в приложение;
- узнаем, как программировать переходы между экранами;
- создадим игру "Охота на зомби"!`,
      '7 урок': `Заготовка
https://drive.google.com/file/d/14oyjwfvH-xts-hBAggUqMy8KqC-bzzkh/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/17-ANZxi_Pk0ydXAmgNKdoDfsHmwBN_28/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSek2YhIfE1Ur-cHcnSMlnlIqt9BaGGmCKhccguBexbJWAgVAw/viewform

Сегодня у нас прошёл урок №7 модуля App Inventor.
На нём мы с вами:
- научились добавлять несколько экранов в приложение;
- узнали, как программировать переходы между экранами;
- создали игру "Охота на зомби"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля App Inventor.
На нём мы с вами:
- работали над собственным проектом!


Все ребята молодцы, придумали очень интересные проекты!

Следующий урок будет последним на модуле High App Inventor!
На уроке мы:
- защитим проекты;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля High App Inventor.
На нём мы с вами:
- защитили проекты;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Stencyl!
Stencyl - это профессиональный движок для разработки игр. На модуле мы сделаем несколько 2D-игр: "Лабиринт", "Инопланетное нашествие", платформер с несколькими уровнями. А также вы создадите собственный проект!
На следующем уроке мы:
- познакомся с программой Stencyl;
- узнаем, что такое "атрибуты" и "поведения" в Stencyl;
- научимся писать программы в Stencyl;
- создадим игру "Джунгли"!

К следующему занятию, пожалуйста, установите Stencyl на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Stencyl:
https://docs.google.com/document/d/172oKcMRGu_PFjh9FoHHONhqhowStbfqQlxrWLovPGAw/edit?usp=sharing`
    },
    'Stencyl': {
      '1 урок': `Готовый проект
https://drive.google.com/file/d/13Ll4QATOB-Hgx_MPpBIhGkWigvheso_N/view?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLScAKqxftVI6GAPt6ndI2_I2GmogK8WTi7eD5mJEHg46axkJEA/viewform?usp=send_form

Сегодня у нас прошёл урок №1 модуля Stencyl.
На нём мы с вами:
- познакомились с программой Stencyl;
- узнали, что такое "атрибуты" и "поведения" в Stencyl;
- научились писать программы в Stencyl;
- сделали игру "Джунгли"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с арифметическими операторами и оператором сложения текста;
- познакомимся с атрибутами игры и простыми атрибутами;
- создадим игру "Лабиринт"!`,
      '2 урок': `Заготовка
https://drive.google.com/file/d/1OHs7HUF8Q1K396LntB9jASlDDW6ZDlLW/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1piKFraFzLUskqDPtH5nRgl3FUSek76qM/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe6QDmK6vkOimng57I1co9-I35ZplYT3SlimFS4DedCbb6r1w/viewform


Сегодня у нас прошёл урок №2 модуля Stencyl.
На нём мы с вами:
- познакомились с арифметическими операторами и оператором сложения текста;
- познакомились с атрибутами игры и простыми атрибутами;
- создали игру "Лабиринт"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с операторами сравнения;
- познакомимся с системой координат в Stencyl;
- познакомимся с новыми поведениями "Выстрел" и "Нажатие на кнопку";
- создадим игру "Инопланетное нашествие"!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1eaLAw8LS5etrHPgrBIUln8HQ2YXAwCSk/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1viqivwT4XE1_gNeqOq6xeSlKrQd3qr1A/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfa2UQFSZLdkIG6eucB-pcszXDPjkWcU2CNWq7sUTWaDY68bw/viewform


Сегодня у нас прошёл урок №3 модуля Stencyl.
На нём мы с вами:
- познакомились с операторами сравнения;
- познакомились с системой координат в Stencyl;
- познакомились с новыми поведениями "Выстрел" и "Нажатие на кнопку";
- создали игру "Инопланетное нашествие"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как перемещаться по системе координат;
- научимся создавать уровни в игре;
- научимся программировать переход на новую сцену;
- создадим игру "Падающий блок"!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/1ZClpP5MBPRgTZenTzYxHFZ0Yx5EQPmjP/view?usp=sharing


Готовый проект
https://drive.google.com/file/d/12InM6Om9lFhN9D8o8ApRY28QjEZ0Ca5x/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfyWeC-3ttnRB9NjebpNjpyum6vRq26IqiolnV_Bhjyq2dWpw/viewform


Сегодня у нас прошёл урок №4 модуля Stencyl.
На нём мы с вами:
- узнали, как перемещаться по системе координат;
- научились создавать уровни в игре;
- научились программировать переход на новую сцену;
- создали игру "Падающий блок"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с новой командой для смены сцены;
- узнаем об анимации объектов и блоке "переключить анимацию";
- запрограммируем ключи для открывания двери;
- начнём создавать игру "Подземелье"!`,
      '5 урок': `Заготовка
https://drive.google.com/file/d/1WT1J6V8Ov7JYZKumIliGEAx0wPmczqkv/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1Ly8TZWOP3hXYGOIlb_KjPPbXZU-dLf0Z/view?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLScLN1dz8HaamlxNQZoD2zBBK7Iiz6GDXt3O831Dr2wO2T6oQQ/viewform?usp=send_form


Сегодня у нас прошёл урок №5 модуля Stencyl.
На нём мы с вами:
- познакомились с новой командой для смены сцены;
- узнали об анимации объектов и блоке "переключить анимацию";
- запрограммировали ключи для открывания двери;
- начали создавать игру "Подземелье"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем препятствия в игре;
- научимся перезапускать уровень при смерти персонажа;
- запрограммируем проигрыш в игре;
- продолжим создавать игру "Подземелье"!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1l7FPqaxEdcUx4zbrAw-tLQ_NqF_km1nB/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1oqSF2Z_yBAkuX5WFRNFZeCDZ_peIBjMs/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd37VRRWBP4AS5heaYFRJacWIsBwyzG_btDGMZ9xlrt93lqag/viewform


Сегодня у нас прошёл урок №6 модуля Stencyl.
На нём мы с вами:
- запрограммировали препятствия в игре;
- научились перезапускать уровень при смерти персонажа;
- запрограммировали проигрыш в игре;
- продолжили создавать игру "Подземелье"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать собственных актёров;
- создадим меню игры и анимацию наведения курсора на кнопки;
- продолжим создавать игру "Подземелье"!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1LqFNEhSBticTIPLqQt8HGfiA9TZjBQtD?usp=sharing

Готовый проект
https://drive.google.com/file/d/1ZdrBw4SqwdixCi2-v-X3Uyt3Xe575OVS/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSemFER3loflZklpuOK4hXLN5wEkW4k7xgcMMIV0xNzaidI9xw/viewform

Сегодня у нас прошёл урок №7 модуля Stencyl.
На нём мы с вами:
- научились создавать собственных актёров;
- создали меню игры и анимацию наведения курсора на кнопки;
- продолжили создавать игру "Подземелье"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять звуки в игру;
- закончим игру "Подземелье";
- начнём работать над собственным проектом!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1u65ZOn1zWuFtWqWHf8eHhJRYmANR33T2?usp=sharing

Готовый проект
https://drive.google.com/file/d/1_2xcX6TRIDnMyRiCKCef9pHFek9fP8QK/view?usp=sharing

Сегодня у нас прошёл урок №8 модуля Stencyl.
На нём мы с вами:
- научились добавлять звуки в игру;
- закончили игру "Подземелье";
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Stencyl!
На уроке мы:
- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Stencyl.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Roblox!
Мы будем работать в Roblox Studio - это движок, который позволяет создавать свои собственные игры и миры для игровой платформы Roblox. На модуле мы научимся писать программы на языке программирования Lua, создадим несколько игр: мини-игру футбол, игру на выживание и игру со сбором ресурсов!
На следующем уроке мы:
- познакомимся со средой Roblox Studio;
- изучим инструменты в этой среде;
- создадим две постройки в игре: гараж и башню с лестницей! 

К следующему занятию, пожалуйста, установите Roblox Studio на свой компьютер! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Roblox Studio:
https://docs.google.com/document/d/1xVsuDnJHm5TyvGohi61ezIDFxZ6ggPOMAjejPl7d438/edit?usp=drive_link`
    },
    'Roblox Studio': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSenw6M079Cf5txx0p5sI1Ud6xXbpb2Fu5B_BVSIfMtIGC3rcQ/viewform

Сегодня у нас прошёл урок №1 модуля Roblox Studio.
На нём мы с вами:
- познакомились со средой Roblox Studio;
- изучили инструменты в этой среде;
- создали две постройки в игре: гараж и башню с лестницей! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое материалы и текстуры;
- напишем первую программу на языке программирования Lua;
- создадим ёлку с игрушками!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1eoab_Smj0_ysBpxKv9XKqYJLtZuJ18iQ?usp=sharing

Готовый проект
https://drive.google.com/file/d/1QZYrU0y4RCwsqdVRsuLIDpNyEdJYPohX/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSc_HrCt8KooaK9w9DYs54pRgHVEIz-1Yhh9U_wNkiKCHKKaBQ/viewform

Сегодня у нас прошёл урок №2 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое материалы и текстуры;
- написали первую программу на языке программирования Lua;
- создали ёлку с игрушками!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как соединять детали друг с другом;
- научимся писать программы с использованием функции;
- создадим кнопку для открытия двери!`,
      '3 урок': `Заготовка
https://drive.google.com/file/d/1uHWZOP6BuEPx16rOygd_RYUZa3IbDurx/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/15YUimiQFGOw7PsvFV1U7NKxcya4_zWDR/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdP1dUFGvEEcbDZE4Ucozl3Kx2BiF9WJ-tr04rnLULaiw1dQA/viewform

Сегодня у нас прошёл урок №3 модуля Roblox Studio.
На нём мы с вами:
- узнали, как соединять детали друг с другом;
- научились писать программы с использованием функции;
- создали кнопку для открытия двери!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать и настраивать эффекты;
- научимся создавать и использовать переменные;
- запрограммируем радугу!`,
      '4 урок': `Заготовка
https://drive.google.com/file/d/14lIAlGZD3AKHkJYF4VDLM_NyIIsc3IUG/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1FNihiO8BRhM-fFX10wDHXgG9Tufqr3XM/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdjYDzwxqF3TW04okqGycwYg_820AcPoGlK4PEbkRSTlBqq_A/viewform

Сегодня у нас прошёл урок №4 модуля Roblox Studio.
На нём мы с вами:
- узнали, как создавать и настраивать эффекты;
- научились создавать и использовать переменные;
- запрограммировали радугу! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научимся писать программы с условием;
- создадим игру "Мини-футбол"!`,
      '5 урок': `Заготовка
https://create.roblox.com/marketplace/asset/15916684025/Stadium-CodeClass%3Fkeyword=&pageNumber=&pagePosition=

Готовый проект
https://drive.google.com/file/d/1ZHHwTFjd8WQTd75O3dFsr0fEayrCWa4z/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf6_EenNZFly1Ru_Mk09onfZ3Uxg1oPoLmibgjvAX7ln7i8WQ/viewform

Сегодня у нас прошёл урок №5 модуля Roblox Studio.
На нём мы с вами:
- узнали, что такое графический пользовательский интерфейс (GUI) и как его добавлять на сцену;
- научились писать программы с условием;
- создали игру "Мини-футбол"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять в игру врагов и инструменты;
- научимся использовать цикл while;
- создадим игру на выживание!`,
      '6 урок': `Заготовка
https://drive.google.com/file/d/1AfTdLOTbtJ2jQXcuw8kvHPZm3rzuyc4N/view?usp=sharing

Готовый проект
https://drive.google.com/file/d/1HU6uh6NW_Xinijdw7KF2Qk3uwLIDMtZO/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfQ0lj7Z66_acXf869s5om01AwIJpvvUU7yA2_Lxb3XRqjXdg/viewform

Сегодня у нас прошёл урок №6 модуля Roblox Studio.
На нём мы с вами:
- узнали, как добавлять в игру врагов и инструменты;
- научились использовать цикл while;
- создали игру на выживание!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и изменять ландшафт в игре;
- научимся делать объекты прозрачными;
- создадим свою мини-игру со сбором ресурсов!`,
      '7 урок': `Готовый проект
https://drive.google.com/file/d/1XI44bpeufZT5hzTYYXcxtLgRHHXAWKBH/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfF4VphFC7VtmIEeuC7gZSDb2tUwyNnRa2yqn19u3XmCauLyQ/viewform

Сегодня у нас прошёл урок №7 модуля Roblox Studio.
На нём мы с вами:
- научились создавать и изменять ландшафт в игре;
- научились делать объекты прозрачными;
- создали свою мини-игру со сбором ресурсов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим телепорт;
- начнём работать над собственным проектом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Roblox Studio.
На нём мы с вами:
- создали телепорт;
- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Roblox Studio!
На уроке мы:
- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Roblox Studio.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - JavaScript!
JavaScript - это настоящий язык программирования, который очень популярен во всём мире. На этом модуле мы сделаем игры: "Акинатор", "Викторину" и "Шар судьбы"! А также каждый из вас создаст свою веб-страничку (мини-сайт) по любимой игре и реализует на нём викторину!
На следующем уроке мы:
- узнаем, что такое Javascript;
- узнаем, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомимся с HTML и создали свою первую страничку!

К следующему занятию, пожалуйста, установите на свой компьютер Visual Studio Code! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Visual Studio Code: 
https://docs.google.com/document/d/1OcXlaH3LKw6rvbKDascR_CGONlabDgMcKVqCAxN4GmM/edit?usp=sharing`
    },
    'JavaScript': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1a0Bsr_zFPY6w3HFzAgNpsQGhbmZnOcfb?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1qyWa0QK0Iuh-8GkitpmIybwg_rhGirR5?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSet1gEhz7yuEGVWSm5ccjVjfTP0DOObtryGBJonzgjIgDzzlA/viewform?usp=sf_link

Сегодня у нас прошёл урок №1 модуля JavaScript.
На нём мы с вами:
- узнали, что такое Javascript;
- узнали, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомились с HTML и создали свою первую страничку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с операторами сравнения и условными конструкциями;
- познакомимся с функциями ввода/вывода;
- напишем свою игру "Акинатор"!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1hatFJgtEdRN-Wi_FfeRMGEhSwBtWJHBz?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/17F1yy2XPMHXVr9szGHXNidFTnvDCG7mw?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfgwab5TOMVLEzUxXGfNaCzivMtwGhBwKuE_EHQiCqxmYpyMA/viewform

Сегодня у нас прошёл урок №2 модуля JavaScript.
На нём мы с вами:
- познакомились с операторами сравнения и условными конструкциями;
- познакомились с функциями ввода/вывода;
- написали свою игру "Акинатор"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с циклами while и do … while;
- научимся создавать и программировать кнопки на веб-страницах;
- доработаем Акинатор!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/167bTFRUnK8Jk0iYNLEa3mmveVjlIz7gC?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1J0UbZwsJJnVzza72A-iUbOOknqsa2Z4q?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSf_Dr7j-qTG6frxUjkh2wC7xxQ7YIeoOLTYk1X35b5SH1lQ4g/viewform?usp=sf_link

Сегодня у нас прошёл урок №3 модуля JavaScript.
На нём мы с вами:
- познакомились с циклами while и do … while;
- научились создавать и программировать кнопки на веб-страницах;
- доработали Акинатор!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с массивами;
- научимся получать случайное число;
- сделаем игру "Шар судьбы"!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1KuL0ixgaiXFMiA2DBdkJyegoXN0K65Ku?usp=sharing


Готовый проект
https://drive.google.com/drive/folders/1jiMaU1AbyCJJ47suEFVkSRSKqX98RAvY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe_z1U9FyAsVEmHp4bQw6ujtCbjlpg_pMr3dMjCsTnyLVQuZQ/viewform?usp=sf_link

Сегодня у нас прошёл урок №4 модуля JavaScript.
На нём мы с вами:
- познакомились с массивами;
- научились получать случайное число;
- сделали игру "Шар судьбы"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое объекты;
- научимся пользоваться объектами для хранения данных;
- сделаем заготовку под "Викторину"!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1x7j5GP9QsArcp-5dBCRtaZ5wFCzRPWd7?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/13Oo4T1nGUhbzS2x-t1SKUaq7S4RK4anV?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd-bBxFs6Yl0gnLsk_GwaeLw1zKNAzh8-2ON6uxaX000aupGg/viewform?usp=sf_link

Сегодня у нас прошёл урок №5 модуля JavaScript.
На нём мы с вами:
- узнали, что такое объекты;
- научились пользоваться объектами для хранения данных;
- сделали заготовку под "Викторину"!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с циклом for;
- научимся пользоваться переменной счётчика;
- доделаем "Викторину"!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1Ycg-aaVdqHeKKb1ynxMa-YeWPVgLH77x?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1K56LRWdh3qJ1G3qS-qLBNhSnMzJxXl32?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfxRClbeqY2h_kROmavkiydre64O4mHaAdvsvW2Zaeam0g_iw/viewform

Сегодня у нас прошёл урок №6 модуля JavaScript.
На нём мы с вами:
- познакомились с циклом for;
- научились пользоваться переменной счётчика;
- доделали "Викторину"!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High JavaScript!
На уроке мы:
- узнаем, что такое "контейнер";
- создадим собственный сайт;
- проведем презентацию проектов;
- подведём итоги модуля!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/17NDiKMy5kN5D24ejsRWbJ08dKYZOwJSx?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1zn4ptZjKULFecCCwP5ai6A9o8CXh2ZlR?usp=sharing

Сегодня у нас прошёл последний урок (№7) модуля High JavaScript.
На нём мы с вами:
- создали собственный сайт;
- провели презентацию проектов;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)`
    },
    'Unity': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1Aizlq3zX3SIBCycyi12ChxWHj9wzDKTI?usp=sharingAi

Готовый проект
https://drive.google.com/file/d/1OEIShV31-LTBBOCEiGixN2rKaNZyO9NO/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeM0iRh6Ltj75N2WXBVYkebeVEi7d5UWwkJE_FqOzN0acNVag/viewform

Сегодня у нас прошёл урок №1 модуля Unity.
На нём мы с вами:
- изучили интерфейс программы Unity;
- научились работать с базовыми объектами и инструментами;
- создали первую сцену! 


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять Collider на объекты;
- познакомимся с языком программирования C#, узнаем, что такое классы и функции;
- научимся создавать скрипты и напишем первую программу для вращения объектов;
- доработаем 1-ый уровень!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1lIJSS6C48XhXeseTHif-yZt42tC8ko43?usp=sharing

Готовый проект
https://drive.google.com/file/d/1cGCRMdSNE9NzCbgZ7cmJoN58jcZJgqZv/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSft8ebr4nD86WFl-5fk-22TDle5z5Arsogo7b6-iGcEiQGjVA/viewform

Сегодня у нас прошёл урок №2 модуля Unity.
На нём мы с вами:
- узнали, как добавлять Collider на объекты;
- познакомились с языком программирования C#, узнали, что такое классы и функции;
- научились создавать скрипты и написали первую программу для вращения объектов;
- доработали 1-ый уровень!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с системой частиц;
- познакомимся с триггерами;
- научимся писать программу перезагрузки уровня;
- закончим создание 1-го уровня игры!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1jz2X27VzLieRtzHepBRo3klJIEVtwEcd?usp=sharing

Готовый проект
https://drive.google.com/file/d/1LeLY4oksVZU9MOxGGCgkkFq9coWKBAQ8/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdH0mgOkrEfeicvft92bF7Eum4dBbCtJvXh2O2txovxID6dBw/viewform

Сегодня у нас прошёл урок №3 модуля Unity.
На нём мы с вами:
- познакомились с системой частиц;
- познакомились с триггерами;
- научились писать программу перезагрузки уровня;
- закончить создание 1-го уровня игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать ландшафт;
- узнаем о переменных и типах данных;
- напишем программу перехода между уровнями;
- начнём создание 2-го уровня!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1tb24xgpV8h5g4eBjBnWfdVzT-GSjxMLj?usp=sharing

Готовый проект
https://drive.google.com/file/d/1AtCEmI3DdG9m3Lxm7BehJ3s3nm0K_dPs/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScUmMsOPJKzWyY65XgDSJxK99v40TE45430oUsdOnomlZip9g/viewform

Сегодня у нас прошёл урок №4 модуля Unity.
На нём мы с вами:
- узнали, как создавать ландшафт;
- узнали о переменных и типах данных;
- написали программу перехода между уровнями;
- начали создание 2-го уровня!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как добавлять UI в Unity;
- научимся влиять на UI с помощью кода;
- познакомимся с условными конструкциями If и тегами; 
- создадим полоску здоровья и опасную зону на уровне!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1-1gO7vpfx6ksLMfB7j1-neyZB4VYkIWM?usp=sharing

Готовый проект
https://drive.google.com/file/d/1jeGhkfu1ZdBs8S5NjTH0yYKAbqIrQSoq/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSd1zY0AREu0ZQMTxQCCCf5mytYOwwe7wL3DzGUbqxA0nBoIuw/viewform

Сегодня у нас прошёл урок №5 модуля Unity.
На нём мы с вами:
- узнали, как добавлять UI в Unity;
- научились влиять на UI с помощью кода;
- познакомились с условными конструкциями If и тегами; 
- создали полоску здоровья и опасную зону на уровне! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с инструментами навигации в Unity;
- познакомимся с функциями GetComponent и SetDestination;
- познакомимся с переменной Time.deltaTime и функцией sqrMagnitude;
- добавим на уровень врагов, заставили их нас преследовать и отнимать здоровье!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/19gk1HYjlFgh_57t3QdcYtVoJ0aoG8Pp7?usp=sharing

Готовый проект
https://drive.google.com/file/d/1y_NaPM3344IpwkLKJH40jXYiOyGtIjL1/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSces-y2aopzoU8eQdUmoroEMq0o4A7TYqZi9gyoxMm5bhJquQ/viewform

Сегодня у нас прошёл урок №6 модуля Unity.
На нём мы с вами:
- познакомились с инструментами навигации в Unity;
- познакомились с функциями GetComponent и SetDestination;
- познакомились с переменной Time.deltaTime и функцией sqrMagnitude;
- добавили на уровень врагов, заставили их нас преследовать и отнимать здоровье!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с физикой твёрдого тела - RigidBody;
- познакомимся с функцией отслеживания нажатий клавиш;
- познакомимся с функциями создания и уничтожения объектов;
- добавим игроку арбалет, научим его стрелять, заставим ботов реагировать на выстрелы!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/19UE_8SLDnshvRjzV5gTr5daEf9eAu8M1?usp=sharing

Готовый проект
https://drive.google.com/file/d/12o5vGzaXygqMWSHBkC5cB4A2m6h1y1Ww/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeKs9ZJRiwI0FpLNXBrdyJ4qhCMPBZr4vNk1SmD6qLd7gWnSA/viewform

Сегодня у нас прошёл урок №7 модуля Unity.
На нём мы с вами:
- познакомились с физикой твёрдого тела - RigidBody;
- познакомились с функцией отслеживания нажатий клавиш;
- познакомились с функциями создания и уничтожения объектов;
- добавили игроку арбалет, научили его стрелять, заставили ботов реагировать на выстрелы! 

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся работать со звуком в Unity;
- научимся добавлять и расставлять источники освещения;
- запрограммируем смену дня и ночи;
- добавим в нашу игру звуки и свет!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1FVx1C0-7hUiZaOgCZl32KlrrDsr76ZuK?usp=sharing

Готовый проект
https://drive.google.com/file/d/1kzSJfuN_3wEQrhMRCiOo9x7ALi1Y0RNR/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeYBL2ek6lSr7X14qc7QamPEG7z31Nkpasvf-E46h_lbO-u2Q/viewform

Сегодня у нас прошёл урок №8 модуля Unity.
На нём мы с вами:
- научились работать со звуком в Unity;
- научились добавлять и расставлять источники освещения;
- запрограммировали смену дня и ночи;
- добавили в нашу игру звуки и свет!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся работать с кнопками и создадим главное меню;
- научимся программировать кнопки;
- закончим нашу игру!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/1AZgLI6afZhHdC_HWJFoaXO6xp_9QMTHm?usp=sharing

Готовый проект
https://drive.google.com/file/d/1iLtovZhXbFsF2LOHOsC2DQXhICPHVyof/view?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdRf7xVhsASvuZ9bqVyh-4iihgabMr0P6aHDFSb269NblmUjg/viewform

Сегодня у нас прошёл урок №9 модуля Unity.
На нём мы с вами:
- научились работать с кнопками и создали главное меню;
- научились программировать кнопки;
- закончили нашу игру!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся собирать проект в полноценную игру;
- добавим ассеты в наш проект;
- познакомимся с новым видом объекта - префабом;
- начнём делать игру City Runner!`,
      '10 урок': `Заготовка
https://drive.google.com/file/d/1DK8I5GHlF2P3YxWXrQfvz_dWcfI1pl5l/view?usp=drive_link


Готовый проект
https://drive.google.com/file/d/1x-idagRw2TQ1CHaBKpolanGSmzaZjAQe/view?usp=drive_link

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebHQXxbd_HwQpA2XJbEgfBqskCXFrDx-vADRBQg3uWi3Xp3Q/viewform

Сегодня у нас прошёл урок №10 модуля Unity.
На нём мы с вами:
- научились собирать проект в полноценную игру;
- добавили ассеты в наш проект;
- познакомились с новым видом объекта - префабом;
- начали делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- заставим нашего персонажа двигаться и научимся им управлять;
- научим нашего персонажа прыгать;
- научимся программировать сложные условия;
- продолжим делать игру City Runner!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1I2lAgSqUN9ThhFtLXh6Du_4W3qZTHPiO

Готовый проект
https://drive.google.com/file/d/12_j4DmZbzP_K9gGDe_bfr2UQvSMH4d-9/view?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdvI7zgDfNsogDueMbSDmtFj4Qq1mSr84XNsHvLW8We_7U-VQ/viewform?usp=sharing

Сегодня у нас прошёл урок №11 модуля Unity.
На нём мы с вами:
- заставили нашего персонажа двигаться и научились им управлять;
- научили нашего персонажа прыгать;
- научились программировать сложные условия;
- продолжили делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научим персонажа собирать монеты, врезаться в кусты;
- запрограммируем условие проигрыша игры;
- добавим в игру UI;
- продолжим делать игру City Runner!`,
      '12 урок': `Заготовка
https://drive.google.com/drive/folders/167EptFyQZxE1aqBpZOzVvv472D5yolfY

Готовый проект
https://drive.google.com/file/d/1LgbppDJc6zF4OdT4kv8QrEYTRcvhYGnN/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLScs9g3lj8Xip4fXq-zbIVKuNwXh83moED8gjHC4V7XwlVqDvQ/viewform?usp=dialog

Сегодня у нас прошёл урок №12 модуля Unity.
На нём мы с вами:
- научили персонажа собирать монеты и врезаться в кусты;
- запрограммировали условие проигрыша игры;
- добавили в игру UI;
- продолжили делать игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- сделаем бесконечную генерацию уровня;
- добавим в игру звуки прыжка, сбора монеты и фоновую музыку;
- закончим игру City Runner!`,
      '13 урок': `Заготовка
https://drive.google.com/drive/folders/1twz7oo-ORjcJYMwLmK7sckeQuczrE9Jw?usp=sharing

Готовый проект
https://drive.google.com/file/d/1uuFOoabKPmbXxoYtFB28paz4Oaq62laU/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLScRPy8XFBNKynhjznMffhJi9psmCuhbtzbQdD2alZAiboI2Pw/viewform?usp=sharing


Сегодня у нас прошёл урок №13 модуля Unity.
На нём мы с вами:
- сделали бесконечную генерацию уровня;
- добавили в игру звуки прыжка, сбора монеты и фоновую музыку;
- закончили игру City Runner!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с компонентом Tilemap;
- научимся генерировать случайные фигуры на сцене;
- научимся управлять фигурами;
- начнем делать игру Тетрис!`,
      '14 урок': `Заготовка
https://drive.google.com/drive/folders/1mGddzWDdSwpOQQGxmee1kV-fUzza8LSI?usp=drive_link

Готовый проект
https://drive.google.com/file/d/1lBSja-H26nGxm5C5045RyE4d_r4LGw1E/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLSfYnKNsOoV8oqtNvMHVQW6TpFdrnmka5IjuS0CRcAlZcR6vCw/viewform?usp=sharing

Сегодня у нас прошёл урок №14 модуля Unity.
На нём мы с вами:
- познакомились с компонентом Tilemap;
- научились генерировать случайные фигуры на сцене;
- научились управлять фигурами;
- начали делать игру Тетрис!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- запрограммируем падение тетромино;
- напишем скрипт для блокировки упавшей фигуры;
- научимся очищать линии;
- добавим в игру UI и подсчет очков;
- закончим делать игру Тетрис!`,
      '15 урок': `Заготовка
https://drive.google.com/file/d/1_dWLnmm9gN71uiy9Sm_4ug3h2IXnlI5v/view?usp=drive_link

Готовый проект
https://drive.google.com/file/d/1kKM61Er8cKFGHQWAbfFFZIFEfbTtJ3E8/view?usp=drive_link

Тест
docs.google.com/forms/d/e/1FAIpQLSf2a-eocIwGE6d-c51jl93JGQwOSoayqeGKk81Sq28a9Xo4cg/viewform?usp=sharing

Сегодня у нас прошёл урок №15 модуля Unity.
На нём мы с вами:
- запрограммировали падение тетрамино;
- написали скрипт для блокировки упавшей фигуры;
- научились очищать линии;
- добавили в игру UI и подсчет очков;
- закончили делать игру Тетрис!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- скомпилируем проект Тетрис;
- подведем итоги модуля; 
- начнем создавать собственный проект!`,
      '16 урок': `Заготовка
https://drive.google.com/drive/folders/1ZF4KhKzOWIMUfQepR-SyKi88oe58SLZB?usp=drive_link

Сегодня у нас прошёл урок №16 модуля Unity.
На нём мы с вами:
- скомпилировали проект Тетрис;
- подвели итоги модуля; 
- начали создавать собственный проект!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Expert Unity!
На уроке мы:
- доработаем проекты и подготовимся к защите;
- проведём презентацию проектов!`,
      '17 урок': `Сегодня у нас прошёл последний урок (№17) модуля High Expert Unity.
На нём мы с вами:
- доработали проекты и подготовились к защите;
- провели презентацию проектов!

Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - Blender!
Blender - это программа для 3D-моделирования. На модуле Unity мы использовали уже готовые модели и импортировали их в проект. А на модуле Blender мы с вами научимся создавать эти модели с нуля! Мы создадим множество моделей. И затем используем их при работе с другим игровым движком - Unreal Engine!
На следующем уроке мы:
- познакомимся с интерфейсом программы Blender;
- научимся пользоваться базовыми инструментами;
- познакомимся с примитивами и научимся их добавлять;
- научимся объединять несколько объектов в один;
- сделаем первые 2 модели для пиратской каюты: стол и стул!

К следующему занятию, пожалуйста, установите на свой компьютер Blender! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Blender:
https://docs.google.com/document/d/1ABDrvvg0bY8e55q5geCojbTY0XaNJNybnyeQlaF7VFM/edit?usp=sharing`
    },
    'Blender': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1dGvVllHMKNK6VBaFSuUNNL_8N8J8SKkJ?usp=sharing

Тест
https://forms.gle/XNTca73U8Lp8Bn4x7

Сегодня у нас прошёл урок №1 модуля Blender.
На нём мы с вами:
- познакомились с интерфейсом программы Blender;
- научились пользоваться базовыми инструментами;
- познакомились с примитивами и научимся их добавлять;
- научились объединять несколько объектов в один;
- сделали первые 2 модели для пиратской каюты: стол и стул!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся наносить материалы на объекты;
- познакомимся с режимами просмотра в Blender;
- познакомимся с режимом редактирования в Blender;
- узнаем, из чего состоит любая 3D-модель;
- познакомимся с инструментом Loop Cut;
- сделаем ещё одну модель для пиратской каюты: бочку!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1dGvVllHMKNK6VBaFSuUNNL_8N8J8SKkJ?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/15oTIoB4Cmu4xb8QYRL9GHYF-Tgh44ZZ9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScyvz157sJu8MKD8CdSKwB5m5QrzWbXKFMUCXTb_kQdZqPaPg/viewform


Сегодня у нас прошёл урок №2 модуля Blender.
На нём мы с вами:
- научились наносить материалы на объекты;
- познакомились с режимами просмотра в Blender;
- познакомились с режимом редактирования в Blender;
- узнали, из чего состоит любая 3D-модель;
- познакомились с инструментом Loop Cut;
- сделали ещё одну модель для пиратской каюты: бочку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с инструментами Inset Faces и Extrude Region и научимся ими пользоваться;
- научимся создавать глянцевые материалы;
- научимся применять материалы к полигонам;
- познакомимся с модификатором Subdivision Surface;
- сделаем ещё одну модель для пиратской каюты: серебряный кубок!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/15oTIoB4Cmu4xb8QYRL9GHYF-Tgh44ZZ9?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ooTiJbmtm0S7msUsadxs1lMRQ6keRAcx?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfJtJhd_iijoIkOXTn7o-HUKCO6xOOFNAMtLyHpTN7eZXyoEA/viewform

Сегодня у нас прошёл урок №3 модуля Blender.
На нём мы с вами:
- познакомились с инструментами Inset Faces и Extrude Region и научились ими пользоваться;
- научились создавать глянцевые материалы;
- научились применять материалы к полигонам;
- познакомились с модификатором Subdivision Surface;
- сделали ещё одну модель для пиратской каюты: серебряный кубок!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с понятием текстура и научимся их применять к моделям;
- познакомимся с вкладкой Shading;
- познакомимся с нодами и поработаем в редакторе нод;
- познакомимся с развёрткой;
- научимся работать с развёрткой объектов во вкладке UV Editing;
- нанесём текстуры на все модели пиратской каюты, добавим ковёр и пол!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/18JXWcFgzdzfS6bcD0Ht2k47rJKdl_o7g?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1SiOVzfDV_PVFdT5mnmUWzDDrqHkRhhA2?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSc9mAkN57QFH1tTB6NB6SKJ_Mymky7GoTssURcpdUf44ezd-w/viewform?usp=sf_link

Сегодня у нас прошёл урок №4 модуля Blender.
На нём мы с вами:
- познакомились с понятием текстура и научились их применять к моделям;
- познакомились с вкладкой Shading;
- познакомились с нодами и поработали в редакторе нод;
- познакомились с развёрткой;
- научились работать с развёрткой объектов во вкладке UV Editing;
- нанесли текстуры на все модели пиратской каюты, добавили ковёр и пол!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся импортировать модели в проект;
- познакомимся с физикой в Blender;
- научимся применять физику твёрдых тел к объектам;
- научимся применять физику ткани к объектам;
- познакомимся с анимацией в Blender и поработаем с временной шкалой;
- сделаем сундук, заполненный золотыми монетами и карту на столе!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1-Mn5eOTsCdUzPkxUUx7oz2B7gq5rNgzt?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1eQYhZN8-w2dEq668T-MaU-Uc9q-6hBh-?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdn96w7awmiq9ae5bP6JX64IqsKK_vP1f1Vy2o9IFrwv5Rurg/viewform

Сегодня у нас прошёл урок №5 модуля Blender.
На нём мы с вами:
- научились импортировать модели в проект;
- познакомились с физикой в Blender;
- научились применять физику твёрдых тел к объектам;
- научились применять физику ткани к объектам;
- познакомились с анимацией в Blender и поработали с временной шкалой;
- сделали сундук, заполненный золотыми монетами и карту на столе!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять референсы прямо в область просмотра;
- познакомимся с инструментом нож;
- научимся моделировать поочередно части, а потом их совмещать;
- научимся моделировать по референсу;
- сделаем пиратскую саблю!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1wqqO5pCsIGoEurOAmQHdMZzIDlRpP9Rr?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1TSkUhfr9D7C_RcCo8whz_2Ypyu-bhSd0?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSc7mFdNQ1sHsox6lK_oOkDyLz4IBYRD4WWMmrpM5WJJo475qQ/viewform?usp=sf_link

Сегодня у нас прошёл урок №6 модуля Blender.
На нём мы с вами:
- научились добавлять референсы прямо в область просмотра;
- познакомились с инструментом нож;
- научились моделировать поочередно части, а потом их совмещать;
- научились моделировать по референсу;
- сделали пиратскую саблю!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять текст и работать с ним;
- познакомимся с модификатором Boolean;
- познакомимся с инструментом Bevel;
- научимся использовать Loop Cut and Slide;
- научимся использовать контекстное меню при работе с полигонами и ребрами;
- сделаем гравировку на сабле, а также модель бутылки и книги!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/11rotAxPsMU2L3ULqaDVfiADibZSX6VRy?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1l8FEjshJ-qrzZSaj4Fbk36eWNLMRGvxE?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdsLY65PbE61XRWXHLqhWJz5FJQDMf1HEND-e_McMA3xq6vEw/viewform

Сегодня у нас прошёл урок №7 модуля Blender.
На нём мы с вами:
- научились добавлять текст и работать с ним;
- познакомились с модификатором Boolean;
- познакомились с инструментом Bevel;
- научились использовать Loop Cut and Slide;
- научились использовать контекстное меню при работе с полигонами и ребрами;
- сделали гравировку на сабле, а также модель бутылки и книги!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- доделаем каюту, поставим стены и окна;
- познакомимся со светящейся поверхностью материала;
- познакомимся с типами освещения и научимся их расставлять;
- познакомимся с графическим движком Cycles;
- научимся работать с камерой;
- сделаем финальный рендер пиратской каюты!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1dfRdeXYomguJGGZqewm026XdkT35zQYe?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1xQn3rQvJ1Vbu9JqKT3UclamV6JfaC-YZ?usp=sharing

Тест
https://docs.google.com/forms/u/2/d/e/1FAIpQLSdUEc4cXRtuicwWBcnGGU-xjuxoFuzqGh4IoDg86tq6SP8oow/viewform?usp=sf_link

Сегодня у нас прошёл урок №8 модуля Blender.
На нём мы с вами:
- доделали каюту, поставим стены и окна;
- познакомились со светящейся поверхностью материала;
- познакомились с типами освещения и научимся их расставлять;
- познакомились с графическим движком Cycles;
- научились работать с камерой;
- сделали финальный рендер пиратской каюты!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- подведём итоги модуля; 
- начнём создавать собственный проект!`,
      '9 урок': `Сегодня у нас прошёл урок №9 модуля Blender.
На нём мы с вами:
- подвели итоги модуля; 
- начали создавать собственный проект!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Expert Blender!
На уроке мы:
- доработаем проекты и подготовимся к защите;
- проведём презентацию проектов!`,
      '10 урок': `Сегодня у нас прошёл последний урок (№10) модуля High Expert Blender.
На нём мы с вами:
- доработали проекты и подготовились к защите;
- провели презентацию проектов!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - Unreal Engine!
Unreal Engine - это ещё один популярный игровой движок. На этом модуле мы научимся создавать игры на примере игры Pirate's Adventure. А также применим свои модели, созданные на модуле Blender, так что не потеряйте их, они понадобятся уже на следующем уроке!
На следующем уроке мы:
- познакомимся с интерфейсом игрового движка Unreal Engine 4 и научимся перемещаться по сцене;
- научимся экспортировать модели из Blender;
- научимся импортировать модели, а также перемещать, вращать и масштабировать объекты;
- научимся наносить материалы на объекты;
- создадим свою первую сцену!

К следующему занятию, пожалуйста, установите на свой компьютер Unreal Engine! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Unreal Engine: https://docs.google.com/document/d/170RTFnRUEtFnpTwzk54PGWZhLm59-iYTSmBTkp-U8ic/edit?usp=sharing`
    },
    'Unreal Engine': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1l5u6wd-h5fQBgnsku-tDNLX4wU6vQGnY

Готовый проект
https://drive.google.com/drive/folders/1noW2eBlXrA2-wlErNj5BzWlIK2C-oGE_?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSeSKglFQGDsYoRhFTVEk0awuWbs6MDG6z7VjcKxHO3iF1hBig/viewform?usp=sf_link

Сегодня у нас прошёл урок №1 модуля Unreal Engine.
На нём мы с вами:
- познакомились с интерфейсом игрового движка Unreal Engine 4 и научились перемещаться по сцене;
- научились экспортировать модели из Blender;
- научились импортировать модели, а также перемещать, вращать и масштабировать объекты;
- научились наносить материалы на объекты;
- создали свою первую сцену!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с блюпринтами и научимся их создавать;
- научимся работать с Event Graph, добавлять ноды;
- познакомимся с Box Collision;
- напишем свои первые блюпринты;
- добавим на нашу локацию монеты и алмазы и заставим их вращаться и исчезать при сборе!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1fu5QmZMYldOrpo53cPrdQYw6IBnC7A7P

Готовый проект
https://drive.google.com/drive/folders/1Ze-4msAhFWOmypPaEsUHi-vlHvY47682?usp=sharing


Тест
docs.google.com/forms/d/e/1FAIpQLSeZBtw37C6MREiJqHnrZzN5bmbeAFn3RoYvSUE_5i_uDWq75g/viewform?usp=sf_link

Сегодня у нас прошёл урок №2 модуля Unreal Engine.
На нём мы с вами:
- познакомились с блюпринтами и научились их создавать;
- научились работать с Event Graph, добавлять ноды;
- познакомились с Box Collision;
- написали свои первые блюпринты;
- добавили на нашу локацию монеты и алмазы и заставили их вращаться и исчезать при сборе!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с нодой Toggle Visibility;
- научимся делать компоненты невидимыми;
- научимся делать подсказки в игре с помощью компонента TextRender;
- научимся работать с физикой объектов;
- добавим на локацию освещение, физику и подсказки!`,
      '3 урок': `Готовый проект
https://drive.google.com/drive/folders/1KiHVf8HDkcX_YY63vyXMe-aTepLFOQHu?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdVi-Y8pN5UhirCxGsMHJJw2LTiqICiEWSnTZx9XpgjQ1ATEg/viewform?usp=sf_link

Сегодня у нас прошёл урок №3 модуля Unreal Engine.
На нём мы с вами:
- познакомились с нодой Toggle Visibility;
- научились делать компоненты невидимыми;
- научились делать подсказки в игре с помощью компонента TextRender;
- научились работать с физикой объектов;
- добавили на локацию освещение, физику и подсказки!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое переменная в играх и научимся писать программы с ней;
- доработаем нашу локацию!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1z5mjdW39c9pROSfBg6bfFHIQAdHlFztJ?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1-Cmat6UnY81mwx-i59dN_hGJM-BTBPpf?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSf9yyTyTYJw-fx0AJXFGDN4vDfxuvKoaHpbDFdMatDCq0igvg/viewform?usp=sf_link

Сегодня у нас прошёл урок №4 модуля Unreal Engine.
На нём мы с вами:
- узнали, что такое переменная в играх и научились писать программы с ней;
- доработали нашу локацию!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать новые уровни;
- научимся создавать виджеты и работать с UI;
- познакомимся с якорями (Anchors);
- научимся настраивать внешний вид текста и кнопок;
- научимся выводить виджет на экран и программировать кнопки;
- добавим в нашу игру главное меню!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1meGqVzcJOWZ9Be9xMLtkTLt1Lopw2pGg?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1fOVNFbeqSogt9WBKq9yjAPpPyasL1-uQ?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSc_VZAvH-wixeo0v5RTLqEtpZaGxLK3gM_t0GR7G9hSE5Ni9Q/viewform?usp=sf_link


Сегодня у нас прошёл урок №5 модуля Unreal Engine.
На нём мы с вами:
- научились создавать новые уровни;
- научились создавать виджеты и работать с UI;
- познакомились с якорями (Anchors);
- научились настраивать внешний вид текста и кнопок;
- научились выводить виджет на экран и программировать кнопки;
- добавили в нашу игру главное меню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое разрушаемый объект;
- познакомимся с компонентом Radial Force;
- познакомимся с системами частиц;
- запрограммируем объект на разрушение и активацию системы частиц;
- научимся разрушать объекты и работать со спецэффектами!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1eWp9TcDHo7Hq-1byJsx-t7G-ljv7kVmN?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1SYQ79wtdPO1OUr9Lc9AbA6eHu7rl1w64?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSeSgWGvHx96tcNv5Nvj1dbGyaT7snI2cRf1KaNQwNXa8M_Xkw/viewform?usp=sf_link

Сегодня у нас прошёл урок №6 модуля Unreal Engine.
На нём мы с вами:
- узнали, что такое разрушаемый объект;
- познакомились с компонентом Radial Force;
- познакомились с системами частиц;
- запрограммировали объект на разрушение и активацию системы частиц;
- научились разрушать объекты и работать со спецэффектами!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся работать с Progress Bar и создавать для него зависимости;
- научимся создавать функции;
- создадим функцию Take Damage ("получить урон");
- создадим функцию Recover Health ("восстановить здоровье") и научимся вызывать функции в нужный момент;
- добавим и запрограммируем шкалу здоровья игрока!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1jdDkA0oJNwGuRxf2pam28k6R2rR4uUSn?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1yQbQ6mMs7KNQB2XpYHZi_i2f-4GrHGzt?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdZW5oFeBWqirFr7y4FgyfGfJCR56pWasf7fyJuuTS0OJ1cEg/viewform?usp=sf_link


Сегодня у нас прошёл урок №7 модуля Unreal Engine.
На нём мы с вами:
- научились работать с Progress Bar и создавать для него зависимости;
- научились создавать функции;
- создали функцию Take Damage ("получить урон");
- создали функцию Recover Health ("восстановить здоровье") и научились вызывать функции в нужный момент;
- добавили и запрограммировали шкалу здоровья игрока!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как создавать персонажей в игре;
- познакомимся с Nav Mesh;
- добавим врага, заставим его бежать на игрока и реагировать на выстрелы!`,
      '8 урок': `Готовый проект
https://drive.google.com/drive/folders/1UH1jaqr8pWs0thQDsCGlRbRXeYCVIx5Z?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdS5RPDO18BGhqxKfhq52nUgkdXh2j0qTaDw6ewqwRb6yAvAw/viewform


Сегодня у нас прошёл урок №8 модуля Unreal Engine.
На нём мы с вами:
- узнали, как создавать персонажей в игре;
- познакомились с Nav Mesh;
- добавили врага, заставили его бежать на игрока и реагировать на выстрелы!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с типом данных Boolean;
- узнаем, как добавлять новые клавиши в игру;
- научимся писать программу для смены камеры по нажатию клавиши;
- заставим врагов отнимать у нас здоровье и сделаем прицел в игре!`,
      '9 урок': `Готовый проект
https://drive.google.com/drive/folders/1z58novJqY-cEGBkw5x0bypt3Vno65Rbu?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSck8Ol3Ygdgdlnak0lzprNytNqi4nts6kh1nJp6mH2llzoRDA/viewform

Сегодня у нас прошёл урок №9 модуля Unreal Engine.
На нём мы с вами:
- познакомились с типом данных Boolean;
- узнали, как добавлять новые клавиши в игру;
- научились писать программу для смены камеры по нажатию клавиши;
- заставили врагов отнимать у нас здоровье и сделали прицел в игре! 


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать и прорабатывать ландшафт;
- научимся добавлять в игру эффекты окружения и программировать их;
- создадим ещё один уровень в нашей игре!`,
      '10 урок': `Заготовка
https://drive.google.com/drive/folders/1eH73mK1ckHvJtBViAxo8ur8jYrMvVYnm?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1nMLRlWXpeNufXxdWHUHtwdaDEIqi0N61?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSc_QIYOsY50c2QV5Wg6dy8ImIxw4YsySnTkBBesGl1BjTGEBg/viewform?usp=sf_link


Сегодня у нас прошёл урок №10 модуля Unreal Engine.
На нём мы с вами:
- научились создавать и прорабатывать ландшафт;
- научились добавлять в игру эффекты окружения и программировать их;
- создали ещё один уровень в нашей игре!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, из чего состоит свет в игре;
- научимся писать программу для смены дня и ночи;
- добавим смысла на 1 уровень нашей игры;
- доработаем игру до конца!`,
      '11 урок': `Готовый проект
https://drive.google.com/drive/folders/1iIN5cs5_59Y8RWwsdnZY0vyBu0cdaBe3?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSdcHzkdWTZk_iVsC-WkaUgh8xlhW9I4MKq3VIoXa6OKVXOZIQ/viewform?usp=sf_link

Сегодня у нас прошёл урок №11 модуля Unreal Engine.
На нём мы с вами:
- узнали, из чего состоит свет в игре;
- научились писать программу для смены дня и ночи;
- добавили смысла на 1 уровень нашей игры;
- доработали игру до конца!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- начнём работу над собственными проектами!`,
      '12 урок': `Сегодня у нас прошёл урок №12 модуля Unreal Engine.
На нём мы с вами:
- начали работу над собственными проектами!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Unreal Engine!
На уроке мы:
- доработаем проекты;
- подготовимся и проведём защиту проектов;
- подведём итоги модуля!`,
      '13 урок': `Сегодня у нас прошёл последний урок (№13) модуля High Unreal Engine.
На нём мы с вами:
- доработали проекты;
- подготовились и провели защиту проектов;
- подвели итоги модуля!


Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)`
    },
    'HTML, CSS, JavaScript': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1FIF-MT3qzZpe72H_1ouXJnCHbrGH_GdK?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfnjmSK4DjfoAU62c2_IjLho2bjcQOERfPWn-NmGiJchp_fIA/viewform

Сегодня у нас прошёл урок №1 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с интерфейсом среды Visual Studio Code;
- познакомились со структурой HTML-документа;
- познакомились с CSS, научились создавать и применять стили;
- сделали заготовку для нашего будущего сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с заказчиком, получим техническое задание и макет, научимся работать с Figma;
- познакомимся с div-элементами и классами;
- научимся менять расположение div-элементов;
- научимся применять правила стиля к классам и познакомимся со многими новыми CSS-правилами;
- cделаем header сайта!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1nvtXb3lbq6b8nbi0iplLAWYv9bKPmZ_2?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1i9bybnKsrZKY5xH1ijsIjKGPB8uCdJZY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSekboQknGoVpy-nFkVGe09F4Z3i0bfddkaZWsKOhX2PQBTwdg/viewform

Сегодня у нас прошёл урок №2 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с заказчиком, получили техническое задание и макет, научились работать с Figma;
- познакомились с div-элементами и классами;
- научились менять расположение div-элементов;
- научились применять правила стиля к классам и познакомились со многими новыми CSS-правилами;
- cделали header сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с секциями в HTML;
- научимся добавлять на сайт изображения;
- создадим обёртку для секции;
- сверстаем первые 3 раздела нашего сайта!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1wOYkBPu5PpxcPMqOElLeaSbnZwoqIEkt?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/17C1DadQRsgzCvmDNyuSjOxpRmerH4YRf?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfCpkJ644SXGFuIPqQ6t7QEhsML4FDVjVXZFaJN-FNYJLJ-Xg/viewform

Сегодня у нас прошёл урок №3 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с секциями в HTML;
- научились добавлять на сайт изображения;
- создали обёртку для секции;
- сверстали первые 3 раздела нашего сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- вспомним, как добавлять обёртку секции и изображения;
- познакомимся с псевдоэлементами before и after;
- сделаем секцию навыков на нашем сайте.`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1hsezeFrZeKyj0ug4_FdLLl4SD1ZqhRoi?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1od7tmVzQNJu2PIwex-TUPr9betVEcco9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfP9Nohx7fmg03WQj_jnLPM6sQX2tvHBKFbDYTNhhF8MBEgSg/viewform

Сегодня у нас прошёл урок №4 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- вспомнили, как добавлять обёртку секции и изображения;
- познакомились с псевдоэлементами before и after;
- сделали секцию навыков на нашем сайте.

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся добавлять на сайт видео;
- сбросим настройки "по умолчанию";
- закрепим header сайта;
- сделаем секцию процессов и закрепили главное меню!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/1hB1FopF1Sb_IqJhb2kNIfQlWP1MiAzbp?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1KhU_5dY-31ZTme6OvwmWZlWHZR9m3CPW?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScIEMhA4nVb_6TvjUVOMenSvT6N1I06kOXT-jnrY-Ej58tiag/viewform

Сегодня у нас прошёл урок №5 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- научились добавлять на сайт видео;
- сбросили настройки "по умолчанию";
- закрепили header сайта;
- сделали секцию процессов и закрепили главное меню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся со свойством flex-direction;
- научимся создавать формы, поля ввода, текстовую область и кнопки;
- сделаем секцию формы!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1asyewSjfiuHRHbYqofRsdfu6NBwrRsNz?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1yHgeH8Jq8buqykmc4sJF6MWFWWWzpxXv?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeddyqgBHKXRfn8m-gkcNvtGFABwEtB_mkqPpMQQ28t7JVn3g/viewform

Сегодня у нас прошёл урок №6 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились со свойством flex-direction;
- научились создавать формы, поля ввода, текстовую область и кнопки;
- сделали секцию формы!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с языком программирования JavaScript;
- поработаем с библиотекой функций jQuery;
- научимся пользоваться плагинами;
- сделаем секцию галереи!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/16R3HvtKBnNQc0rlVofqlcivAnhDI68KB?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1w_b5iqlCqCtGipnml_-rpCsgH8MKoPjn?usp=sharing


Тест
https://docs.google.com/forms/d/e/1FAIpQLSdjmS3m3Zc6UDMit2fTEaRvw8U6RHayoJ15713qgvZ_lryqUQ/viewform

Сегодня у нас прошёл урок №7 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились с языком программирования JavaScript;
- поработали с библиотекой функций jQuery;
- научились пользоваться плагинами;
- сделали секцию галереи!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- напишем свою первую строку кода на JavaScript;
- познакомимся с переменными и научимся ими пользоваться;
- познакомимся с событиями и функциями;
- запрограммируем смену цвета заголовка при нажатии на кнопку и увеличение логотипа!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1ASZDmwP7Bq3ix-WN08JQRo-4IqgMyF15?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1md8uf_m7Oug8QwbGQlWxI-qmeQQvlwAE?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebs_RlffLzfmKWb0u3HB0pYofBVszilAgNrRyqxRrHChW0KA/viewform

Сегодня у нас прошёл урок №8 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- написали свою первую строку кода на JavaScript;
- познакомились с переменными и научились ими пользоваться;
- познакомились с событиями и функциями;
- запрограммировали смену цвета заголовка при нажатии на кнопку и увеличение логотипа!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся со спецсимволами в HTML;
- научимся создавать модальное окно на странице;
- научимся отображать блоки с помощью display;
- сделаем всплывающую форму!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/13-EpRk7zVAdeQdq7GuIWMm69SL8F3CPV?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1TvJJspoMeFPOnZpn4Ebys2aK--9whN93?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSddjihmHXnHzyIZI92V6tNofIqMi69zy6RT8DzKVRDiM7g0JA/viewform

Сегодня у нас прошёл урок №9 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- познакомились со спецсимволами в HTML;
- научились создавать модальное окно на странице;
- научились отображать блоки с помощью display;
- сделали всплывающую форму!


Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, как устроена анимация в веб-страницах и научимся создавать её;
- познакомимся с функцией setTimeout, анимируем появление формы;
- анимируем кнопку с помощью псевдоэлемента hover и CSS-свойства border-radius;
- создадим анимацию для логотипа и научимся её вызывать!`,
      '10 урок': `Заготовка
https://drive.google.com/drive/folders/10Xu7pEmbj38F9CTE2PJemgUXA4XLNO7G?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ouxjSji5vLAb6UJXzefdyrhCrcBTo0BN?usp=sharing



Тест
https://docs.google.com/forms/d/e/1FAIpQLSfzZhXFv9AGle5YnM_Cc0xYI_tLtQY5752sN9EB8nEtEXPDTw/viewform

Сегодня у нас прошёл урок №10 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- узнали, как устроена анимация в веб-страницах и научились создавать её;
- познакомились с функцией setTimeout, анимировали появление формы;
- анимировали кнопку с помощью псевдоэлемента hover и CSS-свойства border-radius;
- создали анимацию для логотипа и научились её вызывать!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- сделаем footer сайта;
- познакомимся с новыми значениями свойства justify-content;
- научимся делать кликабельное меню сайта;
- сделаем анимацию для меню!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1HtMP172HL4gSeRajw6Qe1cvsIVnewNEF?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1n24v2QpbteQzN45M5aNpwP9IB5lU5Kwk?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSexNrfuw0SWTE9_HEME4GmbUMUaNasF7c3xkYVXj0o_q_ABNQ/viewform

Сегодня у нас прошёл урок №11 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- сделали footer сайта;
- познакомились с новыми значениями свойства justify-content;
- научились делать кликабельное меню сайта;
- сделали анимацию для меню!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое адаптивность сайта;
- адаптируем наш сайт под мобильные устройства!`,
      '12 урок': `Сегодня у нас прошёл урок №12 модуля HTML, CSS, JavaScript.
На нём мы с вами:
- узнали, что такое адаптивность сайта;
- адаптировали наш сайт под мобильные устройства!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле HTML, CSS, JavaScript!
На уроке мы:
- добавим отправку формы на сайте;
- доработает сайт;
- подведём итоги модуля!`,
      '13 урок': `Сегодня у нас прошёл последний урок (№13) модуля HTML, CSS, JavaScript.
На нём мы с вами:
- добавили отправку формы на сайте;
- доработали сайт;
- подвели итоги модуля!


Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - Python!
Python - это универсальный язык программирования, на котором пишут программы под все самые известные платформы: Mac OS, Windows, IOS, Android. На модуле мы изучим основы языка программирования Python, создадим игры "Камень, ножницы бумага" и "Арканоид". А также сделаем голосовой помощник, который будет распознавать нашу речь и отвечать нам голосом, а также открывать файлы и ссылки и даже советовать фильмы!
На следующем уроке мы:
- познакомимся с языком программирования Python;
- узнаем об основных понятиях в программировании;
- познакомимся с встроенной функцией print();
- научимся объявлять переменные в Python и работать с ними;
- научимся работать с IDLE!

К следующему занятию, пожалуйста, установите на свой компьютер Python! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Python:
https://docs.google.com/document/d/11Po6XmHRquu7W8Cg3dySumNkM-4pu2v7V1PNMeeqT7w/edit?usp=sharing`
    },
    'Python': {
      '1 урок': `Заготовка
https://drive.google.com/drive/folders/1zjTJX60y7XHrlcyoqm3orKYwLn_t81R5?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdinIDQGuBxVS-fn-qWz_yIeJrH73vFQTDRns9AxkZSMdu5lA/viewform

Сегодня у нас прошёл урок №1 модуля Python.
На нём мы с вами:
- познакомились с языком программирования Python;
- узнали об основных понятиях в программировании;
- познакомились с встроенной функцией print();
- научились объявлять переменные в Python и работать с ними;
- научились работать с IDLE!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся пользоваться встроенной функцией input();
- познакомимся с операторами сравнения в Python;
- познакомимся с типом данных bool;
- научимся пользоваться условными конструкциями;
- научимся приведению типа;
- напишем свою первую программу!`,
      '2 урок': `Заготовка
https://drive.google.com/drive/folders/1xqfuNm2uw-BQ560PBP5vw07oHOu7tI-r?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1Lp4wjclmy_voLe3K6dkQsMTWkKJLCXY3?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdtqlw74pCRg0JS-zCteoIu1XMDtNbCR7czv7z3jHG_M-_WZg/viewform

Сегодня у нас прошёл урок №2 модуля Python.
На нём мы с вами:
- научились пользоваться встроенной функцией input();
- познакомились с операторами сравнения в Python;
- познакомились с типом данных bool;
- научились пользоваться условными конструкциями;
- научились приведению типа;
- написали свою первую программу!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся пользоваться списками в Python;
- познакомимся с модулями в Python;
- научимся применять модуль random;
- научимся приводить строки к верхнему и нижнему регистру с помощью методов upper() и lower();
- познакомимся с циклом while, создадим бесконечный цикл и научимся его прерывать!`,
      '3 урок': `Заготовка
https://drive.google.com/drive/folders/1Fmm2mg2TNixbJiTD0zN97nuNh7PYCdxO?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/10Iewbxu8vIj4LjmE46MUP1iSXQOsatWx?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSebPjMA-WlYEx5QGHON3_KxttFW6sf1tGONYMuZqA-ocwiGSg/viewform

Сегодня у нас прошёл урок №3 модуля Python.
На нём мы с вами:
- научились пользоваться списками в Python;
- познакомились с модулями в Python;
- научились применять модуль random;
- научились приводить строки к верхнему и нижнему регистру с помощью методов upper() и lower();
- познакомились с циклом while, создали бесконечный цикл и научились его прерывать!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- актуализируем знания, полученные на предыдущих уроках;
- создадим игру "Камень, ножницы, бумага"!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1Lzsery_FeJ2J9jGGw67Q7HtLfIfgq7ND?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1WwoLK_7BzWFxpxdbPilATXhuU1XPqNmb?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScUus07wDKMfvOO5QkiKEc5pGPH1difm4p8_J1w3mSNFz9ydA/viewform


Сегодня у нас прошёл урок №4 модуля Python.
На нём мы с вами:
- актуализировали знания, полученные на предыдущих уроках;
- создали игру "Камень, ножницы, бумага"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с функциями в Python;
- научимся создавать функции;
- научимся пользоваться аргументами функции;
- научимся возвращать из функции значение с помощью оператора return!`,
      '5 урок': `Заготовка
https://drive.google.com/drive/folders/19u8XsmVPg9YXSa7ed3SXmOdRlPIdfqrq?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1mG0lpLqHwewtNSrT1SiF4nMe7PM48z3y?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScGRcBNvfnTkZVELoML9AG6k489WiD38EL-n7hMgKX3qdUsgg/viewform

Сегодня у нас прошёл урок №5 модуля Python.
На нём мы с вами:
- познакомились с функциями в Python;
- научились создавать функции;
- научились пользоваться аргументами функции;
- научились возвращать из функции значение с помощью оператора return!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с модулем tkinter и научимся им пользоваться;
- научимся создавать кнопки и программировать их;
- узнаем, что такое canvas и научимся на нём рисовать с помощью кода;
- научимся перемещать нарисованные фигуры по canvas;
- научимся делать покадровую анимацию с помощью цикла while!`,
      '6 урок': `Заготовка
https://drive.google.com/drive/folders/1ruTqBNvG1nmhgRvJQshMhUuH7DkEwisI?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1AEm-Ac-cgH4LWJENNStPOX7W48wR8I8i?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSeeXiefVN5tt97KEi3XA1OJJ_3q1qRiSecqbimp-pOFD2fQ6w/viewform

Сегодня у нас прошёл урок №6 модуля Python.
На нём мы с вами:
- познакомились с модулем tkinter и научились им пользоваться;
- научились создавать кнопки и программировать их;
- узнали, что такое canvas и научились на нём рисовать с помощью кода;
- научились перемещать нарисованные фигуры по canvas;
- научились делать покадровую анимацию с помощью цикла while!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с объектно-ориентированным программированием;
- познакомимся с классами в Python;
- научимся создавать и применять методы классов;
- научимся создавать объекты класса и применять к ним методы;
- познакомимся с наследованием классов!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1ONpWRhEVIRkZ6aS5LO0tGAOXE2gpseHI?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1l48pPa99hMicqLq3cXytZxzgs5xDKtaY?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSfIVpuxGkluWtRdyRKGBU4CVSXW6FF1jPKYd45-lUJD8aBKdA/viewform

Сегодня у нас прошёл урок №7 модуля Python.
На нём мы с вами:
- познакомились с объектно-ориентированным программированием;
- познакомились с классами в Python;
- научились создавать и применять методы классов;
- научились создавать объекты класса и применять к ним методы;
- познакомились с наследованием классов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с псевдокодом будущей игры "Арканоид";
- создадим холст для игры с помощью tkinter;
- создадим мяч на холсте;
- заставим мяч двигаться вверх с помощью цикла while;
- сделаем 30% игры!`,
      '8 урок': `Заготовка
https://drive.google.com/drive/folders/1vlX9WwGdph6rQ_oBEtEeTDoaBquhPfky?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1LU-Q5GpvXP-9j3zBadIE7svljJv0CrIL?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSe1aO44lbHbBiN-tHzW1DWQI5MQyI4xqW_rtPVnCc60hlYLtQ/viewform


Сегодня у нас прошёл урок №8 модуля Python.
На нём мы с вами:
- познакомились с псевдокодом будущей игры "Арканоид";
- создали холст для игры с помощью tkinter;
- создали мяч на холсте;
- заставили мяч двигаться вверх с помощью цикла while;
- сделали 30% игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- глубже познакомимся с координатами в canvas;
- запрограммируем отскоки мяча от краёв холста;
- зададим мячу случайное движение с помощью списка и модуля random;
- создадим платформу и отобразим её в нужной части холста;
- сделаем ещё 30% игры!`,
      '9 урок': `Заготовка
https://drive.google.com/drive/folders/1BCnSP9SHZCBIx4_0y3T5EtCJ_9Of4Sow?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1ntBk2xZiW5ZePXWQVc7NbkamuTGEC_6-?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScMvyR_lQthx1G2w6wkRug_oY9gfBwKr1SBBS1CQeFXIDNHhg/viewform

Сегодня у нас прошёл урок №9 модуля Python.
На нём мы с вами:
- глубже познакомились с координатами в canvas;
- запрограммировали отскоки мяча от краёв холста;
- задали мячу случайное движение с помощью списка и модуля random;
- создали платформу и отобразили её в нужной части холста;
- сделали ещё 30% игры!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся привязывать методы к нажатию клавиш на клавиатуре;
- запрограммируем отскоки мяча от платформы;
- реализуем окончание игры при достижении мячом дна;
- закончим игру "Арканоид"!`,
      '10 урок': `Заготовка
https://drive.google.com/drive/folders/1_fUY0xeXmwycrCTmMICufM_ey2KTHFdb?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1LOhzbzgXRykxeaXMP3e07U3mRnMslSs9?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScPXBubfytkVlHSsT7IcJ6rqTxSjNAjBDr0xiCv0UuCazNJAA/viewform

Сегодня у нас прошёл урок №10 модуля Python.
На нём мы с вами:
- научились привязывать методы к нажатию клавиш на клавиатуре;
- запрограммировали отскоки мяча от платформы;
- реализовали окончание игры при достижении мячом дна;
- закончили игру "Арканоид"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся устанавливать нестандартные модули в Python;
- познакомимся с модулем speech_recognition и научимся распознавать речь;
- познакомимся с ключевыми словами with и as и научимся их применять;
- сделаем половину голосового помощника!`,
      '11 урок': `Заготовка
https://drive.google.com/drive/folders/1yKa3-Dk2PZVI07hJjzbkoos3f-yk1W-h?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1fTJbMGA7reJmHFaMyhuE0EEdmjx3scIZ?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdGSXi0h1fLDqi2T4bJ9I3vfa8kVvYAg63myOWONGR5QvKygA/viewform

Сегодня у нас прошёл урок №11 модуля Python.
На нём мы с вами:
- научились устанавливать нестандартные модули в Python;
- познакомились с модулем speech_recognition и научились распознавать речь;
- познакомились с ключевыми словами with и as и научились их применять;
- сделали половину голосового помощника!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся открывать файлы с помощью модуля os;
- познакомимся с ключевым словом in и научим помощника реагировать на длинные предложения по ключевому слову;
- научим помощника общаться голосом с помощью модуля pyttsx3;
- доработаем голосового помощника и закончим его!`,
      '12 урок': `Заготовка
https://drive.google.com/drive/folders/1Z_i0Bf9f-yZyGrm6altiaXhmPurjGIpr?usp=sharing

Готовый проект
https://drive.google.com/drive/folders/1FmekPlsPtlrt-bGL_Wc9yg1kuGDSZ9Jo?usp=sharing

Тест
https://docs.google.com/forms/d/e/1FAIpQLScZXoyqegPv7ztiDBsSJFf3hNxL1jCJJUmrryEAEem4qcmhhw/viewform

Сегодня у нас прошёл урок №12 модуля Python.
На нём мы с вами:
- научились открывать файлы с помощью модуля os;
- познакомились с ключевым словом in и научили помощника реагировать на длинные предложения по ключевому слову;
- научили помощника общаться голосом с помощью модуля pyttsx3;
- доработали голосового помощника и закончили его!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- повторим цикл while;
- узнаем, как работает цикл for и научимся его использовать;
- познакомимся со словарями!`,
      '13 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSd5IjM3MqJ7gU-1FGIW7YULK7jlZz2f5dfZI4Q6G8b6R_1Kng/viewform

Сегодня у нас прошёл урок №13 модуля Python.
На нём мы с вами:
- повторили цикл while;
- узнали, как работает цикл for и научились его использовать;
- познакомились со словарями!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся подключать модули;
- создадим основу для чат-бота, которая отвечает на сообщения "привет" и "пока"!`,
      '14 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSf-pMrKYk4cVX8s2vpErmzrKrP2rsF2r1SScC5TyZwh84Nf8Q/viewform

Сегодня у нас прошёл урок №14 модуля Python.
На нём мы с вами:
- научились подключать модули;
- создали основу для чат-бота, которая отвечает на сообщения "привет" и "пока"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся делать случайную паузу перед отправкой сообщения;
- научимся искать нужные слова в сообщении;
- научимся группировать условия с помощью логических операторов!`,
      '15 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSe2uN-EMw8ZeWIWIkm1_x8Y3Nr7auAvjbEFQNnT_YlM6FRKHw/viewform


Сегодня у нас прошёл урок №15 модуля Python.
На нём мы с вами:
- научились делать случайную паузу перед отправкой сообщения;
- научились искать нужные слова в сообщении;
- научились группировать условия с помощью логических операторов!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научим бота отправлять стикеры, изображения и музыку!`,
      '16 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSeTvjpMP6lBWZlzgO1itjXDZMeU4l1D_yoNZroc5I1OZ-DS0g/viewform

Сегодня у нас прошёл урок №16 модуля Python.
На нём мы с вами:
- научили бота отправлять стикеры, изображения и музыку!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- узнаем, что такое кортежи и научимся их использовать;
- научимся применять рандомный ответ из кортежа для разных функций бота;
- создадим функцию отправки случайного мема!`,
      '17 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSc1JOL0fqPiSPZFlPeOUaVXq-83Cdv3ekbXgdmuXV4ZiojPEw/viewform

Сегодня у нас прошёл урок №17 модуля Python.
На нём мы с вами:
- узнали, что такое кортежи и научились их использовать;
- научились применять рандомный ответ из кортежа для разных функций бота;
- создали функцию отправки случайного мема!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Python!
На уроке мы:
- создадим функцию выбора фильма для просмотра;
- доработаем функционал бота!`,
      '18 урок': `Тест
https://docs.google.com/forms/d/e/1FAIpQLSeTvjpMP6lBWZlzgO1itjXDZMeU4l1D_yoNZroc5I1OZ-DS0g/viewform

Сегодня у нас прошёл последний урок (№18) модуля Python.
На нём мы с вами:
- создали функцию выбора фильма для просмотра;
- доработали функционал бота!

Все ребята молодцы, отлично справились с заданиями!

А уже на следующем уроке у нас начнётся новый модуль - Создание приложений на Android!
На модуле мы познакомимся с языком программирования Java и сделаем 2 приложения под Android, в среде разработки Intellij IDEA. Java - очень популярный язык программирования. Он используется в огромном количестве сфер человеческой деятельности. На нём разрабатываются приложения для Android, различные веб-утилиты для сайтов, проводятся научные вычисления, создаются программы для торговли ценными бумагами.

На следующем уроке мы:
- познакомимся с языком программирования Java;
- научимся работать с IntelliJ IDEA;
- познакомимся со структурой Java проекта;
- научимся выводить информацию в консоль с помощью метода println();
- научимся объявлять переменные в Java и работать с ними!

К следующему занятию, пожалуйста, установите на свой компьютер Intellij IDEA! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Intellij IDEA:
https://docs.google.com/document/d/10-ElONIcLR09StLlIpWFlTXTytuHNWk0fA08b4Xv6kA/edit?usp=sharing`
    },
    'Android - Java': {
      '1 урок': `Готовый проект
https://drive.google.com/drive/folders/1wfOaf-Ua-N_d2SeOSps6UsyBWgsRwcgM?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSewh3wOWRapysWYtOqDhMhdFviyevMoo3FcCF4g1uujNHFRSg/viewform?usp=sf_link

Сегодня у нас прошёл урок №1 модуля Android - Java.
На нём мы с вами:
- познакомились с языком программирования Java;
- научились работать с IntelliJ IDEA;
- познакомились со структурой Java проекта;
- научились выводить информацию в консоль с помощью метода println();
- научились объявлять переменные в Java и работать с ними!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся импортировать классы и пакеты в проект;
- познакомимся с классом Scanner;
- научимся получать данные от пользователя с помощью методов класса Scanner;
- поработаем с операторами сравнения и типом данных boolean;
- научимся создавать условные конструкции if в Java и работать с ними!`,
      '2 урок': `Готовый проект
https://drive.google.com/drive/folders/1oSZ_cWiU0v8U9X4RTvIe18Fz8X96sUyP?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSc7nIOWMpcrAW4GJPoSIbmeGq4DSRMH5UMG9Xp3PrA7xv6ATw/viewform?usp=sf_link


Сегодня у нас прошёл урок №2 модуля Android - Java.
На нём мы с вами:
- научились импортировать классы и пакеты в проект;
- познакомились с классом Scanner;
- научились получать данные от пользователя с помощью методов класса Scanner;
- поработали с операторами сравнения и типом данных boolean;
- научились создавать условные конструкции if в Java и работать с ними!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с массивами в Java и научимся с ними работать;
- научимся создавать пустые массивы и наполнять их;
- познакомимся с циклом for и научимся им пользоваться;
- научимся заполнять пустой массив значениями с помощью цикла for!`,
      '3 урок': `Готовый проект
https://drive.google.com/drive/folders/1MspXJsZD2I8EQ1IE3DUB4USqeofVcypr?usp=sharing

Тест
docs.google.com/forms/d/e/1FAIpQLSc2WEvEaBixrE0BriTINHXtiRo63vadYDo_lIP9kF1Dek2s5w/viewform?usp=sf_link


Сегодня у нас прошёл урок №3 модуля Android - Java.
На нём мы с вами:
- познакомились с массивами в Java и научились с ними работать;
- научились создавать пустые массивы и наполнять их;
- познакомились с циклом for и научились им пользоваться;
- научились заполнять пустой массив значениями с помощью цикла for!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать Android проект в IntelliJ IDEA и познакомимся с его ключевыми файлами;
- познакомимся с языком разметки XML;
- научимся работать с внешним видом приложения в файле activity_main.xml;
- научимся тестировать приложение на эмуляторе;
- научимся программировать кнопки с помощью Java;
- создадим своё первое приложение на Android!`,
      '4 урок': `Заготовка
https://drive.google.com/drive/folders/1zcm0nzGAfAHfdaS4lZbie_VK1mcDQyWX?usp=sharing

Готовый проект
https://disk.yandex.ru/d/GVSVY1r1tIPYKA

Тест
docs.google.com/forms/d/e/1FAIpQLScy-RqhKlS7qxx8gGgPtxUlsNpEHb7Tmtn8OTyfj2To0aRneQ/viewform?usp=sf_link


Сегодня у нас прошёл урок №4 модуля Android - Java.
На нём мы с вами:
- научились создавать Android проект в IntelliJ IDEA и познакомились с его ключевыми файлами;
- познакомились с языком разметки XML;
- научились работать с внешним видом приложения в файле activity_main.xml;
- научились тестировать приложение на эмуляторе;
- научились программировать кнопки с помощью Java;
- создали своё первое приложение на Android!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим android-проект Calculator и начнём в нём работу;
- познакомимся с табличными контейнерами;
- научимся создавать ряды кнопок;
- научимся создавать сложные интерфейсы;
- создадим внешний вид приложения "Калькулятор"!`,
      '5 урок': `Готовый проект
https://disk.yandex.ru/d/LktQmx0fpk36-g

Тест
docs.google.com/forms/d/e/1FAIpQLSdIW9cC1d5KgNIj989LBYn_YNTIHUrjqbrMEBeksrcko7AIFw/viewform?usp=sf_link


Сегодня у нас прошёл урок №5 модуля Android - Java.
На нём мы с вами:
- создали android-проект Calculator и начнём в нём работу;
- познакомились с табличными контейнерами;
- научились создавать ряды кнопок;
- научились создавать сложные интерфейсы;
- создали внешний вид приложения "Калькулятор"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся программировать сложные интерфейсы;
- научимся создавать методы;
- напишем логику приложения "Калькулятор";
- познакомимся с преобразованием типов в Java;
- закончим приложение "Калькулятор"!`,
      '6 урок': `Заготовка
https://disk.yandex.ru/d/nyO8YMv-adym4g

Готовый проект
https://disk.yandex.ru/d/vY1gSxiFsNyOmg

Тест
https://docs.google.com/forms/d/e/1FAIpQLSdYAQesZJCC9x2NKyC-jxObEIWoPswK36bMMeU0yL2b32az_g/viewform


Сегодня у нас прошёл урок №6 модуля Android - Java.
На нём мы с вами:
- научились программировать сложные интерфейсы;
- научились создавать методы;
- написали логику приложения "Калькулятор";
- познакомились с преобразованием типов в Java;
- закончили приложение "Калькулятор"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- создадим Android-проект Quiz и начнём в нём работу;
- повторим компоненты интерфейса приложения;
- повторим атрибуты компонентов;
- научимся объявлять сразу несколько переменных одного типа данных;
- сделаем внешний вид приложения "Викторина"!`,
      '7 урок': `Заготовка
https://drive.google.com/drive/folders/1BBG5WHmEC3IykEJhXxvvmH4kfI45wih-?usp=sharing

Готовый проект
https://disk.yandex.ru/d/a-1qB7zu_lF2jw

Тест
docs.google.com/forms/d/e/1FAIpQLScVLIdphCt0adF1JSAkQHbJhKL8ODvDV5V88ty26ieHM28XAw/viewform?usp=sf_link


Сегодня у нас прошёл урок №7 модуля Android - Java.
На нём мы с вами:
- создали Android-проект Quiz и начали в нём работу;
- повторили компоненты интерфейса приложения;
- повторили атрибуты компонентов;
- научились объявлять сразу несколько переменных одного типа данных;
- сделали внешний вид приложения "Викторина"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- научимся создавать новые классы для приложения;
- познакомимся с многомерными массивами;
- научимся доставать элементы из многомерных массивов;
- научимся создавать методы, возвращающие значения;
- познакомимся с ключевым словом return;
- создадим класс с вопросами и ответами для нашего приложения "Викторина"!`,
      '8 урок': `Заготовка
https://disk.yandex.ru/d/a-1qB7zu_lF2jw

Готовый проект
https://disk.yandex.ru/d/2y04d6AtB6YN5g

Тест
docs.google.com/forms/d/e/1FAIpQLSe97doFt-4MBVD4L7pw7lzDtxcwlUZUBBJb_DtRhG1O_cQsOw/viewform?usp=sf_link


Сегодня у нас прошёл урок №8 модуля Android - Java.
На нём мы с вами:
- научились создавать новые классы для приложения;
- познакомились с многомерными массивами;
- научились доставать элементы из многомерных массивов;
- научились создавать методы, возвращающие значения;
- познакомились с ключевым словом return;
- создали класс с вопросами и ответами для нашего приложения "Викторина"!

Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле Android - Java!
На уроке мы:
- познакомимся с классом Random в Java;
- запрограммируем кнопки приложения;
- научимся убирать компоненты с экрана;
- научимся менять компонентам событие onClick; 
- научимся перезапускать приложение;
- закончим приложение "Викторина"!`,
      '9 урок': `Заготовка
https://disk.yandex.ru/d/2y04d6AtB6YN5g

Готовый проект
https://disk.yandex.ru/d/d-N6dbW2mGOppw

Тест
docs.google.com/forms/d/e/1FAIpQLScxFCvAojYyTHcK7ryMK6w4ylt7oR8pMxCGqc1HZNngqXfgRw/viewform?usp=sf_link

Сегодня у нас прошёл последний урок (№9) модуля Android - Java.
На нём мы с вами:
- познакомились с классом Random в Java;
- запрограммировали кнопки приложения;
- научились убирать компоненты с экрана;
- научились менять компонентам событие onClick; 
- научились перезапускать приложение;
- закончили приложение "Викторина"!

Все ребята молодцы, отлично справились с заданиями!`
    },
    'Godot': {
      '1 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №1 модуля Godot. На нём мы с вами:
- познакомились с игровым движком Godot;
- изучили интерфейс программы;
- создали персонажа и добавили ему скрипт;
- научили персонажа двигаться!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- познакомимся с построением уровней в Godot;
- создадим свой первый уровень!`,
      '2 урок': `Готовый проект
Тест
Заготовка


Сегодня у нас прошёл урок №2 модуля Godot. На нём мы с вами:
- познакомились с картой тайлов и научились строить уровни с её помощью;
- узнали, что такое Z-индекс и как он влияет на отображение объектов;
- познакомились с понятием переменной в программировании;
- создали интересный уровень для нашего игрока!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим анимации нашему персонажу;
- научим игрока собирать монетки!`,
      '3 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №3 модуля Godot. На нём мы с вами:
- узнали, чем отличаются узлы Sprite2D и AnimatedSprite2D;
- познакомились с узлом Area2D и узнали, за что он отвечает;
- узнали, что такое функция и что такое сигнал;
- запрограммировали сбор монеток игроком;
- поработали с анимациями персонажа!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- запрограммируем поражение в нашей игре;
- добавим ловушки!`,
      '4 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №4 модуля Godot. На нём мы с вами:
- узнали, что такое ссылка в Godot и как её использовать;
- познакомились с командой await и разобрались, за что она отвечает;
- научились воспроизводить звуки прямо в игре;
- добавили звуки в наш проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- добавим сцену победы в нашу игру;
- поработаем с пользовательским интерфейсом!`,
      '5 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №5 модуля Godot. На нём мы с вами:
- познакомились с пользовательским интерфейсом в Godot;
- узнали, за что отвечает узел Control;
- узнали, какой узел отвечает за отображение текста в игре;
- добавили кнопки в наш проект;
- узнали, какая команда позволяет изменить сцену в игре!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- узнаем, что такое примитивы и как они используются в 3D;
- построим свой первый 3D-уровень!`,
      '6 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №6 модуля Godot. На нём мы с вами:
- узнали, что такое примитивы и как они используются в 3D;
- познакомились с функцией Process и разобрались, что она делает;
- узнали, как работает команда Delta;
- построили свой первый 3D-уровень!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- завершим наш 3D-проект;
- добавим интерфейс и условия победы!`,
      '7 урок': `Готовый проект
Тест
Заготовка

Сегодня у нас прошёл урок №7 модуля Godot. На нём мы с вами:
- добавили счётчик собранных сокровищ;
- узнали, что такое функция str() и как она работает;
- разобрались, что позволяет делать команда get_parent();
- познакомились с условиями в программировании;
- завершили наш 3D-проект!
Все ребята молодцы, отлично справились с заданиями!
На следующем уроке мы:
- начнём разработку собственного проекта!`,
      '8 урок': `Сегодня у нас прошёл урок №8 модуля Godot.
На нём мы с вами:

- начали работать над собственным проектом!


Все ребята молодцы, отлично справились с заданиями!

Следующий урок будет последним на модуле High Godot!
На уроке мы:

- доработаем проекты и проведём защиту;
- подведём итоги модуля!`,
      '9 урок': `Сегодня у нас прошёл последний урок (№9) модуля Godot.
На нём мы с вами:
- доработали проекты и провели защиту;
- подвели итоги модуля!

Все ребята молодцы, отлично справились со своими проектами!
Отдельно хочу отметить … (приложите также скриншоты проектов)

А уже на следующем уроке у нас начнётся новый модуль - JavaScript!
JavaScript - это настоящий язык программирования, который очень популярен во всём мире. На этом модуле мы сделаем игры: "Акинатор", "Викторину" и "Шар судьбы"! А также каждый из вас создаст свою веб-страничку (мини-сайт) по любимой игре и реализует на нём викторину!
На следующем уроке мы:
- узнаем, что такое Javascript;
- узнаем, что такое "память компьютера" и какая она бывает, что такое "операторы" и "типы данных";
- познакомимся с HTML и создали свою первую страничку!

К следующему занятию, пожалуйста, установите на свой компьютер Visual Studio Code! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Visual Studio Code: 
https://docs.google.com/document/d/1OcXlaH3LKw6rvbKDascR_CGONlabDgMcKVqCAxN4GmM/edit?usp=sharing`
    }
  },
  'Нейросети': {
    'первый': {
      '1 урок': `Сегодня у нас прошёл урок №1 курса Нейросети.
На нём мы:
- познакомились с понятиями "искусственный интеллект", "нейронные сети";
- познакомились с нейросетями для генерации текста YandexGPT и Perplexity;
- научились писать простые запросы для генерации текста!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с понятием "галлюцинации нейросетей";
- узнаем, как можно использовать нейросети для обучения;
- создадим викторину по любимой игре с помощью нейросети в Google Формах!`,
      '2 урок': `Сегодня у нас прошёл урок №2 курса Нейросети.
На нём мы:
- познакомились с понятием "галлюцинации нейросетей";
- узнали, как можно использовать нейросети для обучения;
- создали викторину по любимой игре с помощью нейросети в Google Формах.

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с понятиями "промпт" и "промпт-инженер";
- познакомимся с нейросетью GigaChat;
- узнаем, что такое "стандартный промпт", "промпт с описанием контекста" и "промпт-инструкция"!`,
      '3 урок': `Сегодня у нас прошёл урок №3 курса Нейросети.
На нём мы:
- познакомились с понятиями "промпт" и "промпт-инженер";
- познакомились с нейросетью GigaChat;
- узнали, что такое "стандартный промпт", "промпт с описанием контекста" и "промпт-инструкция"!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- узнаем, что такое "промпт с примером" и "промпт с использованием роли";
- познакомимся с форматами ответа нейросетей:
- научимся пользоваться конструктором промптов:
- сравним работу Perplexity, YandexGPT и GigaChat: проверим, смогут ли детекторы искусственного интеллекта понять, что это текст сгенерирован нейросетью!`,
      '4 урок': `Сегодня у нас прошёл урок №4 курса Нейросети.
На нём мы:
- узнали, что такое промпт с примером и промпт с использованием роли;
- познакомились с форматами ответа нейросетей:
- научились пользоваться конструктором промптов:
- сравнили работу Perplexity, YandexGPT и GigaChat: проверили, могут ли детекторы искусственного интеллекта понять, что это текст сгенерирован нейросетью!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с нейросетью для генерации изображений - Kandinsky;
- научилимся писать промпты для генерации изображений;
- научимся генерировать изображения в разных стилях!`,
      '5 урок': `Сегодня у нас прошёл урок №5 курса Нейросети.
На нем мы:
- познакомились с нейросетью для генерации изображений - Kandinsky.
- научились писать промпты для генерации изображений.
- научились генерировать изображения в разных стилях.

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с понятием "негативный промпт";
- научимся изменять свои и сгенерированные изображения!`,
      '6 урок': `Сегодня у нас прошёл урок №6 курса Нейросети.
На нем мы:
- познакомились с понятием "негативный промпт";
- научились изменять свои и сгенерированные изображения!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с режимами работы бота Kandinsky в Телеграм: смешивание, перенос стиля, вариации, создание стикеров;
- научимся создавать стикерпаки для Telegram!`,
      '7 урок': `Сегодня у нас прошёл урок №7 курса Нейросети.
На нем мы:
- познакомились с режимами работы бота Kandinsky в Телеграм: смешивание, перенос стиля, вариации, создание стикеров;
- научились создавать стикерпаки для Telegram!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- напишем собственный рассказ в Perplexity;
- познакомимся с модификаторами промптов;
- проиллюстрируем рассказ;
- создадим флипбук с рассказом!`,
      '8 урок': `Сегодня у нас прошёл урок №8 курса Нейросети.
На нем мы:
- написали собственный рассказ в Perplexity;
- познакомились с модификаторами промптов;
- проиллюстрировали рассказ;
- создали флипбук с рассказом!

Все ребята молодцы, отлично справились с заданиями!

А на следующем занятии мы:
- познакомимся с сервисами для создания музыки и песен: Suno и GigaChat;
- научимся озвучивать текст с помощью нейросети;
- создадим видеоролик с кратким пересказом своего рассказа!`,
      '9 урок': `Сегодня у нас прошёл урок №9 курса Нейросети.
- познакомились с сервисами для создания музыки и песен: Suno и GigaChat;
- научились озвучивать текст с помощью нейросети;
- создали видеоролик с кратким пересказом своего рассказа!

Все ребята молодцы, отлично справились с заданиями!

А на следующем занятии мы:
- познакомимся с сервисом для генерации презентаций;
- создадим свои презентации с помощью нейросетей!`,
      '10 урок': `Сегодня у нас прошёл урок №10 курса Нейросети.
На нем мы:
- познакомились с сервисом для генерации презентаций;
- создали свои презентации с помощью нейросетей!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с основными понятиями в программировании;
- познакомимся с языком программирования Python;
- научимся программировать с помощью нейросети;
- создадим две игры: "Камень, ножницы, бумага" и "Змейка"!

Python - это универсальный язык программирования, на котором пишут программы под все самые известные платформы: Mac OS, Windows, IOS, Android. 
К следующему уроку обязательно установите на свой компьютер Python! Напоминаю, что за самостоятельную установку ПО я награждаю 10 КодКойнами! 
Инструкция по установке Python: https://docs.google.com/document/d/11Po6XmHRquu7W8Cg3dySumNkM-4pu2v7V1PNMeeqT7w/edit?tab=t.0`,
      '11 урок': `Сегодня у нас прошёл урок №11 курса Нейросети.
На нем мы:
- познакомились с основными понятиями в программировании;
- познакомились с языком программирования Python;
- научились программировать с помощью нейросети;
- создали две игры: "Камень, ножницы, бумага" и "Змейка"!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- продолжим программировать с помощью нейросети;
- создадим игру "Пинг-понг"!`,
      '12 урок': `Сегодня у нас прошёл урок №12 курса Нейросети.
На нем мы:
- продолжили программировать с помощью нейросети;
- создали игру "Пинг-понг"!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с НТМL, СSS и JavaScript;
- научимся писать код сайта с помощью нейросети;
- напишем код сайта с игрой "Камень, ножницы, бумага";
- начнём писать код сайта про любимую игру!`,
      '13 урок': `Сегодня у нас прошёл урок №13 курса Нейросети.
На нем мы:
- познакомились с НТМL, СSS и JavaScript;
- научились писать код сайта с помощью нейросети;
- написали код сайта с игрой "Камень, ножницы, бумага";
- начали писать код сайта про любимую игру!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- научимся добавлять на сайт разные элементы: изображения, видео и викторину;
- закончим сайт про любимую игру!`,
      '14 урок': `Сегодня у нас прошёл урок №14 курса Нейросети.
На нем мы:
- научились добавлять на сайт разные элементы: изображения, видео и викторину;
- закончили сайт про любимую игру!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- узнаем, что такое "чат-бот";
- узнаем, что такое "сообщество VK";
- научимся создавать ботов для VK!`,
      '15 урок': `Сегодня у нас прошёл урок №15 курса Нейросети.
На нем мы:
- узнали, что такое "чат-бот";
- узнали, что такое "сообщество VK";
- научились создавать ботов для VK!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- продолжим работу в BotMan;
- создадим чат-бот с текстовым квестом с помощью нейросетей!`,
      '16 урок': `Сегодня у нас прошёл урок №16 курса Нейросети.
На нем мы:
- продолжили работу в BotMan;
- создали чат-бот с текстовым квестом с помощью нейросетей!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы
- познакомимся с понятиями "Блог", "Ниша блога", "Целевая аудитория";
- выберем тему для своего блога;
- создадим логотип и обложку для своего Rutube канала!`,
      '17 урок': `Сегодня у нас прошёл урок №17 курса Нейросети.
На нем мы:
- познакомились с понятиями "Блог", "Ниша блога", "Целевая аудитория";
- выбрали тему для своего блога;
- создали логотип и обложку для своего Rutube канала!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- создадим и оформили канал на Rutube;
- узнаем, для чего нужен контент-план и составим его для своего канала!`,
      '18 урок': `Сегодня у нас прошёл урок №18 курса Нейросети.
На нем мы:
- создали и оформили канал на Rutube;
- узнали, для чего нужен контент-план и составим его для своего канала!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с понятием "Сценарий";
- научимся создавать видео с помощью нейросети!`,
      '19 урок': `Сегодня у нас прошёл урок №19 курса Нейросети.
На нем мы:
- познакомились с понятием "Сценарий";
- научились создавать видео с помощью нейросети!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с понятием "Хештег";
- научимся загружать видео на Rutube канал;
- подведём итоги курса!`,
      '20 урок': `Сегодня у нас прошёл последний урок №20 курса Нейросети.
На нем мы:
- познакомились с понятием "Хештег";
- научились загружать видео на Rutube канал;
- подвели итоги курса!

Справочник по нейросетям и сервисам: https://drive.google.com/file/d/1kklsu0Ij0oRGBfbxHkeol4fn6zkNg7Zd/view 

Все ребята молодцы, отлично справились с заданиями!`
    },
    'второй': {
      '21 урок': `Сегодня у нас прошёл урок №1 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нём мы:
- познакомились с нейросетью DeepSeek;
- познакомились с техниками формирования промптов;
- познакомились с продвинутыми техниками "Few-Shot", "Chain-of-Thought" и "ReAct";
- научились писать промпты с использованием продвинутых техник!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с платформой Fireworks AI;
- познакомимся с настройками генерации;
- научимся писать промпты с использованием настроек генерации!`,
      '22 урок': `Сегодня у нас прошёл урок №2 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нём мы:
- познакомились с платформой OpenRouter AI;
- познакомились с настройками генерации;
- познакомились с понятиями "Temperature", "Top-k", "Top-p", "Penalty";
- научились писать промпты с использованием настроек генерации!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с нейросетью для генерации изображений;
- научимся писать детализированные ТЗ для нейросети;
- познакомимся с правилами композиции и кадрированием;
- создадим серию уникальных изображений, контролируя стиль, композицию, освещение и детализацию!`,
      '23 урок': `Сегодня у нас прошёл урок №3 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нём мы:
- познакомились с нейросетью для генерации изображений Qwen;
- научились писать детализированные ТЗ для нейросети;
- познакомились с правилами композиции и кадрированием;
- познакомились с "готовым" освещением;
- создали серию уникальных изображений, контролируя стиль, композицию, освещение и детализацию!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- продолжим работу с нейросетью Qwen;
- повторим техники продвинутых промптов;
- сгенерируем серию уникальных изображений!`,
      '24 урок': `Сегодня у нас прошёл урок №4 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нём мы:
- закрепили навык работы с нейросетью Qwen;
- познакомились с понятием "эмбеддинг";
- повторили техники продвинутых промптов Few-Shot, Chain-of-Thought и ReAct;
- создали серию уникальных изображений, используя техники продвинутых промптов!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с нейросетями для генерации анимаций и видео;
- научимся писать детальные промпты для генерации анимаций и видео!`,
      '25 урок': `Сегодня у нас прошёл урок №5 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с нейросетями для генерации анимаций и видео;
- познакомились с техниками Text-to-Video и Image-to-Video;
- научились писать детальные промпты для генерации анимаций и видео;
- создали серию анимаций и видео при помощи нейросетей!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с нейросетями для обработки видео;
- научимся обрабатывать видео!`,
      '26 урок': `Сегодня у нас прошёл урок №6 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- узнали из чего состоит клип;
- при помощи различных нейросетей сгенерировали контент для клипа;
- познакомились с приложением CapCut;
- создали собственный клип по игре Minecraft в CapCut!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с понятием "вайбкодинг";
- познакомимся с понятием "браузерная игра";
- создадим игру "Лабиринт"!`,
      '27 урок': `Сегодня у нас прошёл урок №7 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с понятиями "вайбкодинг" и "MVP";
- познакомились с понятием "браузерная игра";
- познакомились со структурой веб-страницы;
- создали игру "Лабиринт"!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- продолжим работу с DeepSeek;
- создадим игру "Тачки"!`,
      '28 урок': `Сегодня у нас прошёл урок №8 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- продолжили работу с DeepSeek;
- познакомились с основными тегами веб-страницы;
- познакомились с историей браузеров;
- научились писать детальные промпты;
- создадили игру "Тачки"!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- создадим игру "Платформер"!`,
      '29 урок': `Сегодня у нас прошёл урок №9 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с историей эмодзи;
- познакомились с историей игрового жанра;
- создали игру "Платформер"! 

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с историей игрового жанра;
- создадим браузерную игру "Тамагочи"!`,
      '30 урок': `Сегодня у нас прошёл урок №10 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с историей игрового жанра;
- создали браузерную игру "Тамагочи"!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с фреймворком Flutter;
- познакомимся с языком программирования Dart;
- приступим к созданию мобильного приложения!`,
      '31 урок': `Сегодня у нас прошёл урок №11 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с фреймворком Flutter;
- познакомились с языком программирования Dart;
- создали мобильное приложение!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- продолжим работу с нейросетями для кодирования;
- продолжим работу с фреймворком Flutter;
- создадим еще одно мобильное приложение!`,
      '32 урок': `Сегодня у нас прошёл урок №12 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- продолжили работу с нейросетью Gemini;
- познакомились с иерархией Flutter приложений;
- создали клон популярной игры "2048"!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с игровым движком Unity; 
- напишем сценарий для игры;
- приступим к созданию игры на Unity!`,
      '33 урок': `Сегодня у нас прошёл урок №13 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с нейросетями для генерации 3D-сцен и ландшафтов; 
- создали собственный виртуальный мир при помощи нейросети;
- добавили уровень в игру!



Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- продолжим работу над проектом в Unity;
- настроим геймплей!`,
      '34 урок': `Сегодня у нас прошёл урок №14 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- продолжили работу над проектом в Unity;
- познакомились с языком программирования C#;
- написали первые скрипты для игрока и сбора предметов.
- настроили геймплей!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с нейросетями для создания 3D моделей;
- научимся анимировать 3D-модели;
- добавим противников в игру!`,
      '35 урок': `Сегодня у нас прошёл урок №15 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с платформой Meshy AI;
- познакомились с понятием "риггинг";
- научились анимировать 3D-модели;
- добавили собственного противника в Unity!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
-  познакомимся с новыми компонентами Unity;
-  заставим нашего противника нас преследовать;
-  продолжим работу над проектом!`,
      '36 урок': `Сегодня у нас прошёл урок №16 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
-  познакомились с AI и UI Unity;
- добавили полоску здоровья на уровень;
- заставили нашего противника нас преследовать и атаковать!


Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с плагинами Unity;
- познакомимся с созданием ландшафта
- создадим второй уровень!`,
      '37 урок': `Сегодня у нас прошёл урок №17 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- познакомились с префабами;
- познакомились  с созданием ландшафта;
- создали скрипт для перехода между уровнями;
- создали второй уровень!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- запрограммируем систему боя;
- добавим в игру меню;
- закончим создание проекта на Unity!`,
      '38 урок': `Сегодня у нас прошёл урок №18 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- запрограммиро;
- закончили создание проекта на Unity!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- разработаем идею для собственного проекта;
- приступим к созданию собственного проекта!`,
      '39 урок': `Сегодня у нас прошёл урок №19 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
На нем мы:
- разработали идею для собственного проекта;
- приступили к созданию собственного проекта!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- подготовимся к защите собственного проекта;
- защитим собственный проект!`,
      '40 урок': `Сегодня у нас прошёл последний урок №20 модуля "Продвинутая работа с нейросетями и вайбкодинг"🎊!
💥На нем мы:
- закончили создание собственного проекта;
- подготовили защиту собственного проекта;
- защитили собственный проект;
- подвели итоги модуля!

Все ребята молодцы, отлично справились с проектами и подготовкой! У каждого получился прекрасный проект и достойная защита! Отдельно хотелось бы отметить ….`
    },
    'третий': {
      '41 урок': `Сегодня у нас прошёл урок №1 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с ИИ-аватарами;
- познакомились с сервисами для создания статичных ИИ-аватаров;
- создали коллекцию ИИ-аватаров в различных стилях!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с анимированными аватарами;
- узнаем, как они создаются;
- создадим коллекцию анимированных аватаров!`,
      '42 урок': `Сегодня у нас прошёл урок №2 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с анимированными аватарами;
- узнали, как они создаются;
- создали коллекцию анимированных аватаров!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с видео-аватарами;
- узнаем, что такое липсинг;
- создадим видео-аватаров!`,
      '43 урок': `Сегодня у нас прошёл урок №3 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с видео-аватарами;
- узнали, что такое липсинг и треккинг лица;
- создали видео-аватаров!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с основными видео трендами;
- сгенерируем трендовый контент с ИИ-аватаром!`,
      '44 урок': `Сегодня у нас прошёл урок №4 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с основными видео трендами этого лета;
- узнали, как создать вирусный контент;
- создали трендовый контент с ИИ-аватаром!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- создадим канал на Rutube;
- опубликуем видео на канале Rutube!`,
      '45 урок': `Сегодня у нас прошёл урок №5 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- создали канал на Rutube;
- сгенерировали логотип, описание и обложку для канала;
- опубликовали  видео на канале Rutube! 

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с понятиями "логлайн" и "сеттинг";
- создадим «библиотеку идей» для будущего мультфильма!`,
      '46 урок': `Сегодня у нас прошёл урок №6 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- узнали из каких этапов состоит создание мультфильма;
- познакомились с понятиями "логлайн",  "сеттинг" и "лор";
- создали «библиотеку идей» для будущего мультфильма!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся со структурой повествования;
- создадим сценарный план для первой серии мультсериала!`,
      '47 урок': `Сегодня у нас прошёл урок №7 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились со структурой повествования;
- узнали секреты хорошей истории;
- создали сценарный план для первых серий мультсериала!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с понятиями "протагонист" и "антагонист";
- изучим основы дизайна персонажа;
- создадим библиотеку героев!`,
      '48 урок': `Сегодня у нас прошёл урок №8 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с понятиями "протагонист" и "антагонист";
- изучили основы дизайна персонажа;
- создали библиотеку героев!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- вспомним, что такое "концепт-арт";
- сгенерируем локации и персонажей для мультфильма!`,
      '49 урок': `Сегодня у нас прошёл урок №9 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- вспомнили, что такое "концепт-арт";
- узнали, что такое "пайплайн";
- сгенерировали локации и персонажей для мультфильма!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- узнаем, как создаются захватывающие диалоги;
- создадим диалоги для наших персонажей!`,
      '50 урок': `Сегодня у нас прошёл урок №10 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- узнали, как создаются захватывающие диалоги;
- создали диалоги для наших персонажей!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- узнаем, что такое "раскадровка";
- составим раскадровки для наших серий!`,
      '51 урок': `Сегодня у нас прошёл урок №11 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- узнали, что такое "раскадровка";
- вспомнили планы и ракурсы съемки;
- составили раскадровки для наших серий!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- узнаем о видеоэффектах;
- познакомимся с видами анимаций;
- создадим анимации для мультфильма!`,
      '52 урок': `Сегодня у нас прошёл урок №12 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились с видами анимаций;
- узнали о принципах классической анимации;
- создали анимации для мультфильма!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся с нейросетями для создания аудиофайлов;
- создадим озвучку для мультфильма!`,
      '53 урок': `Сегодня у нас прошёл урок №13 модуля "ИИ аватары и создание мультфильма"🎊!
На нём мы:
- познакомились;
- узнали;
- создали!

Все ребята молодцы, отлично справились с заданиями!

💥На следующем занятии мы:
- познакомимся;
- создадим!`
    }
  },
  'Графический дизайн': {
    '1 урок': `Сегодня у нас прошёл урок №1 интенсива Графический дизайн.
На нём мы:
- узнали, что такое графический дизайн, какие направления в нём существуют;
- познакомились с графическим редактором Figma;
- научились рисовать и изменять простые геометрические фигуры:
- создали простые иллюстрации!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с инструментом "Pen";
- познакомимся с плагинами в Figma;
- научимся добавлять градиентную заливку;
- создадим пейзажные иллюстрации!`,
    '2 урок': `Сегодня у нас прошёл урок №2 интенсива Графический дизайн.
На нём мы:
- познакомились с инструментом "Pen";
- познакомились с плагинами в Figma;
- научились добавлять градиентную заливку;
- создали пейзажные иллюстрации!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с типографикой, с видами шрифтов;
- научимся работать с текстом в фигма;
- создадим инфографику!`,
    '3 урок': `Сегодня у нас прошёл урок №3 интенсива Графический дизайн.
На нем мы:
- познакомились с типографикой, с видами шрифтов;
- научились работать с текстом в фигма;
- создали инфографику!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с правилами создания иконок;
- узнаем, что такое "булевы операции" и как с ними работать в Figma;
- создадим набор иконок для приложения!`,
    '4 урок': `Сегодня у нас прошёл урок №4 интенсива Графический дизайн.
На нем мы:
- познакомились с правилами создания иконок;
- узнали, что такое "булевы операции" и как с ними работать в Figma;
- создали набор иконок для приложения!

Все ребята молодцы, отлично справились с заданиями!

А на следующем занятии мы:
- узнаем, что такое "логотип", какие виды логотипов существуют;
- познакомимся с правилами создания логотипов;
- создадим несколько логотипов для компаний!`,
    '5 урок': `Сегодня у нас прошёл урок №5 интенсива Графический дизайн.
На нем мы:
- узнали, что такое "логотип", какие виды логотипов существуют;
- познакомились с правилами создания логотипов;
- создали несколько логотипов для компаний!

Все ребята молодцы, отлично справились с заданиями!

На следующем уроке мы:
- познакомимся с основами UX-дизайна, пользовательскими сценариями;
- узнаем, что такое файрфрейм и как его использовать;
- создадим несколько файрфреймов и макетов экранов для приложения!`,
    '6 урок': `Сегодня у нас прошёл урок №6 интенсива Графический дизайн.
На нем мы:
- познакомились с основами UX-дизайна, пользовательскими сценариями;
- узнали, что такое файрфрейм и как его использовать;
- создали несколько файрфреймов и макетов экранов для приложения!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- познакомимся с основами UI-дизайном;
- начнем создавать макет приложения!`,
    '7 урок': `Сегодня у нас прошёл урок №7 интенсива Графический дизайн.
На нем мы:
- познакомились с основами UI-дизайном;
- начали создавать макет приложения!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- доделаем макет приложения;
- познакомимся с вкладкой "Prototype";
- научимся создавать кликабельный прототип приложения, добавим переходы между экранами, прокручиваемую галерею и открывающиеся окна!`,
    '8 урок': `Сегодня у нас прошёл урок №8 интенсива Графический дизайн.
На нем мы:
- доделали макет приложения;
- познакомились с вкладкой "Prototype";
- научились создавать кликабельный прототип приложения, добавим переходы между экранами, прокручиваемую галерею и открывающиеся окна!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы
- познакомимся с сетками в Figma, их настройками;
- начнём создавать макет сайта!`,
    '9 урок': `Сегодня у нас прошёл урок №9 интенсива Графический дизайн.
На нем мы:
- познакомились с сетками в Figma, их настройками;
- начали создавать макет сайта!

Все ребята молодцы, отлично справились с заданиями!

На следующем занятии мы:
- доделаем макет сайта;
- узнаем, что такое "компоненты", научимся их создавать и добавлять варианты;
- создадим кликабельный прототип сайта;
- подведём итоги интенсива!`,
    '10 урок': `Сегодня у нас прошёл последний урок №10 интенсива Графический дизайн.
На нем мы:
- доделали макет сайта;
- узнали, что такое "компоненты", научимся их создавать и добавлять варианты;
- создали кликабельный прототип сайта;
- подвели итоги интенсива!

Все ребята молодцы, отлично справились с заданиями!`
  }
};